{
  "repo_name": "Friz-zy_awesome-linux-containers",
  "readme_content": "# Awesome Linux Containers\n\n[![#StandWithBelarus](https://img.shields.io/badge/Belarus-red?label=%23%20Stand%20With&labelColor=white&color=red)\n<img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/Presidential_Standard_of_Belarus_%28fictional%29.svg/240px-Presidential_Standard_of_Belarus_%28fictional%29.svg.png\" width=\"20\" height=\"20\" alt=\"Voices From Belarus\" />](https://bysol.org/en/) [![Stand With Ukraine](https://raw.githubusercontent.com/vshymanskyy/StandWithUkraine/main/badges/StandWithUkraine.svg)](https://vshymanskyy.github.io/StandWithUkraine)\n\n[![Awesome](https://cdn.rawgit.com/sindresorhus/awesome/d7305f38d29fed78fa85652e3a63e154dd8e8829/media/badge.svg)](https://github.com/sindresorhus/awesome)\n\n## Table of Contents\n\n* [About the Author](#About-the-Author)\n* [Foundations](#foundations)\n* [Specifications](#specifications)\n* [Clouds](#clouds)\n* [Operating Systems](#operating-systems)\n* [Hypervisors](#hypervisors)\n* [Containers](#containers)\n* [Sandboxes](#sandboxes)\n* [Partial Access](#partial-access)\n* [Filesystem](#filesystem)\n* [Dashboard](#dashboard)\n* [Best practices](#best-practices)\n* [Security](#security)\n  - [Tools](#tools)\n  - [Links](#links)\n  - [Levels of security problems](#levels-of-security-problems)\n  - [Technologies for security](#technologies-for-security)\n* [Another Information Sources](#another-information-sources)\n\n## About the Author\n\nHello, everyone! My name is Filipp, and I have been working with high load distribution systems and services, security, monitoring, continuous deployment and release management (DevOps domain) since 2012.\n\nOne of my passions is developing DevOps solutions and contributing to the open-source community. By sharing my knowledge and experiences, I strive to save time for both myself and others while fostering a culture of collaboration and learning.\n\nI had to leave my home country, Belarus, due to my participation in [protests against the oppressive regime of dictator Lukashenko](https://en.wikipedia.org/wiki/2020%E2%80%932021_Belarusian_protests), who maintains a close affiliation with Putin. Since then, I'm trying to build my life from zero in other countries.\n\nIf you are seeking a skilled DevOps lead or architect to enhance your project, I invite you to connect with me on [LinkedIn](https://www.linkedin.com/in/filipp-frizzy-289a0360/) or explore my valuable contributions on [GitHub](https://github.com/Friz-zy/). Let's collaborate and create some cool solutions together :)\n\n## Foundations\n\n* [OPEN CONTAINER INITIATIVE](https://www.opencontainers.org/)  \nThe Open Container Initiative is a lightweight, open governance structure, to be formed under the auspices of the Linux Foundation, for the express purpose of creating open industry standards around container formats and runtime.\n* [Cloud Native Computing Foundation](https://cncf.io/)  \nThe Cloud Native Computing Foundation will create and drive the adoption of a new set of common container technologies informed by technical merit and end user value, and inspired by Internet-scale computing.\n* [Cloud Foundry Foundation](https://www.cloudfoundry.org/foundation/)  \nThe Cloud is our foundry.\n\n## Specifications\n\n* [Open Container Specifications](https://github.com/opencontainers/specs)  \nThis project is where the Open Container Initiative Specifications are written. This is a work in progress. \n* [App Container basics](https://github.com/coreos/rkt/blob/master/Documentation/app-container.md)  \nApp Container (appc) is an open specification that defines several aspects of how to run applications in containers: an image format, runtime environment, and discovery protocol.\n* [Systemd Container Interface](https://wiki.freedesktop.org/www/Software/systemd/ContainerInterface/)  \nSystemd is a suite of basic building blocks for a Linux system. It provides a system and service manager that runs as PID 1 and starts the rest of the system. If you write a container solution, please consider supporting the following interfaces.\n* [Nulecule Specification](https://github.com/projectatomic/atomicapp/tree/master/docs/spec)  \nNulecule defines a pattern and model for packaging complex multi-container applications and services, referencing all their dependencies, including orchestration metadata in a container image for building, deploying, monitoring, and active management.\n* [Oracle microcontainer manifesto](https://blogs.oracle.com/developers/the-microcontainer-manifesto)  \nThis is not a new container format, but simply a specific method for constructing a container that allows for better security and stability.\n* [Cloud Native Application Bundle Specification](https://github.com/deislabs/cnab-spec)  \nA package format specification that describes a technology for bundling, installing, and managing distributed applications, that are by design, cloud agnostic.\n\n## Clouds\n\n* [Amazon EC2 Container Service ](https://aws.amazon.com/ecs/)   \nContainer management service that supports Docker containers and allows you to easily run applications on a managed cluster of Amazon EC2 instances.\n* [Google Cloud Platform](https://cloud.google.com/container-engine/)  \nRun Docker containers on Google Cloud Platform, powered by Kubernetes. Google Container Engine actively schedules your containers, based on declared needs, on a managed cluster of virtual machines. \n* [Jelastic](http://jelastic.com/)  \nUnlimited PaaS and Container-Based IaaS in a Joint Cloud Solution for DevOps.\n* [Joyent](https://www.joyent.com/)  \nHigh-Performance Container-Native Infrastructure for Today's Demanding Real-Time Web and Mobile Applications.\n* [Kubernetes](http://kubernetes.io/)  \nManage a cluster of Linux containers as a single system to accelerate Dev and simplify Ops.\n* [Mesosphere](https://mesosphere.com/)  \nThe Mesosphere Datacenter Operating System (DCOS) is a new kind of operating system that spans all of the machines in your datacenter or cloud. It provides a highly elastic, and highly scalable way of deploying applications, services and big data infrastructure on shared resources.\n* [OpenShift Origin](https://www.openshift.org/)  \nOpenShift Origin is a distribution of [Kubernetes](http://kubernetes.io/) optimized for continuous application development and multi-tenant deployment. Origin adds developer and operations-centric tools on top of Kubernetes to enable rapid application development, easy deployment and scaling, and long-term lifecycle maintenance for small and large teams.\n* [Warden](https://github.com/cloudfoundry/warden)  \nManages isolated, ephemeral, and resource controlled environments. Part of Cloud Foundry - the open platform as a service project.\n* [Virtuozzo](https://virtuozzo.com)  \nA platform, built on Virtuozzo containers, that can be easily run on top of any bare-metal or virtual servers in any public or private cloud, to automate, optimize, and accelerate internal IT and development processes.\n* [Rancher](http://rancher.com/)  \nRancher is a complete, open source platform for deploying and managing containers in production. It includes commercially-supported distributions of Kubernetes, Mesos, and Docker Swarm, making it easy to run containerized applications on any infrastructure.\n* [Docker Swarm](https://docs.docker.com/engine/swarm/)  \nDocker Swarm is native clustering for Docker.\n* [Azure Container Service](https://azure.microsoft.com/en-us/services/container-service/)  \nAzure Container Service optimizes the configuration of popular open source tools and technologies specifically for Azure.\n* [CIAO](https://ciao-project.github.io/)  \n Cloud Integrated Advanced Orchestrator for Intel Clear Linux OS. \n* [Alibaba Cloud Container Service](https://www.alibabacloud.com/fr/product/container-service)  \nContainer Service is a high-performance and scalable container application management service that enables you to use Docker and Kubernetes to manage the lifecycle of containerized applications.\n* [Nomad](https://www.nomadproject.io/)  \n HashiCorp Nomad is a single binary that schedules applications and services on Linux, Windows, and Mac. It is an open source scheduler that uses a declarative job file for scheduling virtualized, containerized, and standalone applications.\n\n## Operating Systems\n\n* [CoreOs](https://coreos.com/)  \nA lightweight Linux operating system designed for clustered deployments providing automation, security, and scalability for your most critical applications.\n* [RancherOS](http://rancher.com/rancher-os/)  \nRancherOS is a tiny Linux distro that runs the entire OS as Docker containers.\n* [Project Atomic](http://www.projectatomic.io/)  \nProject Atomic provides the best platform for your Linux Docker Kubernetes (LDK) application stack. Use immutable infrastructure to deploy and scale your containerized applications.\n* [Snappy Ubuntu Core](https://www.ubuntu.com/cloud/snappy)  \nUbuntu Core is the perfect system for large-scale cloud container deployments, bringing transactional updates to the world’s favourite container platform.\n* [ResinOS](https://resinos.io/)  \nA host OS tailored for containers, designed for reliability, proven in production.\n* [Photon](https://github.com/vmware/photon)  \nPhoton OS is a minimal Linux container host designed to have a small footprint and tuned for VMware platforms. Photon is intended to invite collaboration around running containerized and Linux applications in a virtualized environment.\n* [Clear Linux Project](https://clearlinux.org)  \nThe Clear Linux Project for Intel Architecture is a distribution built for various Cloud use cases.\n* [CargOS](https://cargos.io/)  \nCargOS is a new lightweight, open source, platform for Docker hosts that aims for speed, manageability and security. Releases are built for 64-bit Intel/AMD CPUs.\n* [OSv](http://osv.io/)  \nOSv is the open source operating system designed for the cloud. Built from the ground up for effortless deployment and management, with superior performance.\n* [HypriotOS](http://blog.hypriot.com/about/)  \nMinimal Debian-based operating systems that is optimized to run Docker. It made it dead easy use Docker on any Raspberry Pi. \n* [MCL](https://mcl.host)  \nMCL (*Minimal Container Linux*) is a from scratch minimal Linux OS designed specifically to run containers. It has a small footprint of ~50MB and boots within seconds. It is currently optimized to run Docker.\n\n## Hypervisors\n\n* [Docker](https://github.com/veggiemonk/awesome-docker#cloud-infrastructure)  \nAn open platform for distributed applications for developers and sysadmins. **Standard de facto**.\n* [LXD](https://github.com/lxc/lxd)  \nDaemon based on liblxc offering a REST API to manage LXC containers.\n* [OpenVZ](https://openvz.org/)  \nOpenVZ is container-based virtualization for Linux. OpenVZ creates multiple secure, isolated Linux containers (otherwise known as VEs or VPSs) on a single physical server enabling better server utilization and ensuring that applications do not conflict.\n* [MultiDocker](https://github.com/marty90/multidocker)  \nCreate a secure multi-user Docker machine, where each user is segregated into an indepentent container.\n* [Lithos](https://github.com/tailhook/lithos/)  \nLithos is a process supervisor and containerizer for running services. It is not intended to be system init, but rather tries to be a base tool to build container orchestration.\n* [containerd](https://containerd.io/)  \nA container runtime which can manage a complete container lifecycle - from image transfer/storage to container execution, supervision and networking.\n\n## Containers\n\n* [runc](https://github.com/opencontainers/runc)  \nrunc is a CLI tool for spawning and running containers according to the OCS specification.\n* [Bocker](https://github.com/p8952/bocker)  \nDocker implemented in around 100 lines of bash.\n* [Rocket](https://github.com/coreos/rkt)  \nrkt (pronounced \"rock-it\") is a CLI for running app containers on Linux. rkt is designed to be composable, secure, and fast. Based on AppC specification.\n* [LXC](https://github.com/lxc/lxc)  \nLXC is the well known set of tools, templates, library and language bindings. It's pretty low level, very flexible and covers just about every containment feature supported by the upstream kernel.\n* [Vagga](https://github.com/tailhook/vagga)  \nVagga is a fully-userspace container engine inspired by Vagrant and Docker, specialized for development environments.\n* [libct](https://github.com/xemul/libct)  \nLibct is a containers management library which provides convenient API for frontend programs to rule a container during its whole lifetime.\n* [libvirt](https://libvirt.org/drvlxc.html)  \nA big toolkit to interact with the virtualization capabilities of recent versions of Linux (and other OSes).\n* [systemd-nspawn](https://wiki.archlinux.org/index.php/Systemd-nspawn)  \nSpawn a namespace container for debugging, testing and building. Part of [systemd](https://wiki.freedesktop.org/www/Software/systemd/).\n* [porto](https://github.com/yandex/porto)  \nThe main goal of Porto is to create a convenient, reliable interface over several Linux kernel mechanism such as cgroups, namespaces, mounts, networking etc.\n* [udocker](https://github.com/indigo-dc/udocker)  \nA basic user tool to execute simple containers in batch or interactive systems without root privileges.\n* [Let Me Contain That For You](https://github.com/google/lmctfy)  \nLMCTFY is the open source version of Google’s container stack, which provides Linux application containers.\n* [cc-oci-runtime](https://github.com/01org/cc-oci-runtime)  \nIntel Clear Linux OCI (Open Containers Initiative) compatible runtime.\n* [railcar](https://github.com/oracle/railcar)  \nRailcar is a rust implementation of the opencontainers initiative's runtime spec. It is similar to the reference implementation runc, but it is implemented completely in rust for memory safety without needing the overhead of a garbage collector or multiple threads.\n* [Kata Containers](https://katacontainers.io/)  \nKata Containers is a new open source project building extremely lightweight virtual machines that seamlessly plug into the containers ecosystem.\n* [plash](https://github.com/ihucos/plash/)  \nLightweight, rootless containers.\n* [runv](https://github.com/hyperhq/runv)  \nHypervisor-based (KVM, Xen, QEMU) Runtime for OCI. Security by isolation.\n* [podman](https://github.com/containers/libpod)  \nFull management of container lifecycle.\n* [firecracker](https://github.com/firecracker-microvm/firecracker)  \nFirecracker runs workloads in lightweight virtual machines, called microVMs, which combine the security and isolation properties provided by hardware virtualization technology with the speed and flexibility of containers.\n* [sysbox](https://github.com/nestybox/sysbox)  \nSysbox is a \"runc\" that creates secure (rootless) containers / pods that run not just microservices, but most workloads that run in VMs (e.g., systemd, Docker, and Kubernetes), seamlessly.\n* [youki](https://github.com/containers/youki)  \nA container runtime written in Rust.\n* [footloose](https://github.com/weaveworks/footloose)  \nContainers that look like Virtual Machines.\n\n## Sandboxes\n\n* [Firejail](https://l3net.wordpress.com/projects/firejail/)  \nFirejail is a SUID sandbox program that reduces the risk of security breaches by restricting the running environment of untrusted applications using Linux namespaces, seccomp-bpf and Linux capabilities.\n* [NsJail](https://github.com/google/nsjail)  \nNsJail is a process isolation tool for Linux. It makes use of the namespacing, resource control, and seccomp-bpf syscall filter subsystems of the Linux kernel.\n* [Subuser](https://github.com/subuser-security/subuser)  \nSecuring the Linux desktop with Docker.\n* [Snappy](https://wiki.ubuntu.com/SecurityTeam/Specifications/SnappyConfinement)  \nSnappy Ubuntu Core is a new rendition of Ubuntu with transactional updates - a minimal server image with the same libraries as today’s Ubuntu, but applications are provided through a simpler mechanism.\n* [xdg-app](https://wiki.gnome.org/Projects/SandboxedApps)  \nxdg-app is a system for building, distributing and running sandboxed desktop applications on Linux.\n* [Bubblewrap](https://github.com/projectatomic/bubblewrap)  \nRun applications in a sandbox using Linux namespaces without root privileges, with user namespacing provided via setuid binary.\n* [singularity](https://github.com/singularityware/singularity)  \nUniversal application containers for Linux.\n* [Lxroot](https://github.com/parke/lxroot)  \nLxroot is a flexible, lightweight, and safer alternative to chroot and/or Docker for non-root users on Linux.\n\n## Partial Access\n\n* [nsenter](http://man7.org/linux/man-pages/man1/nsenter.1.html)  \nRun program with namespaces of other processes. Part of the util-linux.\n* [ip-netns](http://man7.org/linux/man-pages/man8/ip-netns.8.html)  \nProcess network namespace management. Part of the iproute2.\n* [unshare](http://man7.org/linux/man-pages/man1/unshare.1.html)  \nRun program with some namespaces unshared from parent. Part of the util-linux.\n* [python-nsenter](https://github.com/zalando/python-nsenter)  \nThis Python package allows entering Linux kernel namespaces (mount, IPC, net, PID, user and UTS) by doing the \"setns\" syscall.\n* [butter](https://pypi.python.org/pypi/butter)  \nPython library to interface to low level linux features (inotify, fanotify, timerfd, signalfd, eventfd, containers) with asyncio support.\n* [pyspaces](https://github.com/Friz-zy/pyspaces)  \nWorks with Linux namespaces through glibc with pure python.\n* [CRIU](https://criu.org/Main_Page)  \nCheckpoint/Restore In Userspace is a software tool for Linux operating system. Using this tool, you can freeze a running application (or part of it) and checkpoint it to a hard drive as a collection of files. CRIU integrated with Docker and LXC to implement Live migration of containers.\n* [Moby](https://github.com/moby/moby)  \nA \"Lego set\" of toolkit components for containers software created by Docker.\n\n## Filesystem\n\n* [container-diff](https://github.com/GoogleCloudPlatform/container-diff)  \nA tool for analyzing and comparing container images.\n* [buildah](https://github.com/projectatomic/buildah)  \nA tool which facilitates building OCI container images.\n* [skopeo](https://github.com/projectatomic/skopeo)  \nWork with remote images registries - retrieving information, images, signing content.\n* [img](https://github.com/jessfraz/img)  \nStandalone, daemon-less, unprivileged Dockerfile and OCI compatible container image builder.\n* [dgr](https://github.com/blablacar/dgr)  \nCommand line utility designed to build and to configure at runtime App Containers Images (ACI) and App Container Pods (POD) based on convention over configuration.\n* [Whaler](https://github.com/P3GLEG/Whaler)  \nWhaler is designed to reverse engineer a Docker Image into the Dockerfile that created it.\n* [dive](https://github.com/wagoodman/dive)  \nA tool for exploring each layer in a docker image.\n* [go-containerregistry](https://github.com/google/go-containerregistry)  \nGo library and CLIs for working with container registries.\n* [kaniko](https://github.com/GoogleContainerTools/kaniko)  \nKaniko is a tool to build container images from a Dockerfile, inside a container or Kubernetes cluster.\n* [umoci](https://umo.ci/)  \nUmoci is a tool to manipulate OCI container images, and can be used as a rudimentary build tool.\n* [docker pushrm](https://github.com/christian-korneck/docker-pushrm)  \nA Docker CLI plugin that that lets you push the README.md file from the current directory to a container registry. Supports Docker Hub, Quay and Harbor.\n\n\n## Dashboard\n\n* [LXC-Web-Panel](https://lxc-webpanel.github.io/)  \nWeb panel for LXC on Ubuntu.\n* [Liman](https://github.com/salihciftci/liman)  \nBasic docker monitoring web application.\n* [portainer](https://github.com/portainer/portainer)  \nLightweight Docker management UI.\n* [swarmpit](https://github.com/swarmpit/swarmpit)  \nLightweight mobile-friendly Docker Swarm management UI.\n\n## Best practices\n\n* [The Twelve-Factor App](https://12factor.net/)  \nThe twelve-factor app is a methodology for building software-as-a-service apps.\n* [Container Best Practices](http://docs.projectatomic.io/container-best-practices/)  \nA collaborative project to document container-based application architecture, creation and management from Project Atomic.\n\n## Security\n\n### Tools\n\n* [Docker bench security](https://github.com/docker/docker-bench-security)  \nThe Docker Bench for Security is a script that checks for dozens of common best-practices around deploying Docker containers in production.\n* [CoreOS Clair](https://coreos.com/blog/vulnerability-analysis-for-containers/)  \nOpen Source Vulnerability Analysis for your Containers.\n* [bane](https://github.com/jfrazelle/bane)  \nCustom AppArmor profile generator for docker containers.\n* [OpenSCAP](https://github.com/OpenSCAP/container-compliance)  \nThe OpenSCAP ecosystem provides multiple tools to assist administrators and auditors with assessment, measurement and enforcement of security baselines.\n* [drydock](https://github.com/zuBux/drydock)  \nDrydock provides a flexible way of assessing the security of your Docker daemon configuration and containers using editable audit templates.\n* [trireme](https://www.aporeto.com/trireme/)  \nSecurity by segmentation for Docker and Kubernetes.\n* [goss](https://github.com/aelsabbahy/goss)  \nQuick and Easy server testing/validation.\n* [sockguard](https://github.com/buildkite/sockguard)  \nA proxy for docker.sock that enforces access control and isolated privileges.\n* [gvisor](https://github.com/google/gvisor)  \ngVisor is a user-space kernel, written in Go, that implements a substantial portion of the Linux system surface. It includes an Open Container Initiative (OCI) runtime called runsc that provides an isolation boundary between the application and the host kernel. The runsc runtime integrates with Docker and Kubernetes, making it simple to run sandboxed containers.\n* [docker-explorer](https://github.com/google/docker-explorer/)  \nA tool to help forensicate offline docker acquisitions.\n* [oci-seccomp-bpf-hook](https://github.com/containers/oci-seccomp-bpf-hook)  \nOCI hook to trace syscalls and generate a seccomp profile.\n\n### Links\n* [CIS Security Benchmarks](https://benchmarks.cisecurity.org/about/)\n* [Are Docker containers really secure?](https://opensource.com/business/14/7/docker-security-selinux)\n* [Bringing new security features to Docker](https://opensource.com/business/14/9/security-for-docker)\n* [Docker, Linux Containers (LXC), and security](http://www.slideshare.net/jpetazzo/docker-linux-containers-lxc-and-security)\n* [For containers, security is problem #1](http://www.itworld.com/article/2920349/security/for-containers-security-is-problem-1.html)\n* [Linux Container Security](https://mjg59.dreamwidth.org/33170.html)\n* [Ask HN: Best Linux sandbox?](https://news.ycombinator.com/item?id=10030868)\n* [CIS Docker 1.6 Benchmark v1.0.0](https://benchmarks.cisecurity.org/tools2/docker/CIS_Docker_1.6_Benchmark_v1.0.0.pdf)\n* [Understanding docker security and best practices](https://blog.docker.com/2015/05/understanding-docker-security-and-best-practices/)\n* [Update on Ubuntu Phone security issue](https://insights.ubuntu.com/2015/10/15/update-on-ubuntu-phone-security-issue/)\n* [Don't expose the Docker socket (not even to a container)](https://www.lvh.io/posts/dont-expose-the-docker-socket-not-even-to-a-container/)\n* [RedHat Blog](http://rhelblog.redhat.com/?s=container&submit=Search)\n  - [Introduction to Linux Containers](https://access.redhat.com/articles/1353593)\n  - [What’s Next for Containers? User Namespaces](http://rhelblog.redhat.com/2015/07/07/whats-next-for-containers-user-namespaces/#more-1004)\n  - [Architecting Containers Part 1: Why Understanding User Space vs. Kernel Space Matters](http://rhelblog.redhat.com/2015/07/29/architecting-containers-part-1-user-space-vs-kernel-space/)\n  - [Architecting Containers Part 2: Why the User Space Matters](http://rhelblog.redhat.com/2015/09/17/architecting-containers-part-2-why-the-user-space-matters-2/)\n  - [Secure Your Containers with this One Weird Trick](http://rhelblog.redhat.com/2016/10/17/secure-your-containers-with-this-one-weird-trick/)\n* [Why you shouldn't use ENV variables for secret data](https://diogomonica.com/2017/03/27/why-you-shouldnt-use-env-variables-for-secret-data/)\n* [When to use-Docker alternatives rkt and LXD](http://searchitoperations.techtarget.com/tip/When-to-use-Docker-alternatives-rkt-and-LXD)\n* [The container is a lie](https://platform.sh/blog/2020/the-container-is-a-lie/)\n\n### Levels of security problems\n\n1) regular application\n\n* always untrusted -> know it\n* suid bit -> mount with nosuid\n* limit available syscall -> seccomp-bpf, grsec\n* leak to another container (bug in namespaces, filesystem) -> user namespaces with different uid inside for each container: 1000 in container - 14293 and 15398 outside; security modules like selinux or apparmor\n\n2) system services like cron, ssh\n\n* run as root -> isolate via bastion host or vm\n* using /dev -> \"devices\" control group  \nThe following device nodes are created in the container by default.  \nThe Docker images are also mounted with nodev, which means that even if a device node was pre-created in the image, it could not be used by processes within the container to talk to the kernel.  \n/dev/console,/dev/null,/dev/zero,/dev/full,/dev/tty*,/dev/urandom,/dev/random,/dev/fuse\n* root calls -> capabilities (cap_sys_admin warning!)  \nHere is the current list of capabilities that Docker uses: chown, dac_override, fowner, kill, setgid, setuid, setpcap, net_bind_service, net_raw, sys_chroot, mknod, setfcap, and audit_write.  \nDocker removes several of these capabilities including the following:  \nCAP_SETPCAP \tModify process capabilities  \nCAP_SYS_MODULE \tInsert/Remove kernel modules   \nCAP_SYS_RAWIO \tModify Kernel Memory  \nCAP_SYS_PACCT \tConfigure process accounting  \nCAP_SYS_NICE \tModify Priority of processes  \nCAP_SYS_RESOURCE \tOverride Resource Limits  \nCAP_SYS_TIME \tModify the system clock  \nCAP_SYS_TTY_CONFIG \tConfigure tty devices  \nCAP_AUDIT_WRITE \tWrite the audit log  \nCAP_AUDIT_CONTROL \tConfigure Audit Subsystem  \nCAP_MAC_OVERRIDE \tIgnore Kernel MAC Policy  \nCAP_MAC_ADMIN \tConfigure MAC Configuration  \nCAP_SYSLOG \tModify Kernel printk behavior  \nCAP_NET_ADMIN \tConfigure the network  \nCAP_SYS_ADMIN \tCatch all  \nuses /proc, /sys -> remount ro, drop cap_sys_admin; security modules like selinux or apparmor; some part of this fs are \"namespace-aware\"  \nDocker mounts these file systems into the container as \"read-only\" mount points.  \n. /sys  \n. /proc/sys  \n. /proc/sysrq-trigger  \n. /proc/irq  \n. /proc/bus  \nCopy-on-write file systems  \nDocker uses copy-on-write file systems. This means containers can use the same file system image as the base for the container. When a container writes content to the image, it gets written to a container specific file system. This prevents one container from seeing the changes of another container even if they wrote to the same file system image. Just as important, one container can not change the image content to effect the processes in another container.\n* uid 0 -> user namespaces, uid 0 mappet to random uid outside\n\n3) system services like devices, network, filesystems\n\n* root -> more of services should work on host outside; isolate sensitive functions, run as non-privileged context\n* full privileges -> isolate on kernel level\n\n4) kernel drivers, network stack, security policies\n\n* absolute privileges -> run it in separate vm\n\n5) general like immutable infrastructure\n\n* container is ro\n* write to small separate rw nosuid part\n\n[src](http://www.slideshare.net/jpetazzo/docker-linux-containers-lxc-and-security)  \n[src](https://opensource.com/business/14/9/security-for-docker)\n\n### Technologies for security\n\nThings are better. For example, most modern container technologies can make use of Linux's built-in security tools such as:  \n[AppArmor](http://wiki.apparmor.net/index.php/Main_Page), [SELinux](http://selinuxproject.org/page/Main_Page) and [Seccomp](http://man7.org/linux/man-pages/man2/seccomp.2.html) policies;  \n[Grsecurity](https://grsecurity.net/);  \n[Control groups (cgroups)](https://access.redhat.com/documentation/en-US/Red_Hat_Enterprise_Linux/6/html/Resource_Management_Guide/ch01.html);  \n[Kernel namespaces](http://man7.org/linux/man-pages/man7/namespaces.7.html)  \n[src](http://www.itworld.com/article/2920349/security/for-containers-security-is-problem-1.html)\n\nSure, you're deploying seccomp, but you can't use selinux inside your container, because the policy isn't per-namespace (?? lxc uses apparmore for each container...)  \n[sVirt](http://selinuxproject.org/page/SVirt) - selinux for kvm  \n[src](https://mjg59.dreamwidth.org/33170.html)\n\nMajor kernel subsystems are not namespaced like:  \n- SELinux  \n- Cgroups  \n- file systems under /sys  \n- /proc/sys, /proc/sysrq-trigger, /proc/irq, /proc/bus\n\nDevices are not namespaced:  \n- /dev/mem  \n- /dev/sd* file system devices  \n- kernel modules\n\nIf you can communicate or attack one of these as a privileged process, you can own the system.  \n[src](https://opensource.com/business/14/7/docker-security-selinux)\n\n## Another Information Sources\n\n* [sysdig-container-ecosystem](https://github.com/draios/sysdig-container-ecosystem)  \nThe ecosystem of awesome new technologies emerging around containers and microservices can be a little overwhelming, to say the least. We thought we might be able to help: welcome to the Container Ecosystem Project.\n* [doger.io](http://doger.io/)  \nThis page is an attempt to document the ins and outs of containers on Linux. This is not just restricted to programmers looking to implement containers or use container like features in their own code but also Sysadmins and Users who want to get more of a handle on how containers work 'under the hood'. \n"
}