{
  "repo_name": "InQuest_awesome-yara",
  "readme_content": "<p align=\"center\">\n  <img height=\"128\" src=\"./awesome-yara.png\"  alt=\"Awesome YARA\" title=\"Awesome YARA\">\n</p>\n\n<h1 align=\"center\">Awesome YARA</h1>\n\nA curated list of awesome YARA rules, tools, and resources. Inspired by [awesome-python](https://github.com/vinta/awesome-python) and [awesome-php](https://github.com/ziadoz/awesome-php).\n\n> YARA is an ancronym for: YARA: Another Recursive Ancronym, or Yet Another Ridiculous Acronym. Pick your choice.\n>\n> -- *[Victor M. Alvarez (@plusvic)](https://twitter.com/plusvic/status/778983467627479040)*\n\n[YARA](https://virustotal.github.io/yara/), the \"pattern matching swiss knife for malware researchers (and everyone else)\" is developed by [@plusvic](https://github.com/plusvic/) and [@VirusTotal](https://github.com/VirusTotal). View it on [GitHub](https://github.com/virustotal/yara).\n\n### Contents\n\n* [Rules](#rules)\n* [Tools](#tools)\n* [Services](#services)\n* [Syntax Highlighters](#syntax-highlighters)\n* [People](#people)\n* [Related Awesome Lists](#related-awesome-lists)\n* [Contributing](#contributing)\n* [Just for Fun](http://yaramate.com)\n\n### Legend\n\n* :eyes: - Actively maintained, a repository worth watching.\n* :gem: - Novel, interesting, educational, or otherwise stand-out content.\n* :sparkles: - Added more recently, shiny new toys.\n* :trophy: - The biggest collection award, awarded to a single repo.\n\n## 100 Days of YARA (#100DaysofYARA)\nAn annual YARA challenge started by [Greg Lesnewich](https://twitter.com/greglesnewich) in 2022, inspired by #100DaysOfCode and taking place in the first 100 days of the year. The goal is to contribute daily to the YARA community through rule creation, source code contributions, or generally teaching/help your colleagues. Other key contributors include [Wesley Shields](https://twitter.com/wxs) and [Steve Miller](https://twitter.com/stvemillertime). For a list of all participants in the first two years of the challenge, see our [Twitter List](https://twitter.com/i/lists/1648861278901764096).\n\nRule collections from prior years of the challenge: [100 Days of YARA](https://github.com/100DaysofYARA)\n\n## Rules\n\n* [AlienVault Labs Rules](https://github.com/AlienVault-Labs/AlienVaultLabs/tree/master/malware_analysis)\n    - Collection of tools, signatures, and rules from the researchers at [AlienVault Labs](https://cybersecurity.att.com/blogs/labs-research). Search the repo for .yar and .yara extensions to find about two dozen rules ranging from APT detection to generic sandbox / VM detection. Last updated in January of 2016.\n* [Apple OSX](https://gist.github.com/pedramamini/c586a151a978f971b70412ca4485c491)\n    - Apple has ~40 YARA signatures for detecting malware on OSX. The file, XProtect.yara, is available locally at /System/Library/CoreServices/XProtect.bundle/Contents/Resources/.\n* [bamfdetect rules](https://github.com/bwall/bamfdetect/tree/master/BAMF_Detect/modules/yara)\n    - Custom rules from Brian Wallace used for bamfdetect, along with some rules from other sources.\n* [bartblaze YARA rules](https://github.com/bartblaze/Yara-rules) :eyes:\n    - Collection of personal YARA rules\n* [BinaryAlert YARA Rules](https://github.com/airbnb/binaryalert/tree/master/rules/public)\n    - A couple dozen rules written and released by AirBnB as part of their BinaryAlert tool (see next section). Detection for hack tools, malware, and ransomware across Linux, Window, and OS X. This is a new and active project.\n* [Burp YARA Rules](https://github.com/codewatchorg/Burp-Yara-Rules)\n    - Collection of YARA rules intended to be used with the Burp Proxy through the Yara-Scanner extension. These rules focus mostly on non-exe malware typically delivered over HTTP including HTML, Java, Flash, Office, PDF, etc. Last updated in June of 2016.\n* [BinSequencer](https://github.com/karttoon/binsequencer)\n    - Find a common pattern of bytes within a set of samples and generate a YARA rule from the identified pattern.\n* [CAPE Rules](https://github.com/kevoreilly/CAPEv2/tree/master/data/yara) :eyes:\n    - Rules from various authors bundled with the Config And Payload Extraction Cuckoo Sandbox extension (see next section).\n* [CDI Rules](https://github.com/CyberDefenses/CDI_yara)\n    - Collection of YARA rules released by [CyberDefenses](https://cyberdefenses.com/blog/) for public use. Built from information in intelligence profiles, dossiers and file work.\n* [Citizen Lab Malware Signatures](https://github.com/citizenlab/malware-signatures)\n    - YARA signatures developed by Citizen Lab. Dozens of signatures covering a variety of malware families. The also inclde a syntax file for Vim. Last update was in November of 2016.\n* [ConventionEngine Rules](https://github.com/stvemillertime/ConventionEngine) :sparkles:\n    - A collection of Yara rules looking for PEs with PDB paths that have unique, unusual, or overtly malicious-looking keywords, terms, or other features.\n* [Deadbits Rules](https://github.com/deadbits/yara-rules) :eyes:\n    - A collection of YARA rules made public by [Adam Swanda](https://www.deadbits.org/), Splunk's Principal Threat Intel. Analyst, from his own recent malware research.\n* [Delivr.to Detections](https://github.com/delivr-to/detections)\n    - This repo serves as a home for detection content developed by the delivr.to team.\n* [Didier Stevens Rules](https://github.com/DidierStevens/DidierStevensSuite) :gem:\n    - Collection of rules from Didier Stevens, author of a suite of tools for inspecting OLE/RTF/PDF. Didier's rules are worth scrutinizing and are generally written purposed towards hunting. New rules are frequently announced through the [NVISO Labs Blog](https://blog.nviso.eu/).\n* [Elastic Security YARA Rules](https://github.com/elastic/protections-artifacts/tree/main/yara)\n    - Elastic Security provides signature-based YARA rules within the Elastic Endpoint product. These rules are used to detect and prevent emerging threats within Linux, Windows, and macOS systems. Our repository holds over 1,000 YARA rules that are used every day to stop a wide range of threats including: Trojans, ransomware, cryptominers, attack penetration frameworks, and more.\n* [ESET IOCs](https://github.com/eset/malware-ioc/) :eyes:\n    - Collection of YARA and Snort rules from IOCs collected by ESET researchers. There's about a dozen YARA Rules to glean from in this repo, search for file extension .yar. This repository is seemingly updated on a roughly monthly interval. New IOCs are often mentioned on the [ESET WeLiveSecurity Blog](https://www.welivesecurity.com/).\n* [Fidelis Rules](https://github.com/fideliscyber/indicators/tree/master/yararules)\n    - You can find a half dozen YARA rules in Fidelis Cyber's IOC repository. They update this repository on a roughly quarterly interval. Complete blog content is also available in this repository.\n* [FireEye](https://github.com/fireeye/red_team_tool_countermeasures)\n    - FireEye Red Team countermeasures detection\n* [Florian Roth Rules](https://github.com/Neo23x0/signature-base/tree/master/yara) :eyes: :gem:\n    - Florian Roth's signature base is a frequently updated collection of IOCs and YARA rules that cover a wide range of threats. There are dozens of rules which are actively maintained. Watch the repository to see rules evolve over time to address false positives / negatives.\n* [Florian Roth's IDDQD Rule](https://gist.github.com/Neo23x0/f1bb645a4f715cb499150c5a14d82b44)\n    - A proof-of-concept rule that shows how easy it actually is to detect red teamer and threat group tools and code.\n* [f0wl yara_rules](https://github.com/f0wl/yara_rules)\n    - A collection of Yara rules from https://dissectingmalwa.re/ blog posts.\n* [Frank Boldewin's Rules](https://github.com/fboldewin/YARA-rules)\n    - A collection of YARA Rules from [@r3c0nst](https://twitter.com/@r3c0nst).\n* [FSF Rules](https://github.com/EmersonElectricCo/fsf/tree/master/fsf-server/yara)\n    - Mostly filetype detection rules, from the EmersonElectricCo FSF project (see next section).\n* [GoDaddy ProcFilter Rules](https://github.com/godaddy/yara-rules)\n    - A couple dozen rules written and released by GoDaddy for use with ProcFilter (see next section). Example rules include detection for packers, mimikatz, and specific malware.\n* [Google Cloud Threat Intelligence(GCTI) Rules](https://github.com/chronicle/GCTI)\n    - Rules to detect CobaltStrike framework and Sliver implant.\n* [h3x2b Rules](https://github.com/h3x2b/yara-rules) :gem:\n    - Collection of signatures from h3x2b which stand out in that they are generic and can be used to assist in reverse engineering. There are YARA rules for identifying crypto routines, highly entropic sections (certificate discovery for example), discovering injection / hooking functionality, and more.\n* [Icewater Rules](https://github.com/SupportIntelligence/Icewater)\n    - Repository of automatically generated YARA rules from Icewater.io. This repository is updated rapidly with newly generated signatures that mostly match on file size range and partial content hashes.\n* [imp0rtp3's Rules](https://github.com/imp0rtp3/yara-rules)\n    - A small repository which contains some browser based rules.\n* [Intezer Rules](https://github.com/intezer/yara-rules) :sparkles:\n    - YARA rules published by Intezer Labs.\n* [InQuest Rules](https://github.com/InQuest/yara-rules) :eyes:\n    - YARA rules published by InQuest researchers mostly geared towards threat hunting on Virus Total. Rules are updated as new samples are collected and novel pivots are discovered. The [InQuest Blog](http://blog.inquest.net) will often discuss new findings.\n* [jeFF0Falltrades Rules](https://github.com/jeFF0Falltrades/YARA-Signatures) :sparkles:\n    - A collection of YARA signatures for various malware families.\n* [kevthehermit Rules](https://github.com/kevthehermit/YaraRules)\n    - Dozens of rules from the personal collection of Kevin Breen. This repository hasn't been updated since February of 2016.\n* [Koodous Community Rules](https://koodous.com/rulesets)\n    - Community-contributed rules for Android APK malware.\n* [Loginsoft Rules](https://research.loginsoft.com/yara-rules/)\n    - Yara Rules for Detecting Malicious Documents targeting Microsoft Office format.\n* [lw-yara](https://github.com/Hestat/lw-yara)\n    - Ruleset for scanning Linux servers for shells, spamming, phishing and other webserver baddies.\n* [ndaal_YARA_passwords_default](https://gitlab.com/ndaal_open_source/ndaal_yara_passwords_default)\n    - YARA rules includes default credentials of at least 1043 organizations which are hashed with different hash permutations such as base64, md5, sha512, etc.\n* [ndaal_YARA_passwords_weak](https://gitlab.com/ndaal_open_source/ndaal_yara_passwords_weak)\n    - YARA rules includes hashed passwords of the top weak passwords. The passwords are hashed in a respective rule according to the following permutations such as base64, md5, sha512, etc.\n* [NCC Group Rules](https://github.com/nccgroup/Cyber-Defence/tree/master/Signatures/yara) :eyes:\n    - A handful of YARA rules released by NCC Group's Cyber Defence team.\n* [MalGamy's YARA_Rules](https://github.com/MalGamy/YARA_Rules)\n    - A small repository which contains some stealer rules.\n* [Malice.IO YARA Plugin Rules](https://github.com/malice-plugins/yara/tree/master/rules) :eyes:\n    - Collection of topical from a variety of sources for the YARA component of the Malice.IO framework.\n* [Malpedia Auto Generated Rules](https://malpedia.caad.fkie.fraunhofer.de/api/get/yara/auto/zip) :sparkles:\n    - A zip file that contains all automatically generated, code-based rules created using Malpedia's YARA-Signator\n* [Malpedia Auto Generated Rules Repo](https://github.com/malpedia/signator-rules) :sparkles:\n    - Repository to simplify access to and synchronization of Malpedia's automatically generated, code-based YARA rules.\n* [McAfee Advanced Threat Research IOCs](https://github.com/advanced-threat-research/IOCs)\n    - IOCs, including YARA rules, to accompany McAfee ATR's blog and other public posts.\n* [McAfee Advanced Threat Research Yara-Rules](https://github.com/advanced-threat-research/Yara-Rules)\n    - Repository of YARA rules made by McAfee ATR Teams.\n* [mikesxrs YARA Rules Collection](https://github.com/mikesxrs/Open-Source-YARA-rules) :eyes: :trophy:\n    - Large collection of open source rules aggregated from a variety of sources, including blogs and other more ephemeral sources. Over 100 categories, 1500 files, 4000 rules, and 20Mb. If you're going to pull down a single repo to play with, this is the one.\n* [Patrick Olsen Rules](https://github.com/prolsen/yara-rules) :gem:\n    - Small collection of rules with a wide footprint for variety in detection. RATs, documents, PCAPs, executables, in-memory, point-of-sale malware, and more. Unfortunately this repository hasn't seen an update since late 2014.\n* [QuickSand Lite Rules](https://github.com/tylabs/quicksand_lite)\n    - This repo contains a C framework and standalone tool for malware analysis, along with several useful YARA rules developed for use with the project.\n* [Rastrea2r](https://github.com/rastrea2r/rastrea2r)\n    - Triage suspect systems and hunt for Indicators of Compromise (IOCs) across thousands of endpoints in minutes.\n* [ReversingLabs YARA Rules](https://github.com/reversinglabs/reversinglabs-yara-rules) :sparkles: :eyes:\n    - A collection of yara rules published by ReversingLabs which covers exploits, infostealers, ransomware, trojans, and viruses. \n* [Securitymagic's YARA Rules](https://github.com/securitymagic/yara)\n    - YARA rules for a variety of threats.\n* [Sophos AI YaraML Rules](https://github.com/inv-ds-research/yaraml_rules)\n    - A repository of Yara rules created automatically as translations of machine learning models. Each directory will have a rule and accompanying metadata: hashes of files used in training, and an accuracy diagram (a ROC curve).\n* [SpiderLabs Rules](https://github.com/SpiderLabs/malware-analysis/tree/master/Yara)\n    - Repository of tools and scripts related to malware analysis from the researchers at SpiderLabs. There's only three YARA rules here and the last update was back in 2015, but worth exploring.\n* [StrangeRealIntel's Daily IOCs](https://github.com/StrangerealIntel/DailyIOC) :gem: :sparkles: :eyes:\n    - Regularly updated YARA rules covering a variety of fresh threats.\n* [t4d's PhishingKit-Yara-Rules](https://github.com/t4d/PhishingKit-Yara-Rules)\n    - This repository, dedicated to Phishing Kits zip files YARA rules, is based on zip raw format analysis to find directories and files names, you don't need yara-extend there.\n* [Telekom Security Malare Analysis Repository](https://github.com/telekom-security/malware_analysis)\n    - This repository comprises scripts, signatures, and additional IOCs of our blog posts at the telekom.com blog.\n* [Tenable Rules](https://github.com/tenable/yara-rules)\n    - Small collection from Tenable Network Security.\n* [TjadaNel Rules](https://github.com/tjnel/yara_repo)\n    - Small collection of malware rules.\n* [VectraThreatLab Rules](https://github.com/VectraThreatLab/reyara)\n    - YARA rules for identifying anti-RE malware techniques.\n* [Volexity - Threat-Intel](https://github.com/volexity/threat-intel) :sparkles: :gem:\n    - This repository contains IoCs related to Volexity public threat intelligence blog posts.\n* [x64dbg Signatures](https://github.com/x64dbg/yarasigs) :gem:\n    - Collection of interesting packer, compiler, and crypto identification signatures.\n* [YAIDS](https://github.com/wrayjustin/yaids) :gem: :sparkles:\n    - YAIDS is a Multi-Threaded Intrusion Detection System using Yara. YAIDS supports all valid Yara rules (including modules) and any PCAP compatible data stream (Network, USB, Bluetooth, etc.).\n* [YARA-FORENSICS](https://github.com/Xumeiquer/yara-forensics)\n    - Collection of file type identifying rules.\n* [yara4pentesters](https://github.com/DiabloHorn/yara4pentesters)\n    - Rules to identify files containing juicy information like usernames, passwords etc.\n* [YaraRules Project Official Repo](https://github.com/Yara-Rules/rules) :eyes:\n    - Large collection of rules constantly updated by the community.\n* [Yara-Unprotect](https://github.com/fr0gger/Yara-Unprotect)\n    - Rules created for the Unprotect Project for detecting malware evasion techniques.\n\n## Tools\n\n* [AirBnB BinaryAlert](https://github.com/airbnb/binaryalert)\n    - Open-source serverless AWS pipeline where any file uploaded to an S3 bucket is immediately scanned with a configurable set of YARA rules.\n* [androguard](https://github.com/Koodous/androguard-yara)\n    - YARA module that integrates APK analysis.\n* [a-ray-grass](https://github.com/hashlookup/a-ray-grass)\n    - YARA module that provides support for bloom filters in yara. In the context of [hashlookup.io](https://hashlookup.io/), it allows to quickly discard known files before any further analysis.\n* [Arya- The Reverse YARA](https://github.com/claroty/arya)\n    - Arya is a unique tool that produces pseudo-malicious files meant to trigger YARA rules. You can think of it like a reverse YARA because it does exactly the opposite - it creates files that matches your rules.\n* [Audit Node Modules With YARA Rules](https://github.com/rpgeeganage/audit-node-modules-with-yara)\n    - Run a given set of YARA rules against the given node_module folder\n* [AutoYara](https://github.com/NeuromorphicComputationResearchProgram/AutoYara)\n    - Automated Yara Rule generation using Biclustering\n* [bamfdetect](https://github.com/bwall/bamfdetect)\n    - Identifies and extracts information from bots and other malware.\n* [base64_substring](https://github.com/DissectMalware/base64_substring)\n    - Generate YARA rules to match terms against base64-encoded data.\n* [CAPE: Config And Payload Extraction](https://github.com/kevoreilly/CAPEv2) :eyes:\n    - Extension of Cuckoo specifically designed to extract payloads and configuration from malware. CAPE can detect a number of malware techniques or behaviours, as well as specific malware families, from its initial run on a sample. This detection then triggers a second run with a specific package, in order to extract the malware payload and possibly its configuration, for further analysis.\n* [CCCS-Yara](https://github.com/CybercentreCanada/CCCS-Yara)\n    - YARA rule metadata specification and validation utility.\n* [clara](https://github.com/abhinavbom/clara) :sparkles:\n    - Serverless, real-time, ClamAV+Yara scanning for your S3 Buckets.\n* [Cloudina Security Hawk](https://github.com/cloudina/hawk) :sparkles:\n    - Multi Cloud antivirus scanning API based on CLAMAV and YARA for AWS S3, AZURE Blob Storage, GCP Cloud Storage.\n* [CrowdStrike Feed Management System](https://github.com/CrowdStrike/CrowdFMS)\n    - Framework for automating collection and processing of samples from VirusTotal, and executing commands based on YARA rule matches.\n* [CSE-CST AssemblyLine](https://bitbucket.org/cse-assemblyline/alsvc_yara)\n    - The Canadian Communications Security Establishment (CSE) open sourced [AssemblyLine](https://cyber.gc.ca/en/assemblyline), a platform for analyzing malicious files. The component linked here provides an interface to YARA.\n* [dnYara](https://github.com/airbus-cert/dnYara)\n    - A multi-platform .NET wrapper library for the native YARA library.\n* [ELAT](https://github.com/reed1713/ELAT)\n    - Event Log Analysis Tool that creates/uses YARA rules for Windows event log analysis.\n* [Emerson File Scanning Framework (FSF)](https://github.com/EmersonElectricCo/fsf)\n    - Modular, recursive file scanning solution.\n* [ExchangeFilter](https://github.com/k-sec-tools/ExchangeFilter)\n    - MS Exchange transport agent uses YARA to detect malware in email messages.\n* [factual-rules-generator](https://github.com/CIRCL/factual-rules-generator)\n    - Factual-rules-generator is an open source project which aims to generate YARA rules about installed software from a running operating system.\n* [Fadavvi YARA collection script](https://github.com/Fadavvi/Yara-Repo)\n* [Fastfinder](https://github.com/codeyourweb/fastfinder)\n    - Fast customisable cross-platform suspicious file finder. Designed for incident response. Supports md5/sha1/sha256 hashs, litteral/wildcard strings, regular expressions and YARA rules. Can easily be packed to be deployed on any windows / linux host.\n* [findcrypt-yara](https://github.com/polymorf/findcrypt-yara) and [FindYara](https://github.com/OALabs/FindYara)\n    - IDA pro plugins to scan your binary with YARA rules to find crypto constants (and more).\n* [Fibratus](https://www.fibratus.io)\n    - A modern tool for Windows kernel exploration and observability with a focus on security and [support for YARA](https://www.fibratus.io/#/filters/functions?id=yara-functions).\n* [Fnord](https://github.com/Neo23x0/Fnord)\n    - Pattern extractor for obfuscated code.\n* [generic-parser](https://github.com/uppusaikiran/generic-parser)\n    - Parser with YARA support, to extract meta information, perform static analysis and detect macros within files.\n* [GoDaddy ProcFilter](https://github.com/godaddy/procfilter) :gem:\n    - ProcFilter is a process filtering system for Windows with built-in YARA integration. YARA rules can be instrumented with custom meta tags that tailor its response to rule matches. It runs as a Windows service and is integrated with Microsoft's ETW API, making results viewable in the Windows Event Log. Installation, activation, and removal can be done dynamically and does not require a reboot.\n* [go-yara](https://github.com/hillu/go-yara)\n    - Go bindings for YARA.\n* [halogen](https://github.com/target/halogen)\n    - Halogen is a tool to automate the creation of yara rules against image files embedded within a malicious document.\n* [Hyara](https://github.com/hyuunnn/Hyara)\n    - IDA Pro, Cutter, and BinaryNinja plugin that provides easy creation of YARA rules for ASCII & hex strings between a given start and end address.\n* [IDA_scripts](https://github.com/swackhamer/IDA_scripts)\n    - IDA Python scripts for generating YARA sigs from executable opcodes (.NET included).\n* [ida_yara](https://github.com/alexander-hanel/ida_yara)\n    - Scan data within an IDB using YARA.\n* [ida-yara-processor](https://github.com/bnbdr/ida-yara-processor)\n    - IDA processor for compiled YARA rules.\n* [InQuest ThreatKB](https://github.com/InQuest/ThreatKB)\n    - Knowledge base workflow management for YARA rules and C2 artifacts (IP, DNS, SSL).\n* [iocextract](https://github.com/InQuest/python-iocextract)\n    - Advanced Indicator of Compromise (IOC) extractor, with YARA rule extraction.\n* [Invoke-Yara](https://github.com/secabstraction/Yara)\n    - Powershell scripts to run YARA on remote machines.\n* [java2yara](https://github.com/fxb-cocacoding/java2yara)\n    - A minimal library to generate YARA rules from JAVA\n* [KLara](https://github.com/KasperskyLab/klara)\n    - Distributed system written in Python, allows researchers to scan one or more YARA rules over collections with samples.\n* [Laika BOSS](https://github.com/lmco/laikaboss)\n    - Object scanner and intrusion detection system that strives to achieve the following goals: Scalable, Flexible, Verbose.\n    - [Whitepaper](https://github.com/lmco/laikaboss/blob/master/LaikaBOSS_Whitepaper.pdf)\n* [libyara.NET](https://github.com/microsoft/libyara.NET)\n    - .NET wrapper for libyara built in C++ CLI used to easily incorporate yara into .NET projects\n* [Malcat](https://malcat.fr)\n    - Hexadecimal editor, disassembler and decompiler for malware analysis. Embeds both a YARA scanner and rule editor for easy in-app rule creation. Free and paid versions are available.\n* [MalConfScan](https://github.com/JPCERTCC/MalConfScan)\n    - MalConfScan is a Volatility plugin extracts configuration data of known malware. This tool searches for malware in memory images and dumps configuration data. In addition, this tool has a function to list strings to which malicious code refers.\n* [malscan](https://github.com/usualsuspect/malscan)\n    - Scan process memory for YARA matches and execute Python scripts if a match is found.\n* [MISP Threat Sharing](https://github.com/MISP/MISP)\n    - Threat intelligence platform including indicators, threat intelligence, malware samples and binaries. Includes support for sharing, generating, and validating YARA signatures.\n* [MITRE MultiScanner](https://github.com/mitre/multiscanner)\n    - File analysis framework that assists the user in evaluating a set of files by automatically running a suite of tools for the user and aggregating the output.\n* [mkYARA](https://github.com/fox-it/mkYARA)\n    - Generate YARA rules based on binary code.\n* [mquery](https://github.com/CERT-Polska/mquery)\n    - Web frontend for running blazingly fast YARA queries on large datasets.\n* [ndaal YARA ruleset checker](https://gitlab.com/ndaal_open_source/ndaal_yara_nyc)\n    - ndaal YARA ruleset checker, Open Source\n* Nextron Systems OSS and Commercial Tools (Florian Roth: @Neo23x0)\n    - [Loki](https://github.com/Neo23x0/Loki) IOC and YARA rule scanner implemented in Python. Open source and free.\n    - [THOR Lite](https://www.nextron-systems.com/thor-lite/) IOC and YARA rule scanner implemented in Go. Closed source, free, but registration required.\n* [node-yara](https://github.com/nospaceships/node-yara)\n    - YARA support for Node.js.\n* [ocaml-yara](https://github.com/elastic/ocaml-yara)\n    - OCaml bindings to libyara\n* [OCYara](https://github.com/bandrel/OCyara)\n    - Performs OCR on image files and scans them for matches to YARA rules.\n* [osquery](https://osquery.readthedocs.io/en/stable/deployment/yara/)\n    - YARA-based scanning with osquery.\n* [PasteHunter](https://github.com/kevthehermit/PasteHunter)\n    - Scan pastebin.com with YARA rules.\n* [plast](https://github.com/sk4la/plast)\n    - Threat hunting tool for detecting and processing IOCs using YARA under the hood.\n* [plyara](https://github.com/plyara/plyara)\n    - Parse YARA rules with Python.\n* [Polichombr](https://github.com/ANSSI-FR/polichombr)\n    - Collaborative malware analysis framework with YARA rule matching and other features.\n* [PwC Cyber Threat Operations rtfsig](https://github.com/PwCUK-CTO/rtfsig)\n    - This tool is designed to make it easy to signature potentially unique parts of RTF files.\n* [VirusTotalTools](https://github.com/silascutler/VirusTotalTools)\n    - Tools for checking samples against Virus Total, including VT_RuleMGR, for managing threat hunting YARA rules.\n* [QuickSand.io](http://quicksand.io/)\n    - Compact C framework to analyze suspected malware documents. Also includes a web interface and online analysis.\n* [shotgunyara](https://github.com/darienhuss/shotgunyara)\n    - Given a string, create 255 xor encoded versions of that string as a YARA rule.\n* [spyre](https://github.com/spyre-project/spyre)\n    - Simple, self-contained YARA-based file IOC scanner.\n* [static_file_analysis](https://github.com/lprat/static_file_analysis)\n    - Analyze deeply embedded files (doc, pdf, exe, ...) with clamscan and YARA.\n* [stoQ](https://github.com/PUNCH-Cyber/stoq)\n    - Modular and highly customizable framework for the creation of data sets from multiple disparate data sources.\n* [Strelka](https://github.com/target/strelka)\n    - Detection-Oriented File Analysis System built on Python3, ZeroMQ, and YARA, primarily used for threat detection/hunting and intelligence gathering.\n* [Sysmon EDR](https://github.com/ion-storm/sysmon-edr) :sparkles:\n    - YARA scanning, process killing, network blocking, and more.\n* [SwishDbgExt](https://github.com/comaeio/SwishDbgExt)\n    - Microsoft WinDbg extension which includes the ability to use YARA rules to hunt processes in memory.\n* [ThreatIngestor](https://github.com/InQuest/ThreatIngestor/)\n    - Automatically extract and aggregate IOCs including YARA rules from many sources.\n* [UXProtect](https://digitasecurity.com/uxprotect/)\n    - The missing UI to Apple's built-in XProtect YARA signatures. Enumerate signatures, scan files, and more.\n* [VTCodeSimilarity-YaraGen](https://github.com/arieljt/VTCodeSimilarity-YaraGen) :gem: :sparkles:\n    - Yara rule generator using VirusTotal code similarity feature `code-similar-to:` written by [@arieljt](https://twitter.com/arieljt).\n* [Vxsig](https://github.com/google/vxsig) :sparkles:\n    - Automatically generate AV byte signatures from sets of similar binaries.\n* [yabin](https://github.com/AlienVault-OTX/yabin)\n    - Creates YARA signatures from executable code within malware.\n* [yaml2yara](https://github.com/nccgroup/yaml2yara)\n    - Generate bulk YARA rules from YAML input.\n* [YARA-CI](https://yara-ci.cloud.virustotal.com/) :sparkles:\n    - YARA-CI helps you to keep your YARA rules in good shape. It can be integrated into any GitHub repository containing YARA rules and it will run automated tests every time you make some change.\n* [yara-endpoint](https://github.com/Yara-Rules/yara-endpoint)\n    -  Tool useful for incident response as well as anti-malware enpoint based on YARA signatures.\n* [YaraFileCheckerLib](https://github.com/k-sec-tools/YaraFileCheckerLib)\n    - .Net Library designed to make it easier to check potentially malicious files and archives using YARA and make a decision about their harmfulness based on the weights of the detected rules.\n* [Yara Finder](https://github.com/uppusaikiran/yara-finder)\n    - Web API and docker image for scanning files against YARA rules, built on @tylerha97's yara_scan.\n* [YaraGenerator](https://github.com/Xen0ph0n/YaraGenerator)\n    - Quick, simple, and effective yara rule creation to isolate malware families and other malicious objects of interest.\n* [YaraGen](https://github.com/mrexodia/YaraGen) and [yara_fn](https://github.com/williballenthin/idawilli/tree/master/scripts/yara_fn)\n    - Plugins for x64dbg and IDAPython, respectively, that generate YARA rules from function blocks.\n* [YaraGuardian](https://github.com/PUNCH-Cyber/YaraGuardian)\n    - Django web interface for managing YARA rules.\n* [YaraHunter](https://github.com/deepfence/YaraHunter)\n    - Malware scanner for cloud-native, as part of CI/CD and at Runtime\n* [yara-java](https://github.com/p8a/yara-java)\n    - Java bindings for YARA.\n* [yaralyzer](https://github.com/michelcrypt4d4mus/yaralyzer)\n    - Visually inspect and force decode YARA and regex matches found in both binary and text data. With Colors.\n* [yaraMail](https://github.com/kevthehermit/yaraMail)\n    - YARA scanner for IMAP feeds and saved streams.\n* [Yara Malware Quick menu scanner](https://github.com/techbliss/Yara_Mailware_Quick_menu_scanner)\n    - Adds the awsome YARA pattern scanner to Windows right click menus.\n* [YaraManager](https://github.com/kevthehermit/YaraManager)\n    - Web based manager for YARA rules.\n* [Yaramanager](https://github.com/3c7/yaramanager) ([PyPI](https://pypi.org/project/yaramanager/))\n    - Command line tool to manage and organize your Yara ruleset.\n* [yaramod](https://github.com/avast/yaramod)\n    - A library that provides parsing of YARA rules into AST and a C++ programming interface to build new YARA rulesets.\n* [yarAnalyzer](https://github.com/Neo23x0/yarAnalyzer)\n    - YARA rule set coverage analyzer.\n* [yara-ocaml](https://github.com/XVilka/yara-ocaml)\n    - OCaml bindings for YARA\n* [yara-parser](https://github.com/Northern-Lights/yara-parser)\n    - Tools for parsing rulesets using the exact grammar as YARA. Written in Go.\n* [yaraparser](https://github.com/BitsOfBinary/yaraparser)\n    - Python 3 tool to parse Yara rules.\n* [yaraPCAP](https://github.com/kevthehermit/YaraPcap)\n    - YARA scanner For IMAP feeds and saved streams.\n* [yara-procdump-python](https://github.com/google/yara-procdump-python)\n    - Python extension to wrap the YARA process memory access API.\n* [yara-rust](https://github.com/Hugal31/yara-rust)\n    - Rust bindings for VirusTotal/Yara\n* [yara-signator](https://github.com/fxb-cocacoding/yara-signator) :sparkles:\n    - Automatic YARA rule generation for Malpedia\n* [YARA-sort](https://github.com/horsicq/YARA-sort)\n    - Aggregate files into collections basd on YARA rules. [blog](https://n10info.blogspot.com/2019/10/nfd-sort.html)\n* [Yara Python ICAP Server](https://github.com/RamadhanAmizudin/python-icap-yara)\n    - ICAP server with YARA scanner.\n* [yarasafe](https://github.com/lucamassarelli/yarasafe)\n    - Automatic generation of function signature using machine learning.\n* [Yara-Scanner](https://github.com/PolitoInc/Yara-Scanner)\n    - Python-based extension that integrates a YARA scanner into Burp Suite.\n* [yarascanner](https://github.com/jheise/yarascanner)\n    - Golang-based web service to scan files with YARA rules.\n* [yara_scanner](https://github.com/tsale/yara_scanner)\n    - This script allows you to scan multiple remote nodes using PsExec and native OS commands.\n* [YaraSharp](https://github.com/stellarbear/YaraSharp)\n    - C# wrapper around the Yara pattern matching library\n* [YaraStation](https://github.com/NumLocK15/yarastation)\n    - Yara station is a managment portal designed to facilitate the use of Loki scanner.\n* [yara_tools](https://github.com/matonis/yara_tools)\n    - Python bindings to author YARA rules using natural Python conventions.\n* [Yara-Validator](https://github.com/CIRCL/yara-validator)\n    - Validates YARA rules and tries to repair the broken ones.\n* [yaraVT](https://github.com/deadbits/yaraVT)\n    - Scan files with Yara and send rule matches to VirusTotal reports as comments.\n* [yara_zip_module](https://github.com/stoerchl/yara_zip_module)\n    - Search for strings inside a zip file.\n* [yarg](https://github.com/immortalp0ny/yarg)\n    - IDAPython plugin for gerenating YARA rules from x86/x86-64 code.\n* [yarGen](https://github.com/Neo23x0/yarGen)\n    - YARA rule generator for finding related samples and hunting.\n* [Yara Scan](http://zeroq.ydns.eu/)\n    - Place to upload files and scan with internal rules.\n* [Yara Scanner](https://github.com/ace-ecosystem/yara_scanner)\n    - A wrapper around the yara-python project the providing multiple capabilities.\n* [Yarasilly2](https://github.com/YARA-Silly-Silly/yarasilly2)\n    - A Semi automatic handy tool to generate YARA rules from sample virus files ( WIP ) for Malware Analyst, inspired by DIFF function of VirusTotal Premium Account.\n* [yaya](https://github.com/EFForg/yaya)\n    - Automatically curate open source yara rules and run scans.\n* [YaYaGen](https://github.com/jimmy-sonny/YaYaGen)\n    - YARA rule generator for Android malware.\n* [Yeti](https://github.com/yeti-platform/yeti)\n    - Platform meant to organize observables, indicators of compromise, TTPs, and knowledge on threats in a single, unified repository.\n* [yextend](https://github.com/BayshoreNetworks/yextend)\n    - YARA integrated software to handle archive file data.\n* [yaraZeekAlert](https://github.com/SCILabsMX/yaraZeekAlert) :sparkles:\n    - Scans files with YARA rules and send email alerts which include network context of the file transfer and attaches the suspicious file if it is less than 10 MB.\n* [yaraScanParser](https://github.com/Sh3llyR/yaraScanParser)\n    - Parsing tool for [Yara Scan Service](https://riskmitigation.ch/yara-scan/)'s JSON output file.\n* [YARI](https://github.com/avast/yari)\n    - Interactive debugger for the YARA language written in Rust.\n* [YLS](https://github.com/avast/yls)\n    - Language server for YARA to intergrate with e.g. vscode or vim. Offers code completion, function documentation, code formatting, debugging, ...\n* [YMCA](https://github.com/m0n4/YARA-Matches-Correspondance-Array)\n    - Displays a table of matches between YARA rules and a collection of samples.\n* [Yobi](https://github.com/imp0rtp3/Yobi) :sparkles:\n    - Yobi is a basic firefox extension which allows to run public or private YARA rules on all scripts and pages rendered by the browser.\n* [statiStrings](https://github.com/Sh3llyR/statiStrings)\n    - Strings statistics calculator for YARA rules.\n\n## Services\n\n* [Hybrid Analysis YARA Search](https://www.hybrid-analysis.com/yara-search)\n    - YARA search / hunting from CrowdStrike / Hybrid Analysis, powered by Falcon MalQuery.\n* [InQuest Labs](https://labs.inquest.net) :sparkles: :gem:\n    -  See the YARA section for helper routines to convert regular expressions to match on base64 encoded strings, conver strings to sequences of uint() lookups, and more.\n* [Koodous](https://koodous.com/)\n    - Collaborative platform for APK analysis, with community YARA rule repository and large APK sample dataset.\n* [MalShare](https://malshare.com/)\n    - Free malware repository providing researchers access to samples, malicous feeds, and YARA results.\n* [MalwareConfig](https://malwareconfig.com/)\n    - Extract IOCs from Remote Access Trojans.\n* [YaraEditor (Web)](https://www.adlice.com/download/yaraeditorweb/)\n    - All-in-one website to create and manage YARA rules.\n* [YARAify](https://yaraify.abuse.ch/):sparkles:\n    - YARAify is a project from abuse.ch that allows anyone to scan suspicious files such as malware samples or process dumps against a large repository of YARA rules.\n* [Yara Share](https://yara.adlice.com/)\n    - Free repository and online community for users to upload and share Yara rules.\n* [Yara Scan Service](https://riskmitigation.ch/yara-scan/)\n    - A simple service to test your Yara rules against a large set of malicious and identified files.\n\n## Syntax Highlighters\n\n* Atom: [language-yara](https://github.com/blacktop/language-yara)\n* Emacs: [yara-mode](https://github.com/binjo/yara-mode)\n* GTK-based editors, like gedit and xed: [GtkSourceView-YARA](https://github.com/wesinator/GtkSourceView-YARA)\n* Notepad++: [userDefinedLanguages](https://github.com/notepad-plus-plus/userDefinedLanguages/blob/master/udl-list.md)\n* Sublime Text: [YaraSyntax](https://github.com/nyx0/YaraSyntax/)\n* Vim: [vim-yara](https://github.com/yaunj/vim-yara), [vim-syntax-yara](https://github.com/s3rvac/vim-syntax-yara)\n* Visual Studio Code: [vscode-yara](https://github.com/infosec-intern/vscode-yara)\n\n## People\n\nWe're aggregating the Twitter handles for anyone involved with the projects on this page into a single list: [awesome-yara Twitter list](https://twitter.com/InQuest/lists/awesome-yara). Do let us know if anyone is missing.\n\n## Related Awesome Lists\n\n* [Crawler](https://github.com/BruceDone/awesome-crawler)\n* [CVE PoC](https://github.com/qazbnm456/awesome-cve-poc)\n* [Forensics](https://github.com/Cugu/awesome-forensics)\n* [Hacking](https://github.com/carpedm20/awesome-hacking)\n* [HackwithGithub](https://github.com/Hack-with-Github/Awesome-Hacking)\n* [Honeypots](https://github.com/paralax/awesome-honeypots)\n* [Incident-Response](https://github.com/meirwah/awesome-incident-response)\n* [Infosec](https://github.com/onlurking/awesome-infosec)\n* [IOCs](https://github.com/sroberts/awesome-iocs)\n* [Malware Analysis](https://github.com/rshipp/awesome-malware-analysis)\n* [ML for Cyber Security](https://github.com/jivoi/awesome-ml-for-cybersecurity)\n* [OSINT](https://github.com/jivoi/awesome-osint)\n* [PCAP Tools](https://github.com/caesar0301/awesome-pcaptools)\n* [Pentesting](https://github.com/enaqx/awesome-pentest)\n* [Reversing](https://github.com/tylerha97/awesome-reversing)\n* [Security](https://github.com/sbilly/awesome-security)\n* [Static Analysis](https://github.com/analysis-tools-dev/static-analysis)\n* [Threat Detection](https://github.com/0x4D31/awesome-threat-detection)\n* [Threat Intelligence](https://github.com/hslatman/awesome-threat-intelligence)\n\n## Contributing\n\nThis list is maintained by [InQuest](https://inquest.net/). Feel free to let us\nknow about anything we're missing!\n\nSee [CONTRIBUTING.md](CONTRIBUTING.md).\n"
}