{
  "repo_name": "mfornos_awesome-microservices",
  "readme_content": "# Awesome Microservices [![Awesome](https://cdn.rawgit.com/sindresorhus/awesome/d7305f38d29fed78fa85652e3a63e154dd8e8829/media/badge.svg)](https://github.com/sindresorhus/awesome)\n\nA curated list of Microservice Architecture related principles and technologies.\n\n**Table of Contents**\n\n- [Platforms](#platforms)\n- [Frameworks / Runtimes](#frameworks--runtimes)\n- [Service Toolkits](#service-toolkits)\n  - [Polyglot](#polyglot)\n  - [C](#c)\n  - [C++](#c-1)\n  - [C#](#csharp)\n  - [D](#d)\n  - [Erlang VM](#erlang-vm)\n  - [Go](#go)\n  - [Haskell](#haskell)\n  - [Java VM](#java-vm)\n  - [Node.js](#nodejs)\n  - [Perl](#perl)\n  - [PHP](#php)\n  - [Python](#python)\n  - [Ruby](#ruby)\n  - [Rust](#rust)\n- [Frontend / UI](#frontend--ui)\n- [Capabilities](#capabilities)\n  - [API Gateways / Edge Services](#api-gateways--edge-services)\n  - [Configuration & Discovery](#configuration--discovery)\n  - [Coordination & Governance](#coordination--governance)\n  - [Elasticity](#elasticity)\n  - [Job Schedulers / Workload Automation](#job-schedulers--workload-automation)\n  - [Logging](#logging)\n  - [Messaging](#messaging)\n  - [Monitoring & Debugging](#monitoring--debugging)\n  - [Reactivity](#reactivity)\n  - [Resilience](#resilience)\n  - [Security](#security)\n  - [Serialization](#serialization)\n  - [Storage](#storage)\n  - [Testing](#testing)\n- [Continuous Integration & Delivery](#continuous-integration--delivery)\n- [Web API Modeling & Documentation](#web-api-modeling--documentation)\n  - [GraphQL](#graphql)\n  - [JSON](#json)\n  - [REST](#rest)\n- [Standards / Recommendations](#standards--recommendations)\n  - [World Wide Web](#world-wide-web)\n  - [Self-sovereignty & Decentralisation](#self-sovereignty--decentralisation)\n  - [HTTP/1.1](#http11)\n  - [HTTP/2](#http2)\n  - [QUIC](#quic)\n  - [CoAP](#coap)\n  - [RPC](#rpc)\n  - [Messaging](#messaging-1)\n  - [Security](#security-1)\n  - [Web APIs](#web-apis)\n  - [Service Discovery](#service-discovery)\n  - [Data Formats](#data-formats)\n  - [Vocabularies](#vocabularies)\n  - [Unicode](#unicode)\n- [Organization Design / Team Dynamics](#organization-design--team-dynamics)\n- [Enterprise & Verticals](#enterprise--verticals)\n- [Theory](#theory)\n  - [Articles & Papers](#articles--papers)\n  - [Sites & Organizations](#sites--organizations)\n- [License](#license)\n- [Contributing](#contributing)\n\n## Platforms\n\n- [Express Serverless](https://www.express-serverless.io/) - An open source, Kubernetes-native, microservices and serverless platform.\n- [Hook.io](https://hook.io) - Open source provider of microservice and webhook hosting.\n- [Jolie](https://jolie-lang.org) - Open source microservice-oriented programming language.\n- [KintoHub (c)](https://www.kintohub.com) - Microservice package manager empowering developers to easily build and share cloud ready features.\n- [Lightbend (c)](https://www.lightbend.com/) - Platform for building scalable reactive systems on the JVM.\n- [M3O](https://micro.mu/) - A serverless platform for microservices development.\n- [Netflix OSS](https://netflix.github.io/) - Netflix open source software ecosystem.\n- [OpenWhisk](http://openwhisk.org/) - Serverless, open source cloud platform that executes functions in response to events at any scale.\n- [Pulumi](https://pulumi.io/) - SDK for cloud native infrastructure as code. Use your favorite language to preview and manage updates to your apps and infrastructure, and continuously deploy to any cloud (no YAML required).\n- [STUPS](https://stups.io/) - A set of tools and components by Zalando to provide a convenient and audit-compliant PaaS for multiple autonomous teams on top of AWS.\n- [Svix](https://svix.com) - Webhooks service that sends webhooks to your users with full retry schedules, exponential backoff, signature verification, and event types.\n- [Triton](https://github.com/joyent/triton) - Open-source cloud management platform that delivers next generation, container-based, service-oriented infrastructure across one or more data centers.\n- [VAMP (c)](http://vamp.io/) - Build, deploy and manage microservices with power and ease.\n- [Wing](https://www.winglang.io/) - Cloud-oriented programming language. It allows developers to build distributed systems that fully leverage the power of the cloud without having to worry about the underlying infrastructure.\n\n## Frameworks / Runtimes\n\n- [Akka](http://akka.io/) - Toolkit and runtime for building highly concurrent, distributed, and resilient message-driven applications on the JVM.\n- [Axon (c)](https://axoniq.io/) - An end-to-end development and infrastructure platform for easy development and running of any DDD, CQRS and Event Sourcing applications on JVM.\n- [Ballerina](https://ballerina.io) - Cloud native programming language.\n- [Dapr](https://dapr.io) - Open source runtime for writing highly performant microservices using any programming language.\n- [Deno](https://deno.land/) - JavaScript, TypeScript, and WebAssembly runtime with secure defaults and a great developer experience.\n- [Eclipse Microprofile](https://microprofile.io/) - An open forum to optimize Enterprise Java for a microservices architecture by innovating across multiple implementations and collaborating on common areas of interest with a goal of standardization.\n- [Erlang/OTP](https://github.com/erlang/otp) - Programming language used to build massively scalable soft real-time systems with requirements on high availability.\n- [Finagle](http://twitter.github.io/finagle) - Extensible RPC system for the JVM, used to construct high-concurrency servers.\n- [Flogo](https://github.com/TIBCOSoftware/flogo) - Flogo is an open source framework to simplify building efficient & modern serverless functions and edge microservices.\n- [GraalVM](https://www.graalvm.org/) - High-performance runtime that provides significant improvements in application performance and efficiency which is ideal for microservices.\n- [GPars](https://github.com/GPars/GPars) - Concurrency and parallelism framework for the JVM.\n- [Grenache](https://github.com/bitfinexcom/grenache) - A Bittorent-DHT based microservices framework supporting REQ/REP and PUB/SUB patterns over multiple transports.\n- [Helidon](https://helidon.io/) - Collection of Java libraries for writing microservices that run on a fast web core powered by Netty.\n- [Ice](https://zeroc.com/) - Comprehensive RPC framework with support for C++, C#, Java, JavaScript, Python, and more.\n- [Lagom](https://github.com/lagom/lagom) - Reactive microservices for the JVM.\n- [Light-4j](https://github.com/networknt/light-4j) - A high throughput, low latency, small memory footprint and more productive microservices platform.\n- [Micronaut](http://micronaut.io/) - A modern, JVM-based, full-stack framework for building modular, easily testable microservice applications.\n- [Microserver](https://github.com/aol/micro-server) - Java 8 native, zero configuration, standards based, battle hardened library to run Java REST microservices.\n- [Moleculer](http://moleculer.services/) - Fast & powerful microservices framework for Node.js, Java, Go and Ruby.\n- [Open Liberty](https://openliberty.io/) - A lightweight open framework for building fast and efficient cloud-native Java microservices.\n- [Orbit](https://github.com/orbit/orbit) - Modern framework for JVM languages that makes it easier to build and maintain distributed and scalable online services.\n- [SmallRye](https://smallrye.io/) - APIs and implementations tailored for cloud development, including Eclipse MicroProfile.\n- [Spin](https://github.com/fermyon/spin) - An open source framework for building and running fast, secure, and composable cloud microservices with WebAssembly.\n- [Thorntail](https://thorntail.io/) - An innovative approach to packaging and running Java EE applications by packaging them with just enough of the server runtime to \"java -jar\" your application.\n- [ScaleCube](https://github.com/scalecube/scalecube) - Toolkit for building reactive microservices for the JVM: low-latency, high-throughput, scalable and resilient.\n- [Vert.X](http://vertx.io/) - Toolkit for building reactive applications on the JVM.\n- [Vert.X Toolbox](https://github.com/vert-x3/vertx-microservices-toolbox) - A set of Vert.x components to build reactive microservice applications.\n- [Wangle](https://github.com/facebook/wangle) - A framework providing a set of common client/server abstractions for building services in a consistent, modular, and composable way.\n\n## Service Toolkits\n\n### Polyglot\n\n- [GRPC](http://www.grpc.io/) - A high performance, open source, general RPC framework that puts mobile and HTTP/2 first. Libraries in C, C++, Java, Go, Node.js, Python, Ruby, Objective-C, PHP and C#.\n- [Hprose](http://github.com/hprose) - A very newbility RPC Library, support 25+ languages now.\n\n### C\n\n- [Kore](https://kore.io/) - Easy to use web application framework for writing scalable web APIs in C.\n- [Libasyncd](https://github.com/wolkykim/libasyncd/) - Embeddable event-based asynchronous HTTP server library for C.\n- [Libslack](http://libslack.org/) -  Provides a generic agent oriented programming model, run time selection of locking strategies, functions that make writing daemons trivial and simplify the implementation of network servers and clients, &c.\n- [Lwan](http://lwan.ws/) - High-performance and scalable web server.\n- [Onion](https://github.com/davidmoreno/onion) - C library to create simple HTTP servers and web applications.\n\n### C++\n<!-- #c-1 anchor -->\n\n- [AnyRPC](https://github.com/sgieseking/anyrpc) - Provides a common system to work with a number of different remote procedure call standards, including: JSON-RPC, XML-RPC, MessagePack-RPC.\n- [Cap’n Proto RPC](https://capnproto.org/cxxrpc.html) - The Cap’n Proto C++ RPC implementation.\n- [C++ Micro Services](http://cppmicroservices.org/) - An OSGi-like C++ dynamic module system and service registry.\n- [Enduro/X](https://github.com/endurox-dev/endurox/) - XATMI based service framework for GNU/Linux.\n- [Pion](https://github.com/splunk/pion) - C++ framework for building lightweight HTTP interfaces.\n- [Pistache](https://github.com/oktal/pistache) - A high-performance REST toolkit written in C++.\n- [Poco](http://pocoproject.org/) - C++ class libraries for building network-based applications and servers.\n- [Restbed](https://github.com/Corvusoft/restbed) - Brings asynchronous RESTful functionality to C++11 applications.\n- [Served](https://github.com/datasift/served) - C++ library for building high-performance RESTful web servers.\n- [Sogou Workflow](https://github.com/sogou/workflow) - Enterprise-grade programming engine aimed to satisfy most of the backend development requirements.\n- [ULib](https://github.com/stefanocasazza/ULib) - Highly optimized class framework for writing C++ applications.\n\n### CSharp\n\n- [Awesome Microservices .NET Core](https://github.com/mjebrahimi/Awesome-Microservices-NetCore) :star: - A collection of awesome training series, articles, videos, books, courses, sample projects, and tools for microservices in .NET Core.\n- [Akka.NET](http://getakka.net/) - Toolkit and runtime for building highly concurrent, distributed, and fault tolerant event-driven applications on .NET & Mono.\n- [Microdot](https://github.com/gigya/microdot) - Open source .NET microservices framework.\n- [Nancy](http://nancyfx.org/) - Lightweight web framework.\n- [Orleans](https://dotnet.github.io/orleans/) - Provides a straightforward approach to building distributed high-scale computing applications, without the need to learn and apply complex concurrency or other scaling patterns.\n- [Tye](https://github.com/dotnet/tye) - Tye is a tool that makes developing, testing, and deploying microservices and distributed applications easier. Project Tye includes a local orchestrator to make developing microservices easier and the ability to deploy microservices to Kubernetes with minimal configuration.\n\n### D\n\n- [Vibe.d](http://vibed.org/) - Asynchronous I/O that doesn’t get in your way, written in D.\n\n### Erlang VM\n\n#### Elixir\n\n- [Phoenix](http://www.phoenixframework.org/) - Framework for building HTML5 apps, API backends and distributed systems.\n- [Plug](https://github.com/elixir-lang/plug) - A specification and conveniences for composable modules between web applications.\n\n#### Erlang\n\n- [Cowboy](https://github.com/ninenines/cowboy) - Small, fast, modular HTTP server written in Erlang.\n- [Mochiweb](https://github.com/mochi/mochiweb) - Erlang library for building lightweight HTTP servers.\n\n### Go\n\n- [Echo](https://echo.labstack.com/) - Fast and unfancy HTTP server framework for Go. Up to 10x faster than the rest.\n- [Enduro/X ASG](https://github.com/endurox-dev/endurox-go) - Enduro/X bindings for Go allows to effectively write XATMI based microservices in Go language. Uses Unix kernel IPC (queues) for fast process communications.\n- [Fiber](https://github.com/gofiber/fiber) - Express inspired web framework built on top of Fasthttp, the fastest HTTP engine for Go. Designed to ease things up for fast development with zero memory allocation and performance in mind.\n- [Gin](https://github.com/gin-gonic/gin) - Gin is a HTTP web framework written in Go (Golang). It features a Martini-like API with much better performance, up to 40 times faster.\n- [Gizmo](https://github.com/nytimes/gizmo) - Microservices toolkit.\n- [Goa](https://github.com/goadesign/goa) - Design-based HTTP microservices in Go.\n- [Gocraft](https://github.com/gocraft/web) - A toolkit for building web apps. Includes routing, middleware stacks, logging and monitoring.\n- [Goji](https://goji.io/) - Minimalistic and flexible request multiplexer for Go.\n- [Go Chassis](https://github.com/go-chassis/go-chassis) - A framework for rapid development of microservices in Go that is easy to integrate with some cloud ecosystems.\n- [Go kit](https://github.com/go-kit/kit) - Distributed programming toolkit for microservices in the modern enterprise.\n- [go-api-boilerplate](https://github.com/vardius/go-api-boilerplate) - Go Server/API boilerplate using best practices, DDD, CQRS, ES, gRPC\n- [Go-micro](https://github.com/micro/go-micro) - A distributed systems development framework.\n- [go-zero](https://github.com/tal-tech/go-zero) - A web and rpc distributed system development framework.\n- [Gopencils](https://github.com/bndr/gopencils) - Easily consume REST APIs with Go.\n- [Gorilla](http://www.gorillatoolkit.org/) - Web toolkit for the Go programming language.\n- [Iris](https://github.com/kataras/iris) - Fast, simple and efficient micro web framework for Go.\n- [Kite](https://github.com/koding/kite) - Microservices framework in Go.\n- [KrakenD](https://github.com/devopsfaith/krakend) - Framework to build ultra performance API Gateways with middlewares.\n- [Libchan](https://github.com/docker/libchan) - Ultra-lightweight networking library which lets network services communicate in the same way that goroutines communicate using channels.\n- [Micro](https://github.com/micro/micro) - A distributed systems runtime for the cloud and beyond.\n- [Nano](https://github.com/pasztorpisti/nano) - A minimalistic, transport-agnostic and testing-friendly microservice framework.\n- [Negroni](https://github.com/codegangsta/negroni) - Idiomatic HTTP middleware for Golang.\n- [Neutrino](https://github.com/neutrinoapp/neutrino) - Realtime/REST backend service.\n- [RPCX](https://github.com/smallnest/rpcx) - A distributed RPC service framework based on NET/RPC like Alibaba Dubbo and Weibo Motan.\n- [Sleepy](https://github.com/dougblack/sleepy) - REST for go.\n\n### Haskell\n\n- [Scotty](https://github.com/scotty-web/scotty) - Micro web framework inspired by Ruby's Sinatra, using WAI and Warp.\n- [Servant](https://github.com/haskell-servant/servant) - Type-level web DSL.\n- [Yesod](https://github.com/yesodweb/yesod) - The Haskell RESTful web framework.\n\n### Java VM\n\n#### Clojure\n\n- [Compojure](https://github.com/weavejester/compojure) - A concise routing library for Ring/Clojure.\n- [Duct](https://github.com/weavejester/duct) - Minimal framework for building web applications in Clojure, with a strong emphasis on simplicity.\n- [Friboo](https://github.com/zalando/friboo) - Utility library for writing microservices in Clojure, with support for Swagger and OAuth.\n- [Liberator](http://clojure-liberator.github.io/liberator/) - Library that helps you expose your data as resources while automatically complying with all the relevant requirements of the HTTP specification.\n- [Modularity](https://modularity.org/) - JUXT's Clojure-based modular system.\n- [System](https://github.com/danielsz/system) - Built on top of Stuart Sierra's component library, offers a set of readymade components.\n- [Tesla](https://github.com/otto-de/tesla-microservice) - Common basis for some of Otto.de's Clojure microservices.\n\n#### Java\n\n- [ActiveRPC](https://rpc.activej.io) - Lightweight and fast library for complex high-load distributed applications and Memcached-like solutions.\n- [Airlift](https://github.com/airlift/airlift) - Framework for building REST services in Java.\n- [Armeria](https://line.github.io/armeria/) - Open-source asynchronous HTTP/2 RPC/REST client/server library built on top of Java 8, Netty, Thrift and gRPC.\n- [Disruptor](https://github.com/LMAX-Exchange/disruptor) - High-performance inter-thread messaging library.\n- [Dropwizard](https://dropwizard.github.io/) - Java framework for developing ops-friendly, high-performance, RESTful web services.\n- [Dubbo](https://github.com/apache/dubbo) - A high-performance, java based RPC framework open-sourced by Alibaba.\n- [HTTP Remoting](https://github.com/palantir/http-remoting) - Libraries for defining and creating RESTish/RPC servers and clients based on Feign or Retrofit as a client and Dropwizard/Jersey with JAX-RS service definitions as a server.\n- [Ja-micro](https://github.com/Sixt/ja-micro) - Lightweight Java framework for building microservices (compatible with go-micro).\n- [Jersey](https://jersey.github.io/) - RESTful services in Java. JAX-RS reference implementation.\n- [MSF4J](https://github.com/wso2/msf4j) - High throughput & low memory footprint Java microservices framework.\n- [QBit](https://github.com/advantageous/qbit) - Reactive programming library for building microservices.\n- [Quarkus](https://quarkus.io/) - A Kubernetes Native Java stack tailored for OpenJDK HotSpot and GraalVM, crafted from the best of breed Java libraries and standards.\n- [Ratpack](https://ratpack.io/) - Set of Java libraries that facilitate fast, efficient, evolvable and well tested HTTP applications. specific support for the Groovy language is provided.\n- [Restlet](http://restlet.com/) - Helps Java developers build web APIs that follow the REST architecture style.\n- [Spark](http://sparkjava.com/) - A micro-framework for creating web applications in Java 8 with minimal effort.\n- [Spring Boot](http://projects.spring.io/spring-boot/) - Makes it easy to create stand-alone, production-grade Spring based applications.\n\n#### Kotlin\n\n- [Http4k](https://www.http4k.org/) - Lightweight but fully-featured HTTP toolkit written in pure Kotlin that enables the serving and consuming of HTTP services in a functional and consistent way.\n- [Ktor](https://ktor.io/) - Framework for building asynchronous servers and clients in connected systems using the Kotlin programming language.\n\n#### Scala\n\n- [Akka HTTP](http://doc.akka.io/docs/akka-http/current/scala.html) - Open source toolkit for building REST/HTTP-based integration layers on top of Scala and Akka.\n- [Colossus](https://github.com/tumblr/colossus) - I/O and microservice library for Scala.\n- [Finatra](http://twitter.github.io/finatra/) - Fast, testable, Scala HTTP services built on Twitter-Server and Finagle.\n- [Http4s](http://http4s.org/) - A minimal, idiomatic Scala interface for HTTP\n- [Play](https://www.playframework.com/) - The high velocity web framework for Java and Scala.\n- [Scalatra](http://scalatra.org/) - Simple, accessible and free web micro-framework.\n- [Skinny Micro](https://github.com/skinny-framework/skinny-micro) - Micro-web framework to build servlet applications in Scala.\n- [Squbs](http://paypal.github.io/squbs/) - A suite of components enabling standardization and operationalization of Akka and Akka HTTP applications/services in a large scale, managed, cloud environment.\n\n### Node.js\n\n- [Actionhero](http://www.actionherojs.com/) - Multi-transport Node.js API server with integrated cluster capabilities and delayed tasks.\n- [Baucis](https://github.com/wprl/baucis) - To build and maintain scalable HATEOAS/Level 3 REST APIs.\n- [BeeMS](https://github.com/umuplus/beems) - A Bee Queue based minimalist toolkit for building fast, decentralized, scalable and fault tolerant microservices.\n- [ClaudiaJS](https://claudiajs.com/) - Easy to deploy Node.js projects to AWS Lambda and API Gateway.\n- [Cote](https://github.com/dashersw/cote) - A Node.js library for building zero-configuration microservices.\n- [Express](http://expressjs.com/) - Fast, unopinionated, minimalist web framework for Node.js\n- [Fastify](https://www.fastify.io/) - Fastify, Fast and low overhead web framework, for Node.js.\n- [FeathersJS](http://feathersjs.com/) - An open source REST and realtime API layer for modern applications.\n- [Graft](https://github.com/GraftJS/graft) - Full-stack javascript through microservices.\n- [Hapi](http://hapijs.com/) - A rich framework for building applications and services.\n- [Hudson Taylor](https://github.com/hudson-taylor/hudson-taylor) - Set of libraries for building automatically documented, well validated services.\n- [Koa](http://koajs.com/) - Next generation web framework for Node.js\n- [Loopback](http://loopback.io/) - Node.js framework for creating APIs and easily connecting to backend data sources.\n- [Micro](http://github.com/zeithq/micro) - Asynchronous HTTP microservices.\n- [Micro Panda](https://github.com/zhaoyao91/micro-panda) - Node.js toolkit to help build microservices.\n- [Micro-Whalla](https://github.com/czerwonkabartosz/Micro-Whalla) - A simple, fast framework for writing microservices in Node.js communicate using RPC / IPC.\n- [Restify](http://restify.com/) - Node.js module built specifically to enable you to build correct REST web services.\n- [Seneca](https://github.com/senecajs/seneca) - A microservices toolkit for Node.js\n- [Serverless](https://github.com/serverless/serverless) - Build and maintain web, mobile and IoT applications running on AWS Lambda and API Gateway (formerly known as JAWS).\n- [Steriods Framework](https://github.com/99xt/steroidslibrary) - Steroids framework simplifies the development of microservices with Serverless using TypeScript by enabling the developer to emphasize more on business/domain logic rather than focusing too much on technical details.\n\n### Perl\n\n- [Cro](http://cro.services/) - Libraries for creating reactive distributed systems using Perl 6.\n- [Mojolicious](https://mojolicious.org/) - Next generation web framework for Perl.\n\n### PHP\n\n- [API Platform](https://api-platform.com/) - API-first web framework on top of Symfony with JSON-LD, Schema.org and Hydra support.\n- [Ecotone](https://docs.ecotone.tech/) - Framework based on architectural principles of DDD, CQRS and Event Sourcing that provides building blocks to create scalable and extensible applications. \n- [Fat-Free](https://fatfreeframework.com/) - A powerful yet easy-to-use PHP micro-framework.\n- [Flight](https://github.com/mikecao/flight) - An extensible micro-framework.\n- [Hyperf](https://github.com/hyperf/hyperf) - Hyperf is an extremely performant and flexible PHP CLI framework based on Swoole 4.5+, powered by the state-of-the-art coroutine server and a large number of battle-tested components.\n- [Lumen](https://lumen.laravel.com/) - Stunningly fast micro-framework.\n- [Phalcon](https://phalconphp.com/) - Full-stack PHP framework delivered as a C-extension.\n- [Slim](http://www.slimframework.com/) - Micro-framework that helps you quickly write simple yet powerful web applications and APIs.\n- [Swoft](https://github.com/swoft-cloud/swoft/) - PHP microservices coroutine framework for building high-performance web systems, APIs, middleware, and basic services.\n- [Symfony](https://symfony.com/) - Micro-framework based on the Symfony components.\n- [Upswarm](https://github.com/Zizaco/upswarm) - Multi-processed, async, fault-tolerant micro-framework for writing service-oriented applications.\n\n### Python\n\n- [Aiohttp](http://aiohttp.readthedocs.io/en/stable/) - HTTP client/server for asyncio.\n- [Bottle](https://bottlepy.org) - Fast, simple and lightweight WSGI micro web-framework for Python.\n- [Connexion](https://github.com/zalando/connexion) - Swagger/OpenAPI framework for Python on top of Flask with automatic endpoint validation and OAuth2 support.\n- [Falcon](https://falconframework.org/) - Bare-metal Python web API framework for building very fast app backends and microservices.\n- [FastAPI](https://fastapi.tiangolo.com/) - Modern, fast (high-performance), web framework for building APIs with Python 3.6+ based on standard Python type hints.\n- [Flask](http://flask.pocoo.org/) - Python framework for microservices based on Werkzeug and Jinja 2.\n- [Nameko](https://github.com/onefinestay/nameko) - Python framework for building microservices.\n- [Sanic](https://github.com/channelcat/sanic) - Sanic is a Flask-like Python 3.5+ web server that's written to go fast.\n- [Tornado](http://www.tornadoweb.org/) - Web framework and asynchronous networking library.\n- [Twisted](https://twistedmatrix.com) - Event-driven network programming engine.\n- [Web.py](https://github.com/webpy/webpy/) - Minimalist web framework for Python.\n- [Zappa](https://github.com/Miserlou/Zappa) - Framework for building and deploying server-less Python event-driven and web applications.\n\n### Ruby\n\n- [Grape](https://github.com/ruby-grape/grape) - An opinionated framework for creating REST-like APIs\n- [Hanami](https://github.com/hanami) - A modern web framework for Ruby.\n- [Praxis](https://github.com/rightscale/praxis) - Framework for both designing and implementing APIs.\n- [Rails API](http://edgeguides.rubyonrails.org/api_app.html) - Rails as an API only.\n- [Scorched](https://github.com/wardrop/Scorched) - Light-weight web framework for Ruby.\n- [Sinatra](http://www.sinatrarb.com/) - Sinatra is a DSL for quickly creating web applications in Ruby with minimal effort.\n\n### Rust\n\n- [Are we web yet?](https://www.arewewebyet.org/) :star: - A summary of the current state of web programming in Rust.\n- [Actix](https://actix.rs/) - Powerful, pragmatic, and extremely fast web framework for Rust.\n- [Tarpc](https://github.com/google/tarpc) - RPC framework for Rust with a focus on ease of use.\n\n## Frontend / UI\n\n- [Awesome Micro Frontends](https://github.com/ChristianUlbrich/awesome-microfrontends) :star: - A curated list of resources about Micro Frontends.\n- [Electrode](https://github.com/electrode-io) - Universal React/Node.js application platform.\n- [Micro Frontends](https://micro-frontends.org) - Extending the microservice idea to frontend development.\n- [MiniApp White Paper](https://w3c.github.io/miniapp/white-paper/) - MiniApp standardization white paper.\n\n## Capabilities\n\n### API Gateways / Edge Services\n\n> Note that [data and control plane](https://blog.envoyproxy.io/service-mesh-data-plane-vs-control-plane-2774e720f7fc) components are not categorized at this moment.\n\n- [Amalgam8](https://github.com/amalgam8) - Content-based routing fabric for polyglot microservices.\n- [Ambassador](https://www.getambassador.io) - Kubernetes-native API gateway for microservices built on Envoy.\n- [Annon](https://github.com/nebo15/annon.api) - Open source API gateway with built-in API management, authentication and status pages written in Elixir.\n- [APIcast](https://github.com/3scale/APIcast) - APIcast is an API gateway built on top of NGINX. It is part of the Red Hat 3scale API Management Platform.\n- [Bunkerized-nginx](https://github.com/bunkerity/bunkerized-nginx) - Web app hosting and reverse proxy secure by default.\n- [Caddy](https://caddyserver.com/) - Extensible HTTP/2 web server with automatic HTTPS.\n- [Camel](http://camel.apache.org/) - Empowers you to define routing and mediation rules in a variety of domain-specific languages, including a Java-based fluent API, Spring or Blueprint XML configuration files, and a Scala DSL.\n- [Envoy](https://github.com/lyft/envoy) - Open source edge and service proxy, from the developers at Lyft.\n- [Express Gateway](https://www.express-gateway.io/) - A microservices API gateway built on Express.js.\n- [Fabio](https://github.com/eBay/fabio) - A fast, modern, zero-conf load balancing HTTP/S router for deploying microservices managed by Consul.\n- [Gravitee](https://github.com/gravitee-io/gravitee-gateway) - The gateway is able to apply policies (ie. rules) to both HTTP requests and responses according to your needs, meaning that you can enhance requests and responses processing by adding transformation, security, and many other crazy features!\n- [HAProxy](https://github.com/haproxy/haproxy) - Reliable, high Performance TCP/HTTP load balancer.\n- [Istio](https://istio.io/) - An open platform to connect, manage, and secure microservices.\n- [Janus](https://github.com/hellofresh/janus) - An API Gateway written in Go.\n- [Keepalived](http://www.keepalived.org/) - Simple and robust facilities for loadbalancing and high-availability to Linux system and Linux based infrastructures.\n- [Kong](https://getkong.org/) - Open source management layer for APIs.\n- [KrakenD](http://krakend.io/) - Open source ultra performance API Gateway.\n- [Kuma](https://kuma.io/) - Platform agnostic open source control plane for service mesh and microservices.\n- [Linkerd](https://linkerd.io/) - Resilient service mesh for cloud native apps.\n- [Neutrino](https://github.com/eBay/Neutrino) - Extensible software load balancer.\n- [OpenResty](http://openresty.org/) - Fast web application server built on top of Nginx.\n- [Open Service Mesh](https://openservicemesh.io/) - Lightweight and extensible cloud native service mesh.\n- [Otoroshi](https://www.otoroshi.io/) - Modern HTTP reverse proxy with lightweight API management.\n- [Skipper](https://github.com/zalando/skipper) - HTTP router useful for decoupling routing from service logic.\n- [Spring Cloud Gateway](https://cloud.spring.io/spring-cloud-gateway/) - API Gateway on top of Spring MVC. Aims to provide a simple, yet effective way to route to APIs.\n- [Tengine](http://tengine.taobao.org/) - A distribution of Nginx with some advanced features.\n- [Træfɪk](http://traefik.io/) - A modern HTTP reverse proxy and load balancer made to deploy microservices with ease.\n- [Traffic Server](https://github.com/apache/trafficserver) - High-performance building block for cloud services.\n- [Tyk](https://tyk.io/) - Open source, fast and scalable API gateway, portal and API management platform.\n- [Vulcand](https://github.com/vulcand/vulcand) - Programmatic load balancer backed by Etcd.\n- [Zuul](https://github.com/Netflix/zuul) - An edge service that provides dynamic routing, monitoring, resiliency, security, and more.\n\n### Configuration & Discovery\n\n- [Central Dogma](https://line.github.io/centraldogma/) - Open-source highly-available version-controlled service configuration repository based on Git, ZooKeeper and HTTP/2.\n- [Consul](https://www.consul.io/) - Service discovery and configuration made easy. Distributed, highly available, and datacenter-aware.\n- [ContainerPilot](https://github.com/joyent/containerpilot) - Service for autodiscovery and configuration of applications running in containers.\n- [Denominator](https://github.com/Netflix/denominator) - Portably control DNS clouds using java or bash.\n- [Doozer](https://github.com/ha/doozerd) - Highly-available, completely consistent store for small amounts of data. When the data changes, it can notify connected clients immediately.\n- [Etcd](https://github.com/coreos/etcd) - Highly-available key-value store for shared configuration and service discovery.\n- [Eureka](https://github.com/Netflix/eureka/wiki/Eureka-at-a-glance) - REST based service that is primarily used in the AWS cloud for locating services for the purpose of load balancing and failover of middle-tier servers.\n- [Microconfig](https://microconfig.io) - Modern and simple way of microservice configuration management.\n- [Microphone](https://github.com/rogeralsing/Microphone) - Lightweight .NET framework to run self hosting REST services using Web Api or NancyFx on top of a Consul or Etcd cluster.\n- [Nacos](https://github.com/alibaba/nacos) - Easy-to-use dynamic service discovery, configuration and service management platform.\n- [Registrator](https://github.com/gliderlabs/registrator) - Service registry bridge for Docker. Supports pluggable service registries, which currently includes Consul, Etcd and SkyDNS 2.\n- [Shaman](https://github.com/nanopack/shaman) - Small, lightweight, api-driven DNS server.\n- [SkyDNS](https://github.com/skynetservices/skydns) - Distributed service for announcement and discovery of services built on top of etcd. It utilizes DNS queries to discover available services.\n- [SmartStack](https://github.com/airbnb/smartstack-cookbook) - Airbnb's automated service discovery and registration framework.\n- [Spring Cloud Config](http://cloud.spring.io/spring-cloud-config/) - Provides server and client-side support for externalized configuration in a distributed system.\n- [ZooKeeper](https://zookeeper.apache.org/) - Open source server which enables highly reliable distributed coordination.\n\n### Coordination & Governance\n\n- [AWS Step Functions (c)](https://aws.amazon.com/step-functions/) - Coordinate the components of distributed applications and microservices using visual workflows.\n- [Azuqua (c)](https://azuqua.com/) - Orchestration and governance platform for distributed applications.\n- [Cadence](https://cadenceworkflow.io/) - Fault-oblivious stateful code platform.\n- [Conductor](https://github.com/Netflix/conductor) - A microservices orchestration engine.\n- [Fission Workflows](https://github.com/fission/fission-workflows) - Workflow-based, reliable function composition for serverless functions.\n- [Temporal](https://github.com/temporalio/temporal) - Open source microservices orchestration platform for running mission critical code at any scale.\n- [Zeebe](https://camunda.com/platform/zeebe/) - Define, orchestrate, and monitor business processes across microservices.\n\n### Elasticity\n\n- [Hazelcast](http://hazelcast.org/) - Open source in-memory data-grid. Allows you to distribute data and computation across servers, clusters and geographies, and to manage very large data sets or high data ingest rates. Mature technology.\n- [Helix](http://helix.apache.org/) - Generic cluster management framework used for the automatic management of partitioned, replicated and distributed resources hosted on a cluster of nodes.\n- [Ignite](http://ignite.apache.org/) - High-performance, integrated and distributed in-memory platform for computing and transacting on large-scale data sets in real-time, orders of magnitude faster than possible with traditional disk-based or flash technologies.\n- [Libp2p](https://libp2p.io/) - A framework and suite of protocols for building peer-to-peer network applications.\n- [Marathon](https://mesosphere.github.io/marathon/) - Deploy and manage containers (including Docker) on top of Apache Mesos at scale.\n- [Mesos](https://mesos.apache.org/) - Abstracts CPU, memory, storage, and other compute resources away from machines (physical or virtual), enabling fault-tolerant and elastic distributed systems to easily be built and run effectively.\n- [Nomad](https://www.nomadproject.io/) - Distributed, highly available, datacenter-aware scheduler.\n- [Onyx](https://github.com/onyx-platform/onyx) - Distributed, masterless, high performance, fault tolerant data processing for Clojure.\n- [Ordasity](https://github.com/boundary/ordasity) - Designed to spread persistent or long-lived workloads across several machines.\n- [Redisson](https://github.com/mrniko/redisson) - Distributed and scalable Java data structures on top of Redis server.\n- [Serf](https://www.serfdom.io/) - Decentralized solution for cluster membership, failure detection and orchestration.\n\n### Job Schedulers / Workload Automation\n\n- [Celery](https://github.com/celery/celery) - Asynchronous task queue/job queue based on distributed message passing. Focused on real-time operation and supports scheduling.\n- [Chronos](https://github.com/mesos/chronos) - Fault tolerant job scheduler for Mesos which handles dependencies and ISO8601 based schedules.\n- [Dkron](http://dkron.io/) - Distributed, fault tolerant job scheduling system.\n- [Fenzo](https://github.com/Netflix/Fenzo) - Extensible scheduler for Mesos frameworks.\n- [JobScheduler](http://www.sos-berlin.com/jobscheduler) - Open Source solution for enterprise-level workload automation. It is used to launch executable files and shell scripts and to run database procedures automatically.\n- [Rundeck](http://rundeck.org/) - Job scheduler and runbook automation. Enable self-service access to existing scripts and tools.\n- [Schedulix](http://www.schedulix.org/en) - Open source enterprise job scheduling system lays down ground-breaking standards for the professional automation of IT processes in advanced system environments.\n\n### Logging\n\n- [Bunyan](https://github.com/trentm/node-bunyan) - Simple and fast JSON logging library for Node.js services.\n- [Fluentd](http://www.fluentd.org/) - Open source data collector for unified logging layer.\n- [Graylog](https://www.graylog.org/) - Fully integrated open source log management platform.\n- [Kibana](https://www.elastic.co/products/kibana) - Flexible analytics and visualization platform.\n- [LogDNA (c)](https://logdna.com/) - Centralized log management software. Instantly collect, centralize, and analyze logs in real-time from any platform, at any volume.\n- [Logstash](https://www.elastic.co/products/logstash) - Tool for managing events and logs.\n- [Suro](https://github.com/Netflix/suro/wiki) - Distributed data pipeline which enables services for moving, aggregating, routing, storing data.\n\n### Messaging\n\n- [ØMQ](http://zeromq.org/) - Brokerless intelligent transport layer.\n- [ActiveMQ](http://activemq.apache.org/) - Powerful open source messaging and integration patterns server.\n- [Aeron](https://github.com/real-logic/Aeron) - Efficient reliable UDP unicast, UDP multicast, and IPC message transport.\n- [Apollo](http://activemq.apache.org/apollo/) - Faster, more reliable, easier to maintain messaging broker built from the foundations of the original ActiveMQ.\n- [Ascoltatori](https://github.com/mcollina/ascoltatori) - Pub/sub library for Node.\n- [Beanstalk](https://beanstalkd.github.io/) - Simple, fast work queue.\n- [Bull](https://github.com/OptimalBits/bull) - Fast and reliable Redis-based queue for Node.\n- [Crossbar](https://github.com/crossbario/crossbar) - Open source networking platform for distributed and microservice applications. It implements the open Web Application Messaging Protocol (WAMP).\n- [Disque](https://github.com/antirez/disque) - Distributed message broker.\n- [Eventuate](http://eventuate.io/) - A platform for developing asynchronous microservices solving the distributed data management problems.\n- [Kafka](http://kafka.apache.org/) - Publish-subscribe messaging rethought as a distributed commit log.\n- [Malamute](https://github.com/zeromq/malamute) - ZeroMQ enterprise messaging broker.\n- [Mist](https://github.com/nanopack/mist) - A distributed, tag-based pub/sub service.\n- [Mosca](http://www.mosca.io/) - MQTT broker as a module.\n- [Mosquitto](http://mosquitto.org/) - Open source message broker that implements the MQTT protocol.\n- [Nanomsg](http://nanomsg.org/) - Socket library that provides several common communication patterns for building distributed systems.\n- [Nanomsg-NG](https://nng.nanomsg.org/) - Lightweight brokerless messaging.\n- [NATS](https://nats.io/) - Open source, high-performance, lightweight cloud messaging system.\n- [NSQ](http://nsq.io/) - A realtime distributed messaging platform.\n- [Pulsar](https://pulsar.apache.org/) - Distributed pub-sub messaging system.\n- [Qpid](https://qpid.apache.org/) - Cross-platform messaging components built on AMQP.\n- [RabbitMQ](https://www.rabbitmq.com/) - Open source Erlang-based message broker that just works.\n- [Redpanda](https://github.com/redpanda-data/redpanda/) - Streaming data platform for developers: Kafka API compatible, 10x faster, no ZooKeeper and no JVM.\n- [RocketMQ](https://github.com/apache/incubator-rocketmq) - A low latency, reliable, scalable, easy to use message oriented middleware born from alibaba massive messaging business.\n- [VerneMQ](https://verne.mq) - Open source, scalable, Erlang-based MQTT broker.\n\n### Monitoring & Debugging\n\n- [Beats](https://www.elastic.co/products/beats) - Lightweight shippers for Elasticsearch & Logstash.\n- [Collectd](https://collectd.org/) - The system statistics collection daemon.\n- [Elastalert](https://github.com/yelp/elastalert) - Easy & flexible alerting for Elasticsearch.\n- [Ganglia](http://ganglia.info/) - A scalable distributed monitoring system for high-performance computing systems such as clusters and grids.\n- [Grafana](http://grafana.org/) - An open source, feature rich metrics dashboard and graph editor for Graphite, InfluxDB & OpenTSDB.\n- [Graphite](http://graphite.wikidot.com/) - Scalable realtime graphing.\n- [IOpipe (c)](https://www.iopipe.com/) - Application performance monitoring for Amazon Lambda.\n- [Jaeger](https://www.jaegertracing.io/) - An open source, end-to-end distributed tracing\n- [Microservice Graph Explorer](https://github.com/hootsuite/microservice-graph-explorer) - Navigate and explore all of the microservices in your application in real time using the real application connections.\n- [OpenTracing](https://opentracing.io/) - Vendor-neutral APIs and instrumentation for distributed tracing.\n- [Parallec](https://github.com/eBay/parallec) - Fast parallel asynchronous HTTP/SSH/TCP/Ping client Java library.\n- [Prometheus](http://prometheus.io/) - An open source service monitoring system and time series database.\n- [REST Commander](https://github.com/eBay/restcommander) - Fast parallel asynchronous HTTP client as a service to monitor and manage HTTP endpoints.\n- [Riemann](http://riemann.io/) - Monitors distributed systems.\n- [Sensu](https://github.com/sensu) - Monitoring for today's infrastructure.\n- [SkyWalking](https://skywalking.apache.org/) - Application performance monitor tool for distributed systems, especially designed for microservices, cloud native and container-based (Docker, K8s, Mesos) architectures.\n- [Trace](https://github.com/RisingStack/trace-nodejs) - A visualised stack trace platform designed for microservices.\n- [Watcher](https://www.elastic.co/products/watcher) - Alerting for Elasticsearch.\n- [Zabbix](http://www.zabbix.com/) - Open source enterprise-class monitoring solution.\n- [Zipkin](http://zipkin.io) - Distributed tracing system.\n\n### Reactivity\n\n- [Reactor.io](http://projectreactor.io) - A second-generation Reactive library for building non-blocking applications on the JVM based on the Reactive Streams Specification.\n- [Reactive Kafka](https://github.com/softwaremill/reactive-kafka) - Reactive Streams API for Apache Kafka.\n- [ReactiveX](http://reactivex.io/) - API for asynchronous programming with observable streams. Available for idiomatic Java, Scala, C#, C++, Clojure, JavaScript, Python, Groovy, JRuby, and others.\n- [Simple React](https://github.com/aol/simple-react) - Powerful future streams & asynchronous data structures for Java 8.\n\n### Resilience\n\n- [Awesome Chaos Engineering](https://github.com/dastergon/awesome-chaos-engineering) :star: - A curated list of awesome chaos engineering resources.\n- [Hystrix](https://github.com/Netflix/Hystrix) - Latency and fault tolerance library designed to isolate points of access to remote systems, services and 3rd party libraries, stop cascading failure and enable resilience in complex distributed systems where failure is inevitable.\n- [Pathod](http://pathod.net/) - Crafted malice for tormenting HTTP clients and servers.\n- [Raft Consensus](http://raftconsensus.github.io/) - Consensus algorithm that is designed to be easy to understand. It's equivalent to Paxos in fault-tolerance and performance.\n- [Resilience4j](https://github.com/resilience4j/resilience4j) - Fault tolerance library designed for Java8 and functional programming.\n- [Resilient HTTP](http://resilient-http.github.io/) - A smart HTTP client with super powers like fault tolerance, dynamic server discovery, auto balancing and reactive recovery, designed for distributed systems.\n\n### Security\n\n- [Dex](https://github.com/coreos/dex) - Opinionated auth/directory service with pluggable connectors. OpenID Connect provider and third-party OAuth 2.0 delegation.\n- [Identity Server](https://github.com/IdentityServer/IdentityServer4) - OpenID Connect and OAuth 2.0 Framework for ASP.NET Core.\n- [JWT](http://jwt.io/) - JSON Web Tokens are an open, industry standard RFC 7519 method for representing claims securely between two parties.\n- [Keycloak](https://github.com/keycloak/keycloak) - Full-featured and extensible auth service. OpenID Connect provider and third-party OAuth 2.0 delegation.\n- [Light OAuth2](https://github.com/networknt/light-oauth2) - A fast, lightweight and cloud native OAuth 2.0 authorization microservices based on light-java.\n- [OAuth](http://oauth.net/2/) - Provides specific authorization flows for web applications, desktop applications, mobile phones, and living room devices. Many implementations.\n- [OpenID Connect](http://openid.net/developers/libraries/) - Libraries, products, and tools implementing current OpenID specifications and related specs.\n- [ORY](https://www.ory.sh/) - Open source identity infrastructure and services.\n- [SCIM](http://www.simplecloud.info/) - System for Cross-domain Identity Management.\n- [Vault](https://www.vaultproject.io/) - Secures, stores, and tightly controls access to tokens, passwords, certificates, API keys, and other secrets in modern computing.\n\n### Serialization\n\n- [Avro](https://avro.apache.org/) - Apache data serialization system providing rich data structures in a compact, fast, binary data format.\n- [Bond](https://github.com/microsoft/bond/) - Cross-platform framework for working with schematized data, broadly used at Microsoft in high scale services.\n- [BooPickle](https://github.com/ochrons/boopickle) - Binary serialization library for efficient network communication. For Scala and Scala.js\n- [Cap’n Proto](https://capnproto.org/) - Insanely fast data interchange format and capability-based RPC system.\n- [CBOR](http://cbor.io/) - Implementations of the CBOR standard (RFC 7049) in many languages.\n- [Cereal](http://uscilab.github.io/cereal/) - C++11 library for serialization.\n- [Cheshire](https://github.com/dakrone/cheshire) - Clojure JSON and JSON SMILE encoding/decoding.\n- [Etch](http://etch.apache.org/) - Cross-platform, language and transport-independent framework for building and consuming network services.\n- [Fastjson](https://github.com/alibaba/fastjson) - Fast JSON Processor.\n- [Ffjson](https://github.com/pquerna/ffjson) - Faster JSON serialization for Go.\n- [FST](https://github.com/RuedigerMoeller/fast-serialization) - Fast java serialization drop in-replacement.\n- [Jackson](https://github.com/FasterXML/jackson) -  A multi-purpose Java library for processing JSON data format.\n- [Jackson Afterburner](https://github.com/FasterXML/jackson-module-afterburner) - Jackson module that uses bytecode generation to further speed up data binding (+30-40% throughput for serialization, deserialization).\n- [Kryo](https://github.com/EsotericSoftware/kryo) - Java serialization and cloning: fast, efficient, automatic.\n- [MessagePack](http://msgpack.org/) - Efficient binary serialization format.\n- [Protostuff](https://github.com/protostuff/protostuff) - A serialization library with built-in support for forward-backward compatibility (schema evolution) and validation.\n- [SBinary](https://github.com/harrah/sbinary) - Library for describing binary formats for Scala types.\n- [Thrift](http://thrift.apache.org/) - The Apache Thrift software framework, for scalable cross-language services development.\n\n### Storage\n\n- [Apache Hive](https://hive.apache.org/) - Data warehouse infrastructure built on top of Hadoop.\n- [Apache Cassandra](http://cassandra.apache.org) - Column-oriented and providing high availability with no single point of failure.\n- [Apache HBase](http://hbase.apache.org) - Hadoop database for big data.\n- [Aerospike (c)](http://www.aerospike.com/) - High performance NoSQL database delivering speed at scale.\n- [ArangoDB](https://www.arangodb.com/) - A distributed free and open source database with a flexible data model for documents, graphs, and key-values.\n- [AtlasDB](https://github.com/palantir/atlasdb) - Transactional layer on top of a key value store.\n- [Citus](https://github.com/citusdata/citus) - Distributed PostgreSQL as an extension.\n- [ClickHouse](https://clickhouse.yandex/) - Column-oriented database management system that allows generating analytical data reports in real time.\n- [CockroachDB (c)](https://www.cockroachlabs.com/) - A cloud-native SQL database modelled after Google Spanner.\n- [Couchbase](http://www.couchbase.com/) - A distributed database engineered for performance, scalability, and simplified administration.\n- [Crate (c)](https://crate.io/) - Scalable SQL database with the NoSQL goodies.\n- [Datomic](http://www.datomic.com/) - Fully transactional, cloud-ready, distributed database.\n- [Druid](http://druid.io/) - Fast column-oriented distributed data store.\n- [Elasticsearch](https://www.elastic.co/products/elasticsearch) - Open source distributed, scalable, and highly available search server.\n- [Geode](http://geode.incubator.apache.org/) - Open source, distributed, in-memory database for scale-out applications.\n- [Infinispan](http://infinispan.org/) - Highly concurrent key/value datastore used for caching.\n- [InfluxDB](https://github.com/influxdata/influxdb) - Scalable datastore for metrics, events, and real-time analytics.\n- [MemSQL (c)](http://www.memsql.com/) - High-performance, in-memory database that combines the horizontal scalability of distributed systems with the familiarity of SQL.\n- [OpenTSDB](http://opentsdb.net) - Scalable and distributed time series database written on top of Apache HBase.\n- [Parquet](https://github.com/apache/parquet-format) - Columnar storage format available to any project in the Hadoop ecosystem, regardless of the choice of data processing framework, data model or programming language.\n- [Pilosa](https://github.com/pilosa/pilosa) - Open source, distributed bitmap index that dramatically accelerates queries across multiple, massive data sets.\n- [Reborn](https://github.com/reborndb/reborn) - Distributed database fully compatible with redis protocol.\n- [RethinkDB](http://rethinkdb.com/) - Open source, scalable database that makes building realtime apps easier.\n- [Secure Scuttlebutt](https://github.com/ssbc/docs) - P2P database of message-feeds.\n- [Tachyon](http://tachyon-project.org/) - Memory-centric distributed storage system, enabling reliable data sharing at memory-speed across cluster frameworks.\n- [TiKV](https://github.com/tikv) - Distributed transactional key-value database.\n- [Voldemort](https://github.com/voldemort/voldemort) - Open source clone of Amazon DynamoDB\n- [VoltDB (c)](https://www.voltdb.com/) - In-Memory ACID compliant distributed database.\n\n### Testing\n\n- [Goreplay](https://github.com/buger/goreplay) - A tool for capturing and replaying live HTTP traffic into a test environment.\n- [Hikaku](https://github.com/codecentric/hikaku) - A library that tests if the implementation of a REST-API meets its specification.\n- [Mitmproxy](https://mitmproxy.org/) - An interactive console program that allows traffic flows to be intercepted, inspected, modified and replayed.\n- [Mountebank](http://www.mbtest.org/) - Cross-platform, multi-protocol test doubles over the wire.\n- [Pact](https://docs.pact.io) - Contract testing framework for HTTP APIs and non-HTTP asynchronous messaging systems.\n- [RestQA](https://github.com/restqa/restqa) - A tool to manage microservices mocking, unit and performance testing locally with best in class developer experience.\n- [Spring Cloud Contract](https://cloud.spring.io/spring-cloud-contract/) - TDD to the level of software architecture.\n- [VCR](https://github.com/vcr/vcr) - Record your test suite's HTTP interactions and replay them during future test runs for fast, deterministic, accurate tests. See the list of ports for implementations in other languages.\n- [Wilma](https://github.com/epam/Wilma) - Combined HTTP/HTTPS service stub and transparent proxy solution.\n- [WireMock](http://wiremock.org/) - Flexible library for stubbing and mocking web services. Unlike general purpose mocking tools it works by creating an actual HTTP server that your code under test can connect to as it would a real web service.\n- [Hoverfly](https://github.com/spectolabs/hoverfly) - Lightweight service virtualization/API simulation tool for developers and testers.\n\n## Continuous Integration & Delivery\n\n- [Awesome CI/CD DevOps](https://github.com/ciandcd/awesome-ciandcd) :star: - A curated list of awesome tools for continuous integration, continuous delivery and DevOps.\n\n## Web API Modeling & Documentation\n\n### GraphQL\n\n- [GraphQL](http://graphql.org/) - Query language designed to build client applications by providing an intuitive and flexible syntax and system for describing their data requirements and interactions.\n\n### JSON\n\n- [JSON:API](https://jsonapi.org/) - A specification for how a client should request that resources be fetched or modified, and how a server should respond to those requests.\n\n### REST\n\n- [Aglio](https://github.com/danielgtaylor/aglio) - API Blueprint renderer with theme support that outputs static HTML.\n- [API Blueprint](https://apiblueprint.org/) - Tools for your whole API lifecycle. Use it to discuss your API with others. Generate documentation automatically. Or a test suite. Or even some code.\n- [Apidoc](https://github.com/mbryzek/apidoc) - Beautiful documentation for REST services.\n- [RAML](http://raml.org/) - RESTful API Modeling Language, a simple and succinct way of describing practically-RESTful APIs.\n- [ReDoc](https://github.com/Rebilly/ReDoc) - OpenAPI/Swagger-generated API Documentation.\n- [Slate](https://github.com/tripit/slate) - Beautiful static documentation for your API.\n- [Spring REST Docs](http://projects.spring.io/spring-restdocs/) - Document RESTful services by combining hand-written documentation with auto-generated snippets produced with Spring MVC Test.\n- [Swagger](https://swagger.io/) - A simple yet powerful representation of your RESTful API.\n\n## Standards / Recommendations\n\n### World Wide Web\n\n- [W3C.REC-Webarch](http://www.w3.org/TR/webarch/) - Architecture of the World Wide Web, Volume One.\n- [RFC3986](https://tools.ietf.org/html/rfc3986) - Uniform Resource Identifier (URI): Generic Syntax.\n- [RFC6570](https://tools.ietf.org/html/rfc6570) - URI Template.\n- [RFC7320](https://tools.ietf.org/html/rfc7320) - URI Design and Ownership.\n\n### Self-sovereignty & Decentralisation\n\n- [DID](https://www.w3.org/TR/did-core/) - W3C specification of Decentralized identifiers (DIDs): a new type of identifier that enables verifiable, decentralized digital identity.\n- [DIDComm](https://identity.foundation/didcomm-messaging/spec/) - Private communication methodology built atop the decentralized design of DIDs.\n- [DIDComm Protocols](https://didcomm.org/) - Registry of protocols built on DIDComm, for high-trust, self-sovereign interactions over any transport.\n- [IDSA](https://internationaldataspaces.org/) - The International Data Spaces Association (IDSA) is on a mission to create the future of the global, digital economy with International Data Spaces (IDS), a secure, sovereign system of data sharing in which all participants can realize the full value of their data.\n\n### HTTP/1.1\n\n- [RFC7230](https://tools.ietf.org/html/rfc7230) - Message Syntax and Routing.\n- [RFC7231](https://tools.ietf.org/html/rfc7231) - Semantics and Content.\n- [RFC7232](https://tools.ietf.org/html/rfc7232) - Conditional Requests.\n- [RFC7233](https://tools.ietf.org/html/rfc7233) - Range Requests.\n- [RFC7234](https://tools.ietf.org/html/rfc7234) - Caching.\n- [RFC7235](https://tools.ietf.org/html/rfc7235) - Authentication.\n- [RFC7807](https://tools.ietf.org/html/rfc7807) - Problem Details for HTTP APIs.\n\n### HTTP/2\n\n- [RFC7540](https://tools.ietf.org/html/rfc7540) - Hypertext Transfer Protocol Version 2.\n\n### QUIC\n\n- [QUIC-WG](https://quicwg.org/) - IETF Working Group that is chartered to deliver the next transport protocol for the Internet.\n- [QUIC-Transport](https://tools.ietf.org/html/draft-ietf-quic-transport-27) - A UDP-based multiplexed and secure transport.\n\n### RPC\n\n- [JSON-RPC 2.0](http://www.jsonrpc.org/specification) - A stateless, light-weight remote procedure call (RPC) protocol.\n\n### Messaging\n\n- [AMQP](https://www.amqp.org/) - Advanced Message Queuing Protocol.\n- [MQTT](https://mqtt.org/ - MQ Telemetry Transport.\n- [STOMP](https://stomp.github.io/) - Simple Text Oriented Messaging Protocol.\n\n### Security\n\n- [GNAP](https://datatracker.ietf.org/doc/html/draft-ietf-gnap-core-protocol) - Grant Negotiation and Authorization Protocol defines a mechanism for delegating authorization to a piece of software, and conveying that delegation to the software. This delegation can include access to a set of APIs as well as information passed directly to the software.<sup>DRAFT</sup>\n- [OIDCONN](http://openid.net/connect/) - OpenID Connect 1.0 is a simple identity layer on top of the OAuth 2.0 protocol. It allows clients to verify the identity of the end-user based on the authentication performed by an Authorization Server, as well as to obtain basic profile information about the end-user in an interoperable and REST-like manner.\n- [PASETO](https://paseto.io/) - Paseto is everything you love about JOSE (JWT, JWE, JWS) without any of the many design deficits that plague the JOSE standards. <sup>DRAFT</sup>\n- [RFC5246](https://tools.ietf.org/html/rfc5246) - The Transport Layer Security (TLS) Protocol Version 1.2.\n- [RFC6066](https://tools.ietf.org/html/rfc6066) - TLS Extensions.\n- [RFC6347](https://tools.ietf.org/html/rfc6347) - Datagram Transport Layer Security Version 1.2.\n- [RFC6749](https://tools.ietf.org/html/rfc6749) - The OAuth 2.0 authorization framework.\n- [RFC6962](https://tools.ietf.org/html/rfc6962) - Certificate transparency.\n- [RFC7515](https://tools.ietf.org/html/rfc7515) - JSON Web Signature (JWS) represents content secured with digital signatures or Message Authentication Codes (MACs) using JSON-based data structures.\n- [RFC7519](https://tools.ietf.org/html/rfc7519) - JSON Web Token (JWT) is a compact, URL-safe means of representing claims to be transferred between two parties.\n- [RFC7642](https://tools.ietf.org/html/rfc7642) - SCIM: Definitions, overview, concepts, and requirements.\n- [RFC7643](https://tools.ietf.org/html/rfc7643) - SCIM: Core Schema, provides a platform-neutral schema and extension model for representing users and groups.\n- [RFC7644](https://tools.ietf.org/html/rfc7644) - SCIM: Protocol, an application-level, REST protocol for provisioning and managing identity data on the web.\n\n### Web APIs\n\n- [HAL](https://tools.ietf.org/html/draft-kelly-json-hal-07) - The JSON Hypertext Application Language (HAL) is a standard which establishes conventions for expressing hypermedia controls, such as links, with JSON. <sup>DRAFT</sup>\n- [Hydra](http://www.hydra-cg.com/) - Specifications for interoperable, hypermedia-driven Web APIs.\n- [OpenAPI](https://github.com/OAI/openapi-specification/) - The OpenAPI Specification (OAS) defines a standard, programming language-agnostic interface description for REST APIs, which allows both humans and computers to discover and understand the capabilities of a service without requiring access to source code, additional documentation, or inspection of network traffic.\n- [WADL](http://www.w3.org/Submission/wadl/) - The Web Application Description Language specification.\n- [WSDL](http://www.w3.org/TR/wsdl20/) - The Web Services Description Language Version 2.0 spec.\n\n### Service Discovery\n- [DNS-SD](https://datatracker.ietf.org/doc/html/rfc6763) - Mechanism for clients to discover a list of named instances of a service, using standard DNS queries.\n- [RFC2782](https://datatracker.ietf.org/doc/html/rfc2782) - A DNS RR for specifying the location of services (DNS SRV).\n\n### Data Formats\n\n- [RFC4627](https://tools.ietf.org/html/rfc4627) - JavaScript Object Notation (JSON).\n- [RFC7049](http://tools.ietf.org/search/rfc7049) - Concise Binary Object Representation (CBOR).\n- [BSON](http://bsonspec.org/) - Binary JSON (BSON).\n- [JSON-LD](http://json-ld.org/) - JSON for Linking Data.\n- [SBE](https://github.com/FIXTradingCommunity/fix-simple-binary-encoding) - Simple Binary Encoding (SBE).\n- [MSGPACK](https://github.com/msgpack/msgpack/blob/master/spec.md) - MessagePack Specification.\n\n### Vocabularies\n\n- [JSON Schema](http://json-schema.org/) - Vocabulary that allows you to annotate and validate JSON documents.\n- [Schema.org](http://schema.org/) - Collaborative, community activity with a mission to create, maintain, and promote schemas for structured data on the Internet, on web pages, in email messages, and beyond.\n\n### Unicode\n\n- [UNIV8](http://www.unicode.org/versions/Unicode8.0.0/) - The Unicode Consortium. The Unicode Standard, Version 8.0.0, (Mountain View, CA: The Unicode Consortium, 2015. ISBN 978-1-936213-10-8).\n- [RFC3629](https://tools.ietf.org/html/rfc3629) - UTF-8, a transformation format of ISO 10646.\n\n## Organization Design / Team Dynamics\n\n- [How Do Committees Invent?](http://www.melconway.com/Home/pdf/committees.pdf) :small_orange_diamond:<sup>PDF</sup> - Melvin E. Conway, Datamation magazine 1968. The original article defining Conway's Law.\n- [Service per Team](https://microservices.io/patterns/decomposition/service-per-team.html) - Each team is responsible for one or more business functions (e.g. business capabilities). A team owns a code base consisting of one or more modules. Its code base is sized so as to not exceed the cognitive capacity of team. The team deploys its code as one or more services. A team should have exactly one service unless there is a proven need to have multiple services.\n- [Start with Team Cognitive Load - Team Topologies](https://www.youtube.com/watch?v=haejb5rzKsM) :small_red_triangle:<sup>YT</sup> - DOES19 London. The \"monoliths vs microservices\" debate often focuses on technological aspects, ignoring strategy and team dynamics. Instead of technology, smart-thinking organizations are beginning with team cognitive load as the guiding principle for modern software. In this talk, we explain how and why, illustrated by real case studies.\n\n## Enterprise & Verticals\n\n- [Commercetools](https://commercetools.com/) - Headless commerce platform.\n- [Elasticpath](https://www.elasticpath.com/) - E-commerce microservices.\n- [Equinox](https://www.infosysequinox.com/) - Infosys Equinox is a human-centric commerce and marketing platform that supports rich, hyper-personalized experiences across any channel and touchpoint.\n- [Flamingo](https://www.flamingo.me/) - Framework to build flexible and modern e-commerce applications.\n- [Medusa](https://medusajs.com/) - Headless open source commerce platform.\n- [Predix](https://predix.io/) - Industrial microservices platform.\n\n## Theory\n\n### Articles & Papers\n\n- [Awesome Scalability](https://github.com/binhnguyennus/awesome-scalability) :star: - An updated and organized reading list for illustrating the patterns of scalable, reliable, and performant large-scale systems. Concepts are explained in the articles of prominent engineers and credible references. Case studies are taken from battle-tested systems that serve millions to billions of users.\n- [A Sidecar for Your Service Mesh](https://www.abhishek-tiwari.com/a-sidecar-for-your-service-mesh/) - A short service mesh introduction.\n- [AKF Scale Cube](http://akfpartners.com/techblog/2008/05/08/splitting-applications-or-services-for-scale/) - Model depicting the dimensions to scale a service.\n- [Building Microservices? Here is What You Should Know](https://cloudncode.blog/2016/07/22/msa-getting-started/) - A practical overview, based on real-world experience, of what one would need to know in order to build microservices.\n- [CALM](http://db.cs.berkeley.edu/papers/cidr11-bloom.pdf) :small_orange_diamond:<sup>PDF</sup> - Consistency as logical monotonicity.\n- [Canary Release](http://martinfowler.com/bliki/CanaryRelease.html) - Technique to reduce the risk of introducing a new software version in production by slowly rolling out the change to a small subset of users before rolling it out to the entire infrastructure and making it available to everybody.\n- [CAP Theorem](http://blog.thislongrun.com/2015/03/the-cap-theorem-series.html) -  States that it is impossible for a distributed computer system to simultaneously provide all three of the following guarantees: Consistency, Availability and Partition tolerance.\n- [Formal Foundations of Serverless Computing](https://arxiv.org/pdf/1902.05870.pdf) :small_orange_diamond:<sup>PDF</sup> - The serverless computing abstraction exposes several low-level operational details that make it hard for programmers to write and reason about their code. This paper sheds light on this problem by presenting λ, an operational semantics of the essence of serverless computing.\n- [Introducing Domain-Oriented Microservice Architecture](https://www.uber.com/blog/microservice-architecture/) - Introduction to Uber Engineering generalized approach to microservice architectures, named “Domain-Oriented Microservice Architecture” (DOMA).\n- [Java Microservices: A Practical Guide](https://www.marcobehler.com/guides/java-microservices-a-practical-guide) - You can use this guide to understand what Java microservices are, how you architect and build them. Also: A look at Java microservice libraries & common questions.\n- [Microservice Architecture](http://martinfowler.com/articles/microservices.html) - Particular way of designing software applications as suites of independently deployable services.\n- [Microservices – Please, don’t](https://riak.com/posts/technical/microservices-please-dont/) - Critical advice about some problems regarding a microservices approach.\n- [Microservices RefCard](https://dzone.com/refcardz/getting-started-with-microservices) - Getting started with microservices.\n- [Microservices Trade-Offs](http://martinfowler.com/articles/microservice-trade-offs.html) - Guide to ponder costs and benefits of the mircoservices architectural style.\n- [Reactive Manifesto](http://www.reactivemanifesto.org/) - Reactive systems definition.\n- [Reactive Streams](http://www.reactive-streams.org/) - Initiative to provide a standard for asynchronous stream processing with non-blocking back pressure.\n- [ROCAS](http://resources.1060research.com/docs/2015/Resource-Oriented-Computing-Adaptive-Systems-ROCAS-1.2.pdf) :small_orange_diamond:<sup>PDF</sup> - Resource Oriented Computing for Adaptive Systems.\n- [SECO](http://ceur-ws.org/Vol-746/IWSECO2011-6-DengYu.pdf) :small_orange_diamond:<sup>PDF</sup> - Understanding software ecosystems: a strategic modeling approach.\n- [Service Discovery in a Microservice Architecture](https://www.nginx.com/blog/service-discovery-in-a-microservices-architecture/) - Overview of discovery and registration patterns.\n- [Testing Strategies in a Microservice Architecture](http://martinfowler.com/articles/microservice-testing/) - Approaches for managing the additional testing complexity of multiple independently deployable components.\n- [Your Server as a Function](http://monkey.org/~marius/funsrv.pdf) :small_orange_diamond:<sup>PDF</sup> - Describes three abstractions which combine to present a powerful programming model for building safe, modular, and efficient server software: Composable futures, services and filters.\n- [Microservices - The Journey So Far and Challenges Ahead](https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8354433) :small_orange_diamond:<sup>PDF</sup> - Overview of the state of microservices in both industrial and academia.\n\n### Sites & Organizations\n\n- [Cloud Native Computing Foundation](https://www.cncf.io/) - The Cloud Native Computing Foundation builds sustainable ecosystems and fosters a community around a constellation of high-quality projects that orchestrate containers as part of a microservices architecture.\n- [CNCF Cloud Native Interactive Landscape](https://landscape.cncf.io/) - Interactive landscape of cloud native technologies.\n- [Microservices Resource Guide](http://martinfowler.com/microservices/) - Martin Fowler's choice of articles, videos, books, and podcasts that can teach you more about the microservices architectural style.\n- [Microservice Patterns](http://microservices.io/) - Microservice architecture patterns and best practices.\n- [Microservice Antipatterns and Pitfalls](https://www.oreilly.com/ideas/microservices-antipatterns-and-pitfalls) - Microservice mostly known antipatterns and pitfalls.\n\n## License\n\n[![CC0](http://i.creativecommons.org/p/zero/1.0/88x31.png)](http://creativecommons.org/publicdomain/zero/1.0/)\n\n## Contributing\n\nPlease, read the [Contribution Guidelines](https://github.com/mfornos/awesome-microservices/blob/master/CONTRIBUTING.md) before submitting your suggestion.\n\nFeel free to [open an issue](https://github.com/mfornos/awesome-microservices/issues) or [create a pull request](https://github.com/mfornos/awesome-microservices/pulls) with your additions.\n\n:star2: Thank you!\n"
}