{
  "repo_name": "onlurking_awesome-infosec",
  "readme_content": "Awesome Infosec\n===============\n\n[![Awesome](https://cdn.rawgit.com/sindresorhus/awesome/d7305f38d29fed78fa85652e3a63e154dd8e8829/media/badge.svg)](https://github.com/sindresorhus/awesome)\n\nA curated list of awesome information security resources, inspired by the awesome-* trend on GitHub.\n\nThose resources and tools are intended only for cybersecurity professional and educational use in a controlled environment.\n\nTable of Contents\n=================\n\n1. [Massive Online Open Courses](#massive-online-open-courses)\n2. [Academic Courses](#academic-courses)\n3. [Laboratories](#laboratories)\n4. [Capture the Flag](#capture-the-flag)\n5. [Open Security Books](#open-security-books)\n6. [Challenges](#challenges)\n7. [Documentation](#documentation)\n8. [SecurityTube Playlists](#securitytube-playlists)\n9. [Related Awesome Lists](#related-awesome-lists)\n10. [Contributing](#contributing)\n11. [License](#license)\n\nMassive Online Open Courses\n===========================\n\n#### Stanford University - Computer Security\nIn this class you will learn how to design secure systems and write secure code. You will learn how to find vulnerabilities in code and how to design software systems that limit the impact of security vulnerabilities. We will focus on principles for building secure systems and give many real world examples.\n\n- [Stanford University - Computer Security](https://www.coursera.org/learn/security)\n\n#### Stanford University - Cryptography I\nThis course explains the inner workings of cryptographic primitives and how to correctly use them. Students will learn how to reason about the security of cryptographic constructions and how to apply this knowledge to real-world applications. The course begins with a detailed discussion of how two parties who have a shared secret key can communicate securely when a powerful adversary eavesdrops and tampers with traffic. We will examine many deployed protocols and analyze mistakes in existing systems. The second half of the course discusses public-key techniques that let two or more parties generate a shared secret key. We will cover the relevant number theory and discuss public-key encryption and basic key-exchange. Throughout the course students will be exposed to many exciting open problems in the field.\n\n- [Stanford University - Cryptography I](https://www.coursera.org/learn/crypto)\n\n#### Stanford University - Cryptography II\nThis course is a continuation of Crypto I and explains the inner workings of public-key systems and cryptographic protocols.   Students will learn how to reason about the security of cryptographic constructions and how to apply this knowledge to real-world applications. The course begins with constructions for digital signatures and their applications.   We will then discuss protocols for user authentication and zero-knowledge protocols.    Next we will turn to privacy applications of cryptography supporting anonymous credentials and private database lookup.  We will conclude with more advanced topics including multi-party computation and elliptic curve cryptography.\n\n- [Stanford University - Cryptography II](https://www.coursera.org/learn/crypto2)\n\n#### University of Maryland - Usable Security\nThis course focuses on how to design and build secure systems with a human-centric focus. We will look at basic principles of human-computer interaction, and apply these insights to the design of secure systems with the goal of developing security measures that respect human performance and their goals within a system.\n\n- [University of Maryland - Usable Security](https://www.coursera.org/learn/usablesec)\n\n#### University of Maryland - Software Security\nThis course we will explore the foundations of software security. We will consider important software vulnerabilities and attacks that exploit them -- such as buffer overflows, SQL injection, and session hijacking -- and we will consider defenses that prevent or mitigate these attacks, including advanced testing and program analysis techniques. Importantly, we take a \"build security in\" mentality, considering techniques at each phase of the development cycle that can be used to strengthen the security of software systems.\n\n- [University of Maryland - Software Security](https://www.coursera.org/learn/softwaresec)\n\n#### University of Maryland - Cryptography\nThis course will introduce you to the foundations of modern cryptography, with an eye toward practical applications. We will learn the importance of carefully defining security; of relying on a set of well-studied \"hardness assumptions\" (e.g., the hardness of factoring large numbers); and of the possibility of proving security of complicated constructions based on low-level primitives. We will not only cover these ideas in theory, but will also explore their real-world impact. You will learn about cryptographic primitives in wide use today, and see how these can be combined to develop modern protocols for secure communication.\n\n- [University of Maryland - Cryptography](https://www.coursera.org/learn/cryptography)\n\n#### University of Maryland - Hardware Security\nThis course will introduce you to the foundations of modern cryptography, with an eye toward practical applications. We will learn the importance of carefully defining security; of relying on a set of well-studied “hardness assumptions” (e.g., the hardness of factoring large numbers); and of the possibility of proving security of complicated constructions based on low-level primitives. We will not only cover these ideas in theory, but will also explore their real-world impact. You will learn about cryptographic primitives in wide use today, and see how these can be combined to develop modern protocols for secure communication.\n\n- [University of Maryland - Hardware Security](https://www.coursera.org/learn/hardwaresec)\n\n\n#### University of Washington - Introduction to CyberSecurity\nThis course will introduce you to the cybersecurity, ideal for learners who are curious about the world of Internet security and who want to be literate in the field. This course will take a ride in to cybersecurity feild for beginners.\n\n- [University of Washington - Introduction to CyberSecurity](https://www.edx.org/course/introduction-to-cybersecurity)\n\n\n#### University of Washington - Finding Your Cybersecurity Career Path\nThere are 5-6 major job roles in industry for cybersecurity enthusiast. In This course you will Learn about different career pathways in cybersecurity and complete a self-assessment project to better understand the right path for you.\n\n- [University of Washington - Finding Your Cybersecurity Career Path](https://www.edx.org/course/finding-your-cybersecurity-career-path)\n\n#### University of Washington - Essentials of Cybersecurity\nThis course is good for beginner It contains introduction to cybersecurity, The CISO's view, Helps you building cybersecurity toolKit and find your cybersecurity career path. \n\n- [University of Washington - Essentials of Cybersecurity](https://www.edx.org/professional-certificate/uwashingtonx-essentials-cybersecurity)\n\nAcademic Courses\n================\n\n#### NYU Tandon School of Engineering - OSIRIS Lab's Hack Night\n\nDeveloped from the materials of NYU Tandon's old Penetration Testing and Vulnerability Analysis course, Hack Night is a sobering introduction to offensive security. A lot of complex technical content is covered very quickly as students are introduced to a wide variety of complex and immersive topics over thirteen weeks.\n\n- [NYU Tandon's OSIRIS Lab's Hack Night](https://github.com/isislab/Hack-Night)\n\n#### Florida State University's - Offensive Computer Security\nThe primary incentive for an attacker to exploit a vulnerability, or series of vulnerabilities is to achieve a return on an investment (his/her time usually). This return need not be strictly monetary, an attacker may be interested in obtaining access to data, identities, or some other commodity that is valuable to them.  The field of penetration testing involves authorized auditing and exploitation of systems to assess actual system security in order to protect against attackers.  This requires thorough knowledge of vulnerabilities and how to exploit them.  Thus, this course provides an introductory but comprehensive coverage of the fundamental methodologies, skills, legal issues, and tools used in white hat penetration testing and secure system administration.\n\n * [Offensive Computer Security - Spring 2014](http://www.cs.fsu.edu/~redwood/OffensiveComputerSecurity)\n * [Offensive Computer Security - Spring 2013](http://www.cs.fsu.edu/~redwood/OffensiveSecurity)\n\n#### Florida State University's - Offensive Network Security\nThis class allows students to look deep into know protocols (i.e. IP, TCP, UDP) to see how an attacker can utilize these protocols to their advantage and how to spot issues in a network via captured network traffic.\nThe first half of this course focuses on know protocols while the second half of the class focuses on reverse engineering unknown protocols. This class will utilize captured traffic to allow students to reverse the protocol by using known techniques such as incorporating bioinformatics introduced by Marshall Beddoe. This class will also cover fuzzing protocols to see if the server or client have vulnerabilities. Overall, a student finishing this class will have a better understanding of the network layers, protocols, and network communication and their interaction in computer networks.\n\n * [Offensive Network Security](http://www.cs.fsu.edu/~lawrence/OffNetSec/)\n\n####  Rensselaer Polytechnic Institute - Malware Analysis\n\nThis course will introduce students to modern malware analysis techniques through readings and hands-on interactive analysis of real-world samples. After taking this course students will be equipped with the skills to analyze advanced contemporary malware using both static and dynamic analysis.\n\n- [CSCI 4976 - Fall '15 Malware Analysis](https://github.com/RPISEC/Malware)\n\n####  Rensselaer Polytechnic Institute - Modern Binary Exploitation\nThis course will start off by covering basic x86 reverse engineering, vulnerability analysis, and classical forms of Linux-based userland binary exploitation. It will then transition into protections found on modern systems (Canaries, DEP, ASLR, RELRO, Fortify Source, etc) and the techniques used to defeat them. Time permitting, the course will also cover other subjects in exploitation including kernel-land and Windows based exploitation.\n\n* [CSCI 4968 - Spring '15 Modern Binary Exploitation](https://github.com/RPISEC/MBE)\n\n####  Rensselaer Polytechnic Institute - Hardware Reverse Engineering\nReverse engineering techniques for semiconductor devices and their applications to competitive analysis, IP litigation, security testing, supply chain verification, and failure analysis. IC packaging technologies and sample preparation techniques for die recovery and live analysis. Deprocessing and staining methods for revealing features bellow top passivation. Memory technologies and appropriate extraction techniques for each. Study contemporary anti-tamper/anti-RE methods and their effectiveness at protecting designs from attackers. Programmable logic microarchitecture and the issues involved with reverse engineering programmable logic.\n\n- [CSCI 4974/6974 - Spring '14 Hardware Reverse Engineering](http://security.cs.rpi.edu/courses/hwre-spring2014/)\n\n####  City College of San Francisco - Sam Bowne Class\n\n- [CNIT 40: DNS Security ](https://samsclass.info/40/40_F16.shtml)<br>\nDNS is crucial for all Internet transactions, but it is subject to numerous security risks, including phishing, hijacking, packet amplification, spoofing, snooping, poisoning, and more. Learn how to configure secure DNS servers, and to detect malicious activity with DNS monitoring. We will also cover DNSSEC principles and deployment. Students will perform hands-on projects deploying secure DNS servers on both Windows and Linux platforms.\n\n- [CNIT 120 - Network Security](https://samsclass.info/120/120_S15.shtml)<br>\nKnowledge and skills required for Network Administrators and Information Technology professionals to be aware of security vulnerabilities, to implement security measures, to analyze an existing network environment in consideration of known security threats or risks, to defend against attacks or viruses, and to ensure data privacy and integrity. Terminology and procedures for implementation and configuration of security, including access control, authorization, encryption, packet filters, firewalls, and Virtual Private Networks (VPNs).\n\n- [CNIT 121 - Computer Forensics](https://samsclass.info/121/121_F16.shtml)<br>\nThe class covers forensics tools, methods, and procedures used for investigation of computers, techniques of data recovery and evidence collection, protection of evidence, expert witness skills, and computer crime investigation techniques. Includes analysis of various file systems and specialized diagnostic software used to retrieve data. Prepares for part of the industry standard certification exam, Security+, and also maps to the Computer Investigation Specialists exam.\n\n- [CNIT 123 - Ethical Hacking and Network Defense](https://samsclass.info/123/123_S17.shtml)<br>\nStudents learn how hackers attack computers and networks, and how to protect systems from such attacks, using both Windows and Linux systems. Students will learn legal restrictions and ethical guidelines, and will be required to obey them. Students will perform many hands-on labs, both attacking and defending, using port scans, footprinting, exploiting Windows and Linux vulnerabilities, buffer overflow exploits, SQL injection, privilege escalation, Trojans, and backdoors.\n\n- [CNIT 124 - Advanced Ethical Hacking](https://samsclass.info/124/124_F15.shtml)<br>\nAdvanced techniques of defeating computer security, and countermeasures to protect Windows and Unix/Linux systems. Hands-on labs include Google hacking, automated footprinting, sophisticated ping and port scans, privilege escalation, attacks against telephone and Voice over Internet Protocol (VoIP) systems, routers, firewalls, wireless devices, Web servers, and Denial of Service attacks.\n\n- [CNIT 126 - Practical Malware Analysis](https://samsclass.info/126/126_S16.shtml)<br>\nLearn how to analyze malware, including computer viruses, trojans, and rootkits, using disassemblers, debuggers, static and dynamic analysis, using IDA Pro, OllyDbg and other tools.\n\n- [CNIT 127 - Exploit Development](https://samsclass.info/127/127_S17.shtml)<br>\nLearn how to find vulnerabilities and exploit them to gain control of target systems, including Linux, Windows, Mac, and Cisco. This class covers how to write tools, not just how to use them; essential skills for advanced penetration testers and software security professionals.\n\n- [CNIT 128 - Hacking Mobile Devices](https://samsclass.info/128/128_S17.shtml)<br>\nMobile devices such as smartphones and tablets are now used for making purchases, emails, social networking, and many other risky activities. These devices run specialized operating systems have many security problems. This class will cover how mobile operating systems and apps work, how to find and exploit vulnerabilities in them, and how to defend them. Topics will include phone call, voicemail, and SMS intrusion, jailbreaking, rooting, NFC attacks, malware, browser exploitation, and application vulnerabilities. Hands-on projects will include as many of these activities as are practical and legal.\n\n- [CNIT 129S: Securing Web Applications](https://samsclass.info/129S/129S_F16.shtml)<br>\nTechniques used by attackers to breach Web applications, and how to protect them. How to secure authentication, access, databases, and back-end components. How to protect users from each other. How to find common vulnerabilities in compiled code and source code.\n\n- [CNIT 140: IT Security Practices](https://samsclass.info/140/140_F16.shtml)<br>\nTraining students for cybersecurity competitions, including CTF events and the [Collegiate Cyberdefense Competition (CCDC)](http://www.nationalccdc.org/). This training will prepare students for employment as security professionals, and if our team does well in the competitions, the competitors will gain recognition and respect which should lead to more and better job offers.\n\n- [Violent Python and Exploit Development](https://samsclass.info/127/127_WWC_2014.shtml)<br>\n In the exploit development section, students will take over vulnerable systems with simple Python scripts.\n\n####  University of Cincinnati - CS6038/CS5138 Malware Analysis\n\nThis class will introduce the CS graduate students to malware concepts, malware analysis, and black-box reverse engineering techniques. The target audience is focused on computer science graduate students or undergraduate seniors without prior cyber security or malware experience. It is intended to introduce the students to types of malware, common attack recipes, some tools, and a wide array of malware analysis techniques.\n- [CS6038/CS5138 Malware Analysis](https://class.malware.re/)\n\n#### Eurecom - Mobile Systems and Smartphone Security (MOBISEC)\n\nHands-On course coverings topics such as mobile ecosystem, the design and architecture of mobile operating systems, application analysis, reverse engineering, malware detection, vulnerability assessment, automatic static and dynamic analysis, and exploitation and mitigation techniques.\nBesides the slides for the course, there are also multiple challenges covering mobile app development, reversing and exploitation.\n\n- [MOBISEC2018](https://mobisec.reyammer.io/)\n\n## Open Security Training\nOpenSecurityTraining.info is dedicated to sharing training material for computer security classes, on any topic, that are at least one day long.\n\n#### Beginner Classes\n\n- [Android Forensics & Security Testing](http://opensecuritytraining.info/AndroidForensics.html)<br>\nThis class serves as a foundation for mobile digital forensics, forensics of Android operating systems, and penetration testing of Android applications.\n\n- [Certified Information Systems Security Professional (CISSP)® <br>Common Body of Knowledge (CBK)® Review](http://opensecuritytraining.info/CISSP-Main.html)<br>\nThe CISSP CBK Review course is uniquely designed for federal agency information assurance (IA) professionals in meeting [NSTISSI-4011](http://www.cnss.gov/Assets/pdf/nstissi_4011.pdf), National Training Standard for Information Systems Security Professionals, as required by [DoD 8570.01-M](http://www.dtic.mil/whs/directives/corres/pdf/857001m.pdf), Information Assurance Workforce Improvement Program.\n\n- [Flow Analysis & Network Hunting](http://opensecuritytraining.info/Flow.html)<br>\nThis course focuses on network analysis and hunting of malicious activity from a security operations center perspective. We will dive into the netflow strengths, operational limitations of netflow, recommended sensor placement, netflow tools, visualization of network data, analytic trade craft for network situational awareness and networking hunting scenarios.\n\n- [Hacking Techniques and Intrusion Detection](http://opensecuritytraining.info/HTID.html)<br>\nThe course is designed to help students gain a detailed insight into the practical and theoretical aspects of advanced topics in hacking techniques and intrusion detection.\n\n- [Introductory Intel x86: Architecture, Assembly, Applications, & Alliteration](http://opensecuritytraining.info/IntroX86.html)<br>\nThis class serves as a foundation for the follow on Intermediate level x86 class. It teaches the basic concepts and describes the hardware that assembly code deals with. It also goes over many of the most common assembly instructions. Although x86 has hundreds of special purpose instructions, students will be shown it is possible to read most programs by knowing only around 20-30 instructions and their variations.\n\n- [Introductory Intel x86-64: Architecture, Assembly, Applications, & Alliteration](http://opensecuritytraining.info/IntroX86-64.html)<br>\nThis class serves as a foundation for the follow on Intermediate level x86 class. It teaches the basic concepts and describes the hardware that assembly code deals with. It also goes over many of the most common assembly instructions. Although x86 has hundreds of special purpose instructions, students will be shown it is possible to read most programs by knowing only around 20-30 instructions and their variations.\n\n- [Introduction to ARM](http://opensecuritytraining.info/IntroARM.html)<br>\nThis class builds on the Intro to x86 class and tries to provide parallels and differences between the two processor architectures wherever possible while focusing on the ARM instruction set, some of the ARM processor features, and how software works and runs on the ARM processor.\n\n- [Introduction to Cellular Security](http://opensecuritytraining.info/IntroCellSec.html)<br>\nThis course is intended to demonstrate the core concepts of cellular network security. Although the course discusses GSM, UMTS, and LTE - it is heavily focused on LTE. The course first introduces important cellular concepts and then follows the evolution of GSM to LTE.\n\n- [Introduction to Network Forensics](http://opensecuritytraining.info/NetworkForensics.html)<br>\nThis is a mainly lecture based class giving an introduction to common network monitoring and forensic techniques.\n\n- [Introduction to Secure Coding](http://opensecuritytraining.info/IntroSecureCoding.html)<br>\nThis course provides a look at some of the most prevalent security related coding mistakes made in industry today.  Each type of issue is explained in depth including how a malicious user may attack the code, and strategies for avoiding the issues are then reviewed.\n\n- [Introduction to Vulnerability Assessment](http://opensecuritytraining.info/IntroductionToVulnerabilityAssessment.html)<br>\nThis is a lecture and lab based class giving an introduction to vulnerability assessment of some common common computing technologies.  Instructor-led lab exercises are used to demonstrate specific tools and technologies.\n\n- [Introduction to Trusted Computing](http://opensecuritytraining.info/IntroToTrustedComputing.html)<br>\nThis course is an introduction to the fundamental technologies behind Trusted Computing. You will learn what Trusted Platform Modules (TPMs) are and what capabilities they can provide both at an in-depth technical level and in an enterprise context. You will also learn about how other technologies such as the Dynamic Root of Trust for Measurement (DRTM) and virtualization can both take advantage of TPMs and be used to enhance the TPM's capabilities.\n\n- [Offensive, Defensive, and Forensic Techniques for Determining Web User Identity](http://opensecuritytraining.info/WebIdentity.html)<br>\nThis course looks at web users from a few different perspectives.  First, we look at identifying techniques to determine web user identities from a server perspective.  Second, we will look at obfuscating techniques from a user whom seeks to be anonymous.  Finally, we look at forensic techniques, which, when given a hard drive or similar media, we identify users who accessed that server.\n\n- [Pcap Analysis & Network Hunting](http://opensecuritytraining.info/Pcap.html)<br>\nIntroduction to Packet Capture (PCAP) explains the fundamentals of how, where, and why to capture network traffic and what to do with it.  This class covers open-source tools like tcpdump, Wireshark, and ChopShop in several lab exercises that reinforce the material.  Some of the topics include capturing packets with tcpdump, mining DNS resolutions using only command-line tools, and busting obfuscated protocols.  This class will prepare students to tackle common problems and help them begin developing the skills to handle more advanced networking challenges.\n\n- [Malware Dynamic Analysis](http://opensecuritytraining.info/MalwareDynamicAnalysis.html)<br>\nThis introductory malware dynamic analysis class is dedicated to people who are starting to work on malware analysis or who want to know what kinds of artifacts left by malware can be detected via various tools. The class will be a hands-on class where students can use various tools to look for how malware is: Persisting, Communicating, and Hiding\n\n- [Secure Code Review](http://opensecuritytraining.info/SecureCodeReview.html)<br>\nThe course briefly talks about the development lifecycle and the importance of peer reviews in delivering a quality product. How to perform this review is discussed and how to keep secure coding a priority during the review is stressed. A variety of hands-on exercises will address common coding mistakes, what to focus on during a review, and how to manage limited time.\n\n- [Smart Cards](http://opensecuritytraining.info/SmartCards.html)<br>\nThis course shows how smart cards are different compared to other type of cards.\nIt is explained how smart cards can be used to realize confidentiality and integrity of information.\n\n- [The Life of Binaries](http://opensecuritytraining.info/LifeOfBinaries.html)<br>\nAlong the way we discuss the relevance of security at different stages of a binary’s life, from the tricks that can be played by a malicious compiler, to how viruses really work, to the way which malware “packers” duplicate OS process execution functionality, to the benefit of a security-enhanced OS loader which implements address space layout randomization (ASLR).\n\n- [Understanding Cryptology: Core Concepts](http://opensecuritytraining.info/CryptoCore.html)<br>\nThis is an introduction to cryptology with a focus on applied cryptology. It was designed to be accessible to a wide audience, and therefore does not include a rigorous mathematical foundation (this will be covered in later classes).\n\n- [Understanding Cryptology: Cryptanalysis](http://opensecuritytraining.info/Cryptanalysis.html)<br>\nA class for those who want to stop learning about building cryptographic systems and want to attack them. This course is a mixture of lecture designed to introduce students to a variety of code-breaking techniques and python labs to solidify those concepts. Unlike its sister class, [Core Concepts](http://opensecuritytraining.info/CryptoCore.html), math is necessary for this topic.\n\n#### Intermediate Classes\n\n- [Exploits 1: Introduction to Software Exploits](http://opensecuritytraining.info/Exploits1.html)<br>\nSoftware vulnerabilities are flaws in program logic that can be leveraged by an attacker to execute arbitrary code on a target system. This class will cover both the identification of software vulnerabilities and the techniques attackers use to exploit them. In addition, current techniques that attempt to remediate the threat of software vulnerability exploitation will be discussed.\n\n- [Exploits 2: Exploitation in the Windows Environment](http://opensecuritytraining.info/Exploits2.html)<br>\nThis course covers the exploitation of stack corruption vulnerabilities in the Windows environment. Stack overflows are programming flaws that often times allow an attacker to execute arbitrary code in the context of a vulnerable program. There are many nuances involved with exploiting these vulnerabilities in Windows. Window's exploit mitigations such as DEP, ASLR, SafeSEH, and SEHOP, makes leveraging these programming bugs more difficult, but not impossible. The course highlights the features and weaknesses of many the exploit mitigation techniques deployed in Windows operating systems. Also covered are labs that describe the process of finding bugs in Windows applications with mutation based fuzzing, and then developing exploits that target those bugs.\n\n- [Intermediate Intel x86: Architecture, Assembly, Applications, & Alliteration](http://opensecuritytraining.info/IntermediateX86.html)<br>\nBuilding upon the Introductory Intel x86 class, this class goes into more depth on topics already learned, and introduces more advanced topics that dive deeper into how Intel-based systems work.\n\n#### Advanced Classes\n\n- [Advanced x86: Virtualization with Intel VT-x](http://opensecuritytraining.info/AdvancedX86-VTX.html)<br>\nThe purpose of this course is to provide a hands on introduction to Intel hardware support for virtualization. The first part will motivate the challenges of virtualization in the absence of dedicated hardware. This is followed by a deep dive on the Intel virtualization \"API\" and labs to begin implementing a blue pill / hyperjacking attack made famous by researchers like Joanna Rutkowska and Dino Dai Zovi et al. Finally a discussion of virtualization detection techniques.\n\n- [Advanced x86: Introduction to BIOS & SMM](http://opensecuritytraining.info/IntroBIOS.html)<br>\nWe will cover why the BIOS is critical to the security of the platform. This course will also show you what capabilities and opportunities are provided to an attacker when BIOSes are not properly secured. We will also provide you tools for performing vulnerability analysis on firmware, as well as firmware forensics. This class will take people with existing reverse engineering skills and teach them to analyze UEFI firmware. This can be used either for vulnerability hunting, or to analyze suspected implants found in a BIOS, without having to rely on anyone else.\n\n- [Introduction to Reverse Engineering Software](http://opensecuritytraining.info/IntroductionToReverseEngineering.html)<br>\nThroughout the history of invention curious minds have sought to understand the inner workings of their gadgets. Whether investigating a broken watch, or improving an engine, these people have broken down their goods into their elemental parts to understand how they work. This is Reverse Engineering (RE), and it is done every day from recreating outdated and incompatible software, understanding malicious code, or exploiting weaknesses in software.\n\n- [Reverse Engineering Malware](http://opensecuritytraining.info/ReverseEngineeringMalware.html)<br>\nThis class picks up where the [Introduction to Reverse Engineering Software](http://opensecuritytraining.info/IntroductionToReverseEngineering.html) course left off, exploring how static reverse engineering techniques can be used to understand what a piece of malware does and how it can be removed.\n\n- [Rootkits: What they are, and how to find them](http://opensecuritytraining.info/Rootkits.html)<br>\nRootkits are a class of malware which are dedicated to hiding the attacker’s presence on a compromised system. This class will focus on understanding how rootkits work, and what tools can be used to help find them.\n\n- [The Adventures of a Keystroke: An in-depth look into keylogging on Windows](http://opensecuritytraining.info/Keylogging.html)<br>\nKeyloggers are one of the most widely used components in malware. Keyboard and mouse are the devices nearly all of the PCs are controlled by, this makes them an important target of malware authors. If someone can record your keystrokes then he can control your whole PC without you noticing.\n\n\n\n## Cybrary - Online Cyber Security Training\n\n- [CompTIA A+](https://www.cybrary.it/course/comptia-aplus)<br>\nThis course covers the fundamentals of computer technology, basic networking, installation and configuration of PCs, laptops and related hardware, as well as configuring common features for mobile operation systems Android and Apple iOS.\n\n- [CompTIA Linux+](https://www.cybrary.it/course/comptia-linux-plus)<br>\nOur free, self-paced online Linux+ training prepares students with the knowledge to become a certified Linux+ expert, spanning a curriculum that covers Linux maintenance tasks, user assistance and installation and configuration.\n\n- [CompTIA Cloud+](https://www.cybrary.it/course/comptia-cloud-plus)<br>\nOur free, online Cloud+ training addresses the essential knowledge for implementing, managing and maintaining cloud technologies as securely as possible. It covers cloud concepts and models, virtualization, and infrastructure in the cloud.\n\n- [CompTIA Network+](https://www.cybrary.it/course/comptia-network-plus)<br>\nIn addition to building one’s networking skill set, this course is also designed to prepare an individual for the Network+ certification exam, a distinction that can open a myriad of job opportunities from major companies\n\n- [CompTIA Advanced Security Practitioner](https://www.cybrary.it/course/comptia-casp)<br>\nIn our free online CompTIA CASP training, you’ll learn how to integrate advanced authentication, how to manage risk in the enterprise, how to conduct vulnerability assessments and how to analyze network security concepts and components.\n\n- [CompTIA Security+](https://www.cybrary.it/course/comptia-security-plus)<br>\nLearn about general security concepts, basics of cryptography, communications security and operational and organizational security. With the increase of major security breaches that are occurring, security experts are needed now more than ever.\n\n- [ITIL Foundation](https://www.cybrary.it/course/itil)<br>\nOur online ITIL Foundation training course provides baseline knowledge for IT service management best practices: how to reduce costs, increase enhancements in processes, improve IT productivity and overall customer satisfaction.\n\n- [Cryptography](https://www.cybrary.it/course/cryptography)<br>\nIn this online course we will be examining how cryptography is the cornerstone of security technologies, and how through its use of different encryption methods you can protect private or sensitive information from unauthorized access.\n\n- [Cisco CCNA](https://www.cybrary.it/course/cisco-ccna)<br>\nOur free, online, self-paced CCNA training teaches students to install, configure, troubleshoot and operate LAN, WAN and dial access services for medium-sized networks. You’ll also learn how to describe the operation of data networks.\n\n- [Virtualization Management](https://www.cybrary.it/course/virtualization-management)<br>\nOur free, self-paced online Virtualization Management training class focuses on installing, configuring and managing virtualization software. You’ll learn how to work your way around the cloud and how to build the infrastructure for it.\n\n- [Penetration Testing and Ethical Hacking](https://www.cybrary.it/course/ethical-hacking)<br>\nIf the idea of hacking as a career excites you, you’ll benefit greatly from completing this training here on Cybrary. You’ll learn how to exploit networks in the manner of an attacker, in order to find out how protect the system from them.\n\n- [Computer and Hacking Forensics](https://www.cybrary.it/course/computer-hacking-forensics-analyst)<br>\nLove the idea of digital forensics investigation? That’s what computer forensics is all about. You’ll learn how to; determine potential online criminal activity at its inception, legally gather evidence, search and investigate wireless attacks.\n\n- [Web Application Penetration Testing](https://www.cybrary.it/course/web-application-pen-testing)<br>\nIn this course, SME, Raymond Evans, takes you on a wild and fascinating journey into the cyber security discipline of web application pentesting. This is a very hands-on course that will require you to set up your own pentesting environment.\n\n- [CISA - Certified Information Systems Auditor](https://www.cybrary.it/course/cisa)<br>\nIn order to face the dynamic requirements of meeting enterprise vulnerability management challenges, this course covers the auditing process to ensure that you have the ability to analyze the state of your organization and make changes where needed.\n\n- [Secure Coding](https://www.cybrary.it/course/secure-coding)<br>\nJoin industry leader Sunny Wear as she discusses secure coding guidelines and how secure coding is important when it comes to lowering risk and vulnerabilities. Learn about XSS, Direct Object Reference, Data Exposure, Buffer Overflows, & Resource Management.\n\n- [NIST 800-171 Controlled Unclassified Information Course](https://www.cybrary.it/course/nist-800-171-controlled-unclassified-information-course)<br>\nThe Cybrary NIST 800-171 course covers the 14 domains of safeguarding controlled unclassified information in non-federal agencies. Basic and derived requirements are presented for each security domain as defined in the NIST 800-171 special publication.\n\n- [Advanced Penetration Testing](https://www.cybrary.it/course/advanced-penetration-testing)<br>\nThis course covers how to attack from the web using cross-site scripting, SQL injection attacks, remote and local file inclusion and how to understand the defender of the network you’re breaking into to. You’ll also learn tricks for exploiting a network.\n\n- [Intro to Malware Analysis and Reverse Engineering](https://www.cybrary.it/course/malware-analysis)<br>\nIn this course you’ll learn how to perform dynamic and static analysis on all major files types, how to carve malicious executables from documents and how to recognize common malware tactics and debug and disassemble malicious binaries.\n\n- [Social Engineering and Manipulation](https://www.cybrary.it/course/social-engineering)<br>\nIn this online, self-paced Social Engineering and Manipulation training class, you will learn how some of the most elegant social engineering attacks take place. Learn to perform these scenarios and what is done during each step of the attack.\n\n- [Post Exploitation Hacking](https://www.cybrary.it/course/post-exploitation-hacking)<br>\nIn this free self-paced online training course, you’ll cover three main topics: Information Gathering, Backdooring and Covering Steps, how to use system specific tools to get general information, listener shells, metasploit and meterpreter scripting.\n\n- [Python for Security Professionals](https://www.cybrary.it/course/python)<br>\nThis course will take you from basic concepts to advanced scripts in just over 10 hours of material, with a focus on networking and security.\n\n- [Metasploit](https://www.cybrary.it/course/metasploit)<br>\nThis free Metasploit training class will teach you to utilize the deep capabilities of Metasploit for penetration testing and help you to prepare to run vulnerability assessments for organizations of any size.\n\n- [ISC2 CCSP - Certified Cloud Security Professional](https://www.cybrary.it/course/isc2-certified-cloud-security-professional-ccsp)<br>\nThe reality is that attackers never rest, and along with the traditional threats targeting internal networks and systems, an entirely new variety specifically targeting the cloud has emerged.\n\n**Executive**\n\n- [CISSP - Certified Information Systems Security Professional](https://www.cybrary.it/course/cissp)<br>\nOur free online CISSP (8 domains) training covers topics ranging from operations security, telecommunications, network and internet security, access control systems and methodology and business continuity planning.\n\n- [CISM - Certified Information Security Manager](https://www.cybrary.it/course/cism)<br>\nCybrary’s Certified Information Security Manager (CISM) course is a great fit for IT professionals looking to move up in their organization and advance their careers and/or current CISMs looking to learn about the latest trends in the IT industry.\n\n- [PMP - Project Management Professional](https://www.cybrary.it/course/project-management-professional)<br>\nOur free online PMP training course educates on how to initiate, plan and manage a project, as well as the process behind analyzing risk, monitoring and controlling project contracts and how to develop schedules and budgets.\n\n- [CRISC - Certified in Risk and Information Systems Control](https://www.cybrary.it/course/crisc)<br>\nCertified in Risk and Information Systems Control is for IT and business professionals who develop and maintain information system controls, and whose job revolves around security operations and compliance.\n\n- [Risk Management Framework](https://www.cybrary.it/course/risk-management-framework)<br>\nThe National Institute of Standards and Technology (NIST) established the Risk Management Framework (RMF) as a set of operational and procedural standards or guidelines that a US government agency must follow to ensure the compliance of its data systems.\n\n- [ISC2 CSSLP - Certified Secure Software Life-cycle Professional](https://www.cybrary.it/course/csslp-training)<br>\nThis course helps professionals in the industry build their credentials to advance within their organization, allowing them to learn valuable managerial skills as well as how to apply the best practices to keep organizations systems running well.\n\n- [COBIT - Control Objectives for Information and Related Technologies](https://www.cybrary.it/course/cobit)<br>\nCybrary’s online COBIT certification program offers an opportunity to learn about all the components of the COBIT 5 framework, covering everything from the business end-to-end to strategies in how effectively managing and governing enterprise IT.\n\n- [Corporate Cybersecurity Management](https://www.cybrary.it/course/corporate-cybersecurity-management)<br>\nCyber risk, legal considerations and insurance are often overlooked by businesses and this sets them up for major financial devastation should an incident occur.\n\n## Roppers Academy\nRoppers is a community dedicated to providing free training to beginners so that they have the best introduction to the field possible and have the knowledge, skills, and confidence required to figure out what the next ten thousand hours will require them to learn.\n\n- [Introduction to Computing Fundamentals](https://hoppersroppers.org/course.html)<br>\nA free, self-paced curriculum designed to give a beginner all of the foundational knowledge and skills required to be successful. It teaches security fundamentals along with building a strong technical foundation that students will build on for years to come. Full text available as a [gitbook](https://www.hoppersroppers.org/fundamentals/). **Learning Objectives:** Linux, Hardware, Networking, Operating Systems, Power User, Scripting **Pre-Reqs:** None \n\n- [Introduction to Capture the Flags](https://hoppersroppers.github.io/courseCTF.html)<br>\nFree course designed to teach the fundamentals required to be successful in Capture the Flag competitions and compete in the picoCTF event. Our mentors will track your progress and provide assistance every step of the way. Full text available as a [gitbook](https://www.hoppersroppers.org/ctf/). **Learning Objectives:** CTFs, Forensics, Cryptography, Web-Exploitation **Pre-Reqs:** Linux, Scripting\n\n- [Introduction to Security](https://hoppersroppers.github.io/courseSecurity.html)<br>\nFree course designed to teach students security theory and have them execute defensive measures so that they are better prepared against threats online and in the physical world. Full text available as a [gitbook](https://www.hoppersroppers.org/security/). **Learning Objectives:** Security Theory, Practical Application, Real-World Examples **Pre-Reqs:** None\n\nLaboratories\n============\n\n## Syracuse University's SEED\n\n### Hands-on Labs for Security Education\n\n Started in 2002, funded by a total of 1.3 million dollars from NSF, and now used by hundreds of educational institutes worldwide, the SEED project's objective is to develop hands-on laboratory exercises (called SEED labs) for computer and information security education and help instructors adopt these labs in their curricula.\n\n### Software Security Labs\nThese labs cover some of the most common vulnerabilities in general software. The labs show students how attacks work in exploiting these vulnerabilities.\n\n- [Buffer-Overflow Vulnerability Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/Software/Buffer_Overflow)<br>\nLaunching attack to exploit the buffer-overflow vulnerability using shellcode. Conducting experiments with several countermeasures.\n\n- [Return-to-libc Attack Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/Software/Return_to_libc)<br>\nUsing the return-to-libc technique to defeat the \"non-executable stack\" countermeasure of the buffer-overflow attack.\n\n- [Environment Variable and Set-UID Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/Software/Environment_Variable_and_SetUID)<br>\nThis is a redesign of the Set-UID lab (see below).\n\n\n- [Set-UID Program Vulnerability Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/Software/Set-UID)<br>\nLaunching attacks on privileged Set-UID root program. Risks of environment variables. Side effects of system().\n\n- [Race-Condition Vulnerability Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/Software/Race_Condition)<br>\nExploiting the race condition vulnerability in privileged program. Conducting experiments with various countermeasures.\n\n- [Format-String Vulnerability Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/Software/Format_String)<br>\nExploiting the format string vulnerability to crash a program, steal sensitive information, or modify critical data.\n\n- [Shellshock Attack Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/Software/Shellshock)<br>\nLaunch attack to exploit the Shellshock vulnerability that is discovered in late 2014.\n\n\n### Network Security Labs\n These labs cover topics on network security, ranging from attacks on TCP/IP and DNS to various network security technologies (Firewall, VPN, and IPSec).\n\n- [TCP/IP Attack Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/Networking/TCPIP)<br>\nLaunching attacks to exploit the vulnerabilities of the TCP/IP protocol, including session hijacking, SYN flooding, TCP reset attacks, etc.\n\n- [Heartbleed Attack Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/Networking/Heartbleed)<br>\nUsing the heartbleed attack to steal secrets from a remote server.\n\n- [Local DNS Attack Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/Networking/DNS_Local)<br>\nUsing several methods to conduct DNS pharming attacks on computers in a LAN environment.\n\n- [Remote DNS Attack Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/Networking/DNS_Remote)<br>\nUsing the Kaminsky method to launch DNS cache poisoning attacks on remote DNS servers.\n\n- [Packet Sniffing and Spoofing Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/Networking/Sniffing_Spoofing)<br>\nWriting programs to sniff packets sent over the local network; writing programs to spoof various types of packets.\n\n- [Linux Firewall Exploration Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/Networking/Firewall_Linux)<br>\nWriting a simple packet-filter firewall; playing with Linux's built-in firewall software and web-proxy firewall; experimenting with ways to evade firewalls.\n\n- [Firewall-VPN Lab: Bypassing Firewalls using VPN](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/Networking/Firewall_VPN)<br>\nImplement a simple vpn program (client/server), and use it to bypass firewalls.\n\n- [Virtual Private Network (VPN) Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/Networking/VPN)<br>\nDesign and implement a transport-layer VPN system for Linux, using the TUN/TAP technologies. This project requires at least a month of time to finish, so it is good for final project.\n\n- [Minix IPSec Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/Networking/IPSec)<br>\nImplement the IPSec protocol in the Minix operating system and use it to set up Virtual Private Networks.\n\n- [Minix Firewall Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/Networking/Firewall_Minix)<br>\nImplementing a simple firewall in Minix operating system.\n\n\n### Web Security Labs\n These labs cover some of the most common vulnerabilities in web applications. The labs show students how attacks work in exploiting these vulnerabilities.\n\n#### Elgg-Based Labs\nElgg is an open-source social-network system. We have modified it for our labs.\n\n- [Cross-Site Scripting Attack Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/Web/Web_XSS_Elgg)<br>\nLaunching the cross-site scripting attack on a vulnerable web application. Conducting experiments with several countermeasures.\n\n- [Cross-Site Request Forgery Attack Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/Web/Web_CSRF_Elgg)<br>\nLaunching the cross-site request forgery attack on a vulnerable web application. Conducting experiments with several countermeasures.\n\n- [Web Tracking Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/Web/Web_Tracking_Elgg)<br>\nExperimenting with the web tracking technology to see how users can be checked when they browse the web.\n\n- [SQL Injection Attack Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/Web/Web_SQL_Injection)<br>\nLaunching the SQL-injection attack on a vulnerable web application. Conducting experiments with several countermeasures.\n\n#### Collabtive-Based Labs\nCollabtive is an open-source web-based project management system. We have modified it for our labs.\n\n- [Cross-site Scripting Attack Lab](http://www.cis.syr.edu/~wedu/seed/Labs/Web/XSS_Collabtive)<br>\nLaunching the cross-site scripting attack on a vulnerable web application. Conducting experiments with several countermeasures.\n\n- [Cross-site Request Forgery Attack Lab](http://www.cis.syr.edu/~wedu/seed/Labs/Web/CSRF_Collabtive)<br>\nLaunching the cross-site request forgery attack on a vulnerable web application. Conducting experiments with several countermeasures.\n\n- [SQL Injection Lab](http://www.cis.syr.edu/~wedu/seed/Labs/Web/SQL_Injection_Collabtive)<br>\nLaunching the SQL-injection attack on a vulnerable web application. Conducting experiments with several countermeasures.\n\n- [Web Browser Access Control Lab](http://www.cis.syr.edu/~wedu/seed/Labs/Web/Web_SOP_Collabtive)<br>\nExploring browser's access control system to understand its security policies.\n\n#### PhpBB-Based Labs\nPhpBB is an open-source web-based message board system, allowing users to post messages. We have modified it for our labs.\n\n- [Cross-site Scripting Attack Lab](http://www.cis.syr.edu/~wedu/seed/Labs/Attacks_XSS)<br>\nLaunching the cross-site scripting attack on a vulnerable web application. Conducting experiments with several countermeasures.\n\n- [Cross-site Request Forgery Attack Lab](http://www.cis.syr.edu/~wedu/seed/Labs/Attacks_CSRF)<br>\nLaunching the cross-site request forgery attack on a vulnerable web application. Conducting experiments with several countermeasures.\n\n- [SQL Injection Lab](http://www.cis.syr.edu/~wedu/seed/Labs/Attacks_SQL_Injection)<br>\nLaunching the SQL-injection attack on a vulnerable web application. Conducting experiments with several countermeasures.\n\n- [ClickJacking Attack Lab](http://www.cis.syr.edu/~wedu/seed/Labs/Vulnerability/ClickJacking)<br>\nLaunching the ClickJacking attack on a vulnerable web site. Conducting experiments with several countermeasures.\n\n### System Security Labs\nThese labs cover the security mechanisms in operating system, mostly focusing on access control mechanisms in Linux.\n\n- [Linux Capability Exploration Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/System/Capability_Exploration)<br>\nExploring the POSIX 1.e capability system in Linux to see how privileges can be divided into smaller pieces to ensure the compliance with the Least Privilege principle.\n\n- [Role-Based Access Control (RBAC) Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/System/RBAC_Cap)<br>\nDesigning and implementing an integrated access control system for Minix that uses both capability-based and role-based access control mechanisms. Students need to modify the Minix kernel.\n\n- [Encrypted File System Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/System/EFS)<br>\nDesigning and implementing an encrypted file system for Minix. Students need to modify the Minix kernel.\n\n### Cryptography Labs\nThese labs cover three essential concepts in cryptography, including secrete-key encryption, one-way hash function, and public-key encryption and PKI.\n\n- [Secret Key Encryption Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/Crypto/Crypto_Encryption)<br>\nExploring the secret-key encryption and its applications using OpenSSL.\n\n- [One-Way Hash Function Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/Crypto/Crypto_Hash)<br>\nExploring one-way hash function and its applications using OpenSSL.\n\n- [Public-Key Cryptography and PKI Lab](http://www.cis.syr.edu/~wedu/seed/Labs_12.04/Crypto/Crypto_PublicKey)<br>\nExploring public-key cryptography, digital signature, certificate, and PKI using OpenSSL.\n\n### Mobile Security Labs\nThese labs focus on the smartphone security, covering the most common vulnerabilities and attacks on mobile devices. An Android VM is provided for these labs.\n\n- [Android Repackaging Lab](http://www.cis.syr.edu/~wedu/seed/Labs_Android5.1/Android_Repackaging)<br>\nInsert malicious code inside an existing Android app, and repackage it.\n\n- [Android Device Rooting Lab](http://www.cis.syr.edu/~wedu/seed/Labs_Android5.1/Android_Rooting)<br>\nDevelop an OTA (Over-The-Air) package from scratch to root an Android device.\n\n## Pentester Lab\nThere is only one way to properly learn web penetration testing: by getting your hands dirty. We teach how to manually find and exploit vulnerabilities. You will understand the root cause of the problems and the methods that can be used to exploit them. Our exercises are based on common vulnerabilities found in different systems. The issues are not emulated. We provide you real systems with real vulnerabilities.\n\n- [From SQL Injection to Shell](https://pentesterlab.com/exercises/from_sqli_to_shell)<br>\nThis exercise explains how you can, from a SQL injection, gain access to the administration console. Then in the administration console, how you can run commands on the system.\n\n- [From SQL Injection to Shell II](https://pentesterlab.com/exercises/from_sqli_to_shell_II)<br>\nThis exercise explains how you can, from a blind SQL injection, gain access to the administration console. Then in the administration console, how you can run commands on the system.\n\n- [From SQL Injection to Shell: PostgreSQL edition](https://pentesterlab.com/exercises/from_sqli_to_shell_pg_edition)<br>\nThis exercise explains how you can from a SQL injection gain access to the administration console. Then in the administration console, how you can run commands on the system.\n\n- [Web for Pentester](https://pentesterlab.com/exercises/web_for_pentester)<br>\nThis exercise is a set of the most common web vulnerabilities.\n\n- [Web for Pentester II](https://pentesterlab.com/exercises/web_for_pentester_II)<br>\nThis exercise is a set of the most common web vulnerabilities.\n\n- [PHP Include And Post Exploitation](https://pentesterlab.com/exercises/php_include_and_post_exploitation)<br>\nThis exercice describes the exploitation of a local file include with limited access. Once code execution is gained, you will see some post exploitation tricks.\n\n- [Linux Host Review](https://pentesterlab.com/exercises/linux_host_review)<br>\nThis exercice explains how to perform a Linux host review, what and how you can check the configuration of a Linux server to ensure it is securely configured. The reviewed system is a traditional Linux-Apache-Mysql-PHP (LAMP) server used to host a blog.\n\n- [Electronic Code Book](https://pentesterlab.com/exercises/ecb)<br>\nThis exercise explains how you can tamper with an encrypted cookies to access another user's account.\n\n- [Rack Cookies and Commands injection](https://pentesterlab.com/exercises/rack_cookies_and_commands_injection)<br>\nAfter a short brute force introduction, this exercice explains the tampering of rack cookie and how you can even manage to modify a signed cookie (if the secret is trivial). Using this issue, you will be able to escalate your privileges and gain commands execution.\n\n- [Padding Oracle](https://pentesterlab.com/exercises/padding_oracle)<br>\nThis course details the exploitation of a weakness in the authentication of a PHP website. The website uses Cipher Block Chaining (CBC) to encrypt information provided by users and use this information to ensure authentication. The application also leaks if the padding is valid when decrypting the information. We will see how this behavior can impact the authentication and how it can be exploited.\n\n- [XSS and MySQL FILE](https://pentesterlab.com/exercises/xss_and_mysql_file)<br>\nThis exercise explains how you can use a Cross-Site Scripting vulnerability to get access to an administrator's cookies. Then how you can use his/her session to gain access to the administration to find a SQL injection and gain code execution using it.\n\n- [Axis2 Web service and Tomcat Manager](https://pentesterlab.com/exercises/axis2_and_tomcat_manager)<br>\nThis exercice explains the interactions between Tomcat and Apache, then it will show you how to call and attack an Axis2 Web service. Using information retrieved from this attack, you will be able to gain access to the Tomcat Manager and deploy a WebShell to gain commands execution.\n\n- [Play Session Injection](https://pentesterlab.com/exercises/play_session_injection)<br>\nThis exercise covers the exploitation of a session injection in the Play framework. This issue can be used to tamper with the content of the session while bypassing the signing mechanism.\n\n- [Play XML Entities](https://pentesterlab.com/exercises/play_xxe)<br>\nThis exercise covers the exploitation of a XML entities in the Play framework.\n\n- [CVE-2007-1860: mod_jk double-decoding](https://pentesterlab.com/exercises/cve-2007-1860)<br>\nThis exercise covers the exploitation of CVE-2007-1860. This vulnerability allows an attacker to gain access to unaccessible pages using crafted requests. This is a common trick that a lot of testers miss.\n\n- [CVE-2008-1930: Wordpress 2.5 Cookie Integrity Protection Vulnerability](https://pentesterlab.com/exercises/cve-2008-1930)<br>\nThis exercise explains how you can exploit CVE-2008-1930 to gain access to the administration interface of a Wordpress installation.\n\n- [CVE-2012-1823: PHP CGI](https://pentesterlab.com/exercises/cve-2012-1823)<br>\nThis exercise explains how you can exploit CVE-2012-1823 to retrieve the source code of an application and gain code execution.\n\n- [CVE-2012-2661: ActiveRecord SQL injection](https://pentesterlab.com/exercises/cve-2012-2661)<br>\nThis exercise explains how you can exploit CVE-2012-2661 to retrieve information from a database.\n\n- [CVE-2012-6081: MoinMoin code execution](https://pentesterlab.com/exercises/cve-2012-6081)<br>\nThis exercise explains how you can exploit CVE-2012-6081 to gain code execution. This vulnerability was exploited to compromise Debian's wiki and Python documentation website.\n\n- [CVE-2014-6271/Shellshock](https://pentesterlab.com/exercises/cve-2014-6271)<br>\nThis exercise covers the exploitation of a Bash vulnerability through a CGI.\n\n## Dr. Thorsten Schneider's Binary Auditing\nLearn the fundamentals of Binary Auditing. Know how HLL mapping works, get more inner file understanding than ever. Learn how to find and analyse software vulnerability. Dig inside Buffer Overflows and learn how exploits can be prevented. Start to analyse your first viruses and malware the safe way. Learn about simple tricks and how viruses look like using real life examples.\n\n- [Binary Auditing](http://www.binary-auditing.com/)\n\n## Damn Vulnerable Web Application (DVWA)\nDamn Vulnerable Web Application (DVWA) is a PHP/MySQL web application that is damn vulnerable. Its main goal is to be an aid for security professionals to test their skills and tools in a legal environment, help web developers better understand the processes of securing web applications and to aid both students & teachers to learn about web application security in a controlled class room environment.\n\n- [Damn Vulnerable Web Application (DVWA)](https://github.com/ethicalhack3r/DVWA)\n\n## Damn Vulnerable Web Services\nDamn Vulnerable Web Services is an insecure web application with multiple vulnerable web service components that can be used to learn real world web service vulnerabilities. The aim of this project is to help security professionals learn about Web Application Security through the use of a practical lab environment.\n\n- [Damn Vulnerable Web Services](https://github.com/snoopysecurity/dvws)\n\n##  NOWASP (Mutillidae)\nOWASP Mutillidae II is a free, open source, deliberately vulnerable web-application providing a target for web-security enthusiest. With dozens of vulns and hints to help the user; this is an easy-to-use web hacking environment designed for labs, security enthusiast, classrooms, CTF, and vulnerability assessment tool targets. Mutillidae has been used in graduate security courses, corporate web sec training courses, and as an \"assess the assessor\" target for vulnerability assessment software.\n\n- [OWASP Mutillidae](http://sourceforge.net/projects/mutillidae/files/)\n\n##  OWASP Broken Web Applications Project\nOpen Web Application Security Project (OWASP) Broken Web Applications Project, a collection of vulnerable web applications that is distributed on a Virtual Machine in VMware format compatible with their no-cost and commercial VMware products.\n\n- [OWASP Broken Web Applications Project](https://sourceforge.net/projects/owaspbwa/files/1.2/)\n\n## OWASP Bricks\nBricks is a web application security learning platform built on PHP and MySQL. The project focuses on variations of commonly seen application security issues. Each 'Brick' has some sort of security issue which can be leveraged manually or using automated software tools. The mission is to 'Break the Bricks' and thus learn the various aspects of web application security.\n\n- [OWASP Bricks](http://sechow.com/bricks/download.html)\n\n## OWASP Hackademic Challenges Project\nThe Hackademic Challenges implement realistic scenarios with known vulnerabilities in a safe and controllable environment. Users can attempt to discover and exploit these vulnerabilities in order to learn important concepts of information security through an attacker's perspective.\n\n- [OWASP Hackademic Challenges project](https://github.com/Hackademic/hackademic/)\n\n## Web Attack and Exploitation Distro (WAED)\nThe Web Attack and Exploitation Distro (WAED) is a lightweight virtual machine based on Debian Distribution. WAED is pre-configured with various real-world vulnerable web applications in a sandboxed environment. It includes pentesting tools that aid in finding web application vulnerabilities. The main motivation behind this project is to provide a practical environment to learn about web application's vulnerabilities without the hassle of dealing with complex configurations. Currently, there are around 18 vulnerable applications installed in WAED.\n\n- [Web Attack and Exploitation Distro (WAED)](http://www.waed.info/)\n\n## Xtreme Vulnerable Web Application (XVWA)\nXVWA is a badly coded web application written in PHP/MySQL that helps security enthusiasts to learn application security. It’s not advisable to host this application online as it is designed to be “Xtremely Vulnerable”. We recommend hosting this application in local/controlled environment and sharpening your application security ninja skills with any tools of your own choice. It’s totally legal to break or hack into this. The idea is to evangelize web application security to the community in possibly the easiest and fundamental way. Learn and acquire these skills for good purpose. How you use these skills and knowledge base is not our responsibility.\n\n- [Xtreme Vulnerable Web Application (XVWA)](https://github.com/s4n7h0/xvwa)\n\n## WebGoat: A deliberately insecure Web Application\nWebGoat is a deliberately insecure web application maintained by OWASP designed to teach web application security lessons.\n\n- [WebGoat](https://github.com/WebGoat/WebGoat)\n\n## Audi-1's SQLi-LABS\nSQLi-LABS is a comprehensive test bed to Learn and understand nitti gritty of SQL injections and thereby helps professionals understand how to protect.\n- [SQLi-LABS](https://github.com/Audi-1/sqli-labs)\n- [SQLi-LABS Videos](http://www.securitytube.net/user/Audi)\n\nCapture the Flag\n================\n\n#### Hack The Box\n\nThis pentester training platform/lab is full of machines (boxes) to hack on the different difficulty level. Majority of the content generated by the community and released on the website after the staff's approval. Besides boxes users also can pick static challenges or work on advanced tasks like Fortress or Endgame.\n\n- [Hack The Box link](https://www.hackthebox.eu/)\n\n#### Vulnhub\nWe all learn in different ways: in a group, by yourself, reading books, watching/listening to other people, making notes or things out for yourself. Learning the basics & understanding them is essential; this knowledge can be enforced by then putting it into practice.\n\nOver the years people have been creating these resources and a lot of time has been put into them, creating 'hidden gems' of training material. However, unless you know of them, its hard to discover them.\n\nSo VulnHub was born to cover as many as possible, creating a catalogue of 'stuff' that is (legally) 'breakable, hackable & exploitable' - allowing you to learn in a safe environment and practice 'stuff' out.\nWhen something is added to VulnHub's database it will be indexed as best as possible, to try and give you the best match possible for what you're wishing to learn or experiment with.\n\n- [Vulnhub Repository](https://www.vulnhub.com/)\n\n#### CTF Write Ups\n- [CTF Resources](https://ctfs.github.io/resources)<br>\n  A general collection of information, tools, and tips regarding CTFs and similar security competitions.\n\n- [CTF write-ups 2016](https://github.com/ctfs/write-ups-2016)<br>\nWiki-like CTF write-ups repository, maintained by the community. (2015)\n\n- [CTF write-ups 2015](https://github.com/ctfs/write-ups-2015)<br>\nWiki-like CTF write-ups repository, maintained by the community. (2015)\n\n- [CTF write-ups 2014](https://github.com/ctfs/write-ups-2014)<br>\nWiki-like CTF write-ups repository, maintained by the community. (2014)\n\n- [CTF write-ups 2013](https://github.com/ctfs/write-ups-2013)<br>\nWiki-like CTF write-ups repository, maintained by the community. (2013)\n\n### CTF Repos\n\n- [captf](http://captf.com)<br>\nThis site is primarily the work of psifertex since he needed a dump site for a variety of CTF material and since many other public sites documenting the art and sport of Hacking Capture the Flag events have come and gone over the years.\n\n- [shell-storm](http://shell-storm.org/repo/CTF)<br>\nThe Jonathan Salwan's little corner.\n\n### CTF Courses\n\n- [Roppers CTF Course](https://hoppersroppers.github.io/courseCTF.html)<br>\nFree course designed to teach the fundamentals of Forensics, Cryptography, and Web-Exploitation required to be successful in Capture the Flag competitions. At the end of the course, students compete in the picoCTF event with guidance from instructors. Full text available as a [gitbook](https://www.hoppersroppers.org/ctf/).\n\n\nSecurityTube Playlists\n======================\n\nSecurity Tube hosts a large range of video tutorials on IT security including penetration testing , exploit development and reverse engineering.\n\n* [SecurityTube Metasploit Framework Expert (SMFE)](http://www.securitytube.net/groups?operation=view&groupId=10)<br>\nThis video series covers basics of Metasploit Framework. We will look at why to use metasploit then go on to how to exploit vulnerbilities with help of metasploit and post exploitation techniques with meterpreter.\n\n* [Wireless LAN Security and Penetration Testing Megaprimer](http://www.securitytube.net/groups?operation=view&groupId=9)<br>\nThis video series will take you through a journey in wireless LAN (in)security and penetration testing. We will start from the very basics of how WLANs work, graduate to packet sniffing and injection attacks, move on to audit infrastructure vulnerabilities, learn to break into WLAN clients and finally look at advanced hybrid attacks involving wireless and applications.\n\n* [Exploit Research Megaprimer](http://www.securitytube.net/groups?operation=view&groupId=7)<br>\nIn this video series, we will learn how to program exploits for various vulnerabilities published online. We will also look at how to use various tools and techniques to find Zero Day vulnerabilities in both open and closed source software.\n\n* [Buffer Overflow Exploitation Megaprimer for Linux](http://www.securitytube.net/groups?operation=view&groupId=4)<br>\nIn this video series, we will understand the basic of buffer overflows and understand how to exploit them on linux based systems. In later videos, we will also look at how to apply the same principles to Windows and other selected operating systems.\n\nOpen Security Books\n===================\n\n#### Crypto 101 - lvh\nComes with everything you need to understand complete systems such as SSL/TLS: block ciphers, stream ciphers, hash functions, message authentication codes, public key encryption, key agreement protocols, and signature algorithms.  Learn how to exploit common cryptographic flaws, armed with nothing but a little time and your favorite programming language. Forge administrator cookies, recover passwords, and even backdoor your own random number generator.\n\n- [Crypto101](https://www.crypto101.io/)\n- [LaTeX Source](https://github.com/crypto101/book)\n\n#### A Graduate Course in Applied Cryptography - Dan Boneh & Victor Shoup\nThis book is about constructing practical cruptosystems for which we can argue security under plausible assumptions. The book covers many constructions for different tasks in cryptography. For each task we define the required goal. To analyze the constructions, we develop a unified framework for doing cryptographic proofs. A reader who masters this framework will capable of applying it to new constructions that may not be covered in this book. We describe common mistakes to avoid as well as attacks on real-world systems that illustratre the importance of rigor in cryptography. We end every chapter with a fund application that applies the ideas in the chapter in some unexpected way.\n\n- [A Graduate Course in Applied Cryptography](https://crypto.stanford.edu/~dabo/cryptobook/)\n\n#### Security Engineering, A Guide to Building Dependable Distributed Systems - Ross Anderson\nThe world has changed radically since the first edition of this book was published in 2001. Spammers, virus writers, phishermen, money launderers, and spies now trade busily with each other in a lively online criminal economy and as they specialize, they get better. In this indispensable, fully updated guide, Ross Anderson reveals how to build systems that stay dependable whether faced with error or malice. Here?s straight talk on critical topics such as technical engineering basics, types of attack, specialized protection mechanisms, security psychology, policy, and more.\n\n- [Security Engineering, Second Edition](https://www.cl.cam.ac.uk/~rja14/book.html)\n\n#### Reverse Engineering for Beginners - Dennis Yurichev\nThis book offers a primer on reverse-engineering, delving into disassembly code-level reverse engineering and explaining how to decipher assembly language for those beginners who would like to learn to understand x86 (which accounts for almost all executable software in the world) and ARM code created by C/C++ compilers.\n\n- [Reverse Engineering for Beginners](http://beginners.re/)\n- [LaTeX Source](https://github.com/dennis714/RE-for-beginners)\n\n#### CTF Field Guide - Trail of Bits\nThe focus areas that CTF competitions tend to measure are vulnerability discovery, exploit creation, toolkit creation, and operational tradecraft.. Whether you want to succeed at CTF, or as a computer security professional, you'll need to become an expert in at least one of these disciplines. Ideally in all of them.\n\n- [CTF Field Guide](https://trailofbits.github.io/ctf/)\n- [Markdown Source](https://github.com/trailofbits/ctf)\n\nChallenges\n==========\n\n- [Reverse Engineering Challenges](https://challenges.re/)\n\n- [Pwnable.kr](http://pwnable.kr) is a non-commercial wargame site which provides various pwn challenges regarding system exploitation.\n\n- [Matasano Crypto Challenges](http://cryptopals.com/) (a.k.a. Cryptopals) is a collection of exercises that demonstrate attacks on real-world crypto by letting you implement and break the cryptoschemes yourself.\n\n\nDocumentation\n=============\n\n#### OWASP - Open Web Application Security Project\nThe Open Web Application Security Project (OWASP) is a 501(c)(3) worldwide not-for-profit charitable organization focused on improving the security of software. Our mission is to make software security visible, so that individuals and organizations worldwide can make informed decisions about true software security risks.\n\n- [Open Web Application Security Project](https://www.owasp.org/index.php/Main_Page)\n\n#### Applied Crypto Hardening - bettercrypto.org\nThis guide arose out of the need for system administrators to have an updated, solid, well re-searched and thought-through guide for configuring SSL, PGP,SSH and other cryptographic tools in the post-Snowdenage. Triggered by the NSA leaks in the summer of 2013, many system administrators and IT security officers saw the need to strengthen their encryption settings.This guide is specifically written for these system administrators.\n\n- [Applied Crypto Hardening](https://bettercrypto.org/static/applied-crypto-hardening.pdf)\n- [LaTeX Source](https://github.com/BetterCrypto/Applied-Crypto-Hardening)\n\n#### PTES - Penetration Testing Execution Standard\nThe penetration testing execution standard cover everything related to a penetration test - from the initial communication and reasoning behind a pentest, through the intelligence gathering and threat modeling phases where testers are working behind the scenes in order to get a better understanding of the tested organization, through vulnerability research, exploitation and post exploitation, where the technical security expertise of the testers come to play and combine with the business understanding of the engagement, and finally to the reporting, which captures the entire process, in a manner that makes sense to the customer and provides the most value to it.\n\n- [Penetration Testing Execution Standard](http://www.pentest-standard.org/index.php/Main_Page)\n\n\nRelated Awesome Lists\n=====================\n\n- [Awesome Pentest](https://github.com/enaqx/awesome-pentest)<br>\n A collection of awesome penetration testing resources, tools and other shiny things.\n\n- [Awesome Appsec](https://github.com/paragonie/awesome-appsec)<br>\nA curated list of resources for learning about application security.\n\n- [Awesome Malware Analysis](https://github.com/rshipp/awesome-malware-analysis)<br>\n A curated list of awesome malware analysis tools and resources.\n\n- [Android Security Awesome](https://github.com/ashishb/android-security-awesome)<br>\nA collection of android security related resources.\n\n- [Awesome CTF](https://github.com/apsdehal/awesome-ctf)<br>\nA curated list of CTF frameworks, libraries, resources and softwares.\n\n- [Awesome Security](https://github.com/sbilly/awesome-security)<br>\n A collection of awesome software, libraries, documents, books, resources and cools stuffs about security.\n\n- [Awesome Honeypots](https://github.com/paralax/awesome-honeypots)<br>\nA curated list of awesome honeypots, tools, components and much more.\n\n- [Awesome Incident Response](https://github.com/meirwah/awesome-incident-response)<br>\nA curated list of tools and resources for security incident response, aimed to help security analysts and DFIR teams.\n\n- [Awesome Threat Intelligence](https://github.com/hslatman/awesome-threat-intelligence)<br>\nA curated list of awesome Threat Intelligence resources.\n\n- [Awesome PCAP Tools](https://github.com/caesar0301/awesome-pcaptools)<br>\nA collection of tools developed by other researchers in the Computer Science area to process network traces.\n\n- [Awesome Forensics](https://github.com/Cugu/awesome-forensics)<br>\nA curated list of awesome forensic analysis tools and resources.\n\n- [Awesome Hacking](https://github.com/carpedm20/awesome-hacking)<br>\n A curated list of awesome Hacking tutorials, tools and resources.\n\n- [Awesome Industrial Control System Security](https://github.com/hslatman/awesome-industrial-control-system-security)<br>\nA curated list of resources related to Industrial Control System (ICS) security.\n\n- [Awesome Web Hacking](https://github.com/infoslack/awesome-web-hacking)<br>\nThis list is for anyone wishing to learn about web application security but do not have a starting point.\n\n- [Awesome Sec Talks](https://github.com/PaulSec/awesome-sec-talks)<br>\nA curated list of awesome Security talks.\n\n- [Awesome YARA](https://github.com/InQuest/awesome-yara)<br>\nA curated list of awesome YARA rules, tools, and people.\n\n- [Sec Lists](https://github.com/danielmiessler/SecLists)<br>\nSecLists is the security tester's companion. It is a collection of multiple types of lists used during security assessments. List types include usernames, passwords, URLs, sensitive data grep strings, fuzzing payloads, and many more.\n\n[Contributing](https://github.com/onlurking/awesome-infosec/blob/master/contributing.md)\n=====================\n\nPull requests and issues with suggestions are welcome!\n\nLicense\n=======\n\n[![Creative Commons License](http://i.creativecommons.org/l/by/4.0/88x31.png)](http://creativecommons.org/licenses/by/4.0/)\n\nThis work is licensed under a [Creative Commons Attribution 4.0 International License](http://creativecommons.org/licenses/by/4.0/).\n"
}