{
  "repo_name": "rootsongjc_awesome-cloud-native",
  "readme_content": "# Awesome Cloud Native [![Awesome](https://awesome.re/badge.svg)](https://github.com/sindresorhus/awesome)\n\n> A curated list of open-source cloud native tools, software, and tutorials.\n>\n> 云原生开源工具、软件、教程大全。\n\nCloud Native is a behavior and design philosophy. At its essence, any behavior or approach that improves resource utilization and application delivery efficiency in the cloud is called Cloud Native.\n\n- [Join the Cloud Native Community (China)](https://cloudnative.to)\n- [加入云原生社区](https://cloudnative.to/community/join/)\n\n## Contents\n\n- [AI](#ai)\n- [API Gateway](#api-gateway)\n- [Application Delivery](#application-delivery)\n- [Big Data](#big-data)\n- [Database](#database)\n- [Edge Computing](#edge-computing)\n- [Kubernetes Operators](#kubernetes-operators)\n- [Logging](#logging)\n- [Message Broker](#message-broker)\n- [Miscellaneous](#miscellaneous)\n- [Monitoring](#monitoring)\n- [Network](#network)\n- [Observability](#observability)\n- [Orchestration and Scheduler](#orchestration-and-scheduler)\n- [Proxy](#proxy)\n- [RPC](#rpc)\n- [Runtime](#runtime)\n- [Security and Audit](#security-and-audit)\n- [Service Mesh](#service-mesh)\n- [Service Registry and Discovery](#service-registry-and-discovery)\n- [Serverless](#serverless)\n- [Stability](#stability)\n- [Storage](#storage)\n- [Tools](#tools)\n- [Tracing](#tracing)\n- [Tutorials](#tutorials)\n- [UI](#ui)\n- [Community](#community)\n\n## AI\n\n- [allennlp](https://github.com/allenai/allennlp) - An open-source NLP research library, built on PyTorch.\n- [caffe2](https://github.com/facebookarchive/caffe2) - Caffe2 is a lightweight, modular, and scalable deep learning framework.\n- [elasticdl](https://github.com/sql-machine-learning/elasticdl) - Kubernetes-native Deep Learning Framework.\n- [h2o-3](https://github.com/h2oai/h2o-3) - Open Source Fast Scalable Machine Learning API For Smarter Applications (Deep Learning, Gradient Boosting, Random Forest, Generalized Linear Modeling (Logistic Regression, Elastic Net), K-Means, PCA, Stacked Ensembles.)\n- [jina](https://github.com/jina-ai/jina) - Cloud-native neural search framework for 𝙖𝙣𝙮 kind of data.\n- [keras](https://github.com/keras-team/keras) - Keras is a high-level neural networks API, written in Python and capable of running on top of TensorFlow, CNTK, or Theano.\n- [kubedl](https://github.com/kubedl-io/kubedl) - Run your deep learning workloads on Kubernetes more easily and efficiently.\n- [kubeflow](https://github.com/kubeflow/kubeflow) - Machine Learning Toolkit for Kubernetes.\n- [leaf](https://github.com/autumnai/leaf) - Open Machine Intelligence Framework for Hackers. (GPU/CPU).\n- [paddlepaddle](https://github.com/PaddlePaddle/Paddle) - PArallel Distributed Deep LEarning: Machine Learning Framework from Industrial Practice （『飞桨』核心框架，深度学习&机器学习高性能单机、分布式训练和跨平台部署）.\n- [predictionio](https://github.com/apache/predictionio) - PredictionIO, a machine learning server for developers and ML engineers.\n- [pytorch](https://github.com/pytorch/pytorch) - Tensors and Dynamic neural networks in Python with strong GPU acceleration.\n- [seldon-core](https://github.com/SeldonIO/seldon-core) - A framework to deploy, manage and scale your production machine learning to thousands of models.\n- [sqlflow](https://github.com/sql-machine-learning/sqlflow) - Brings SQL and AI together.\n- [tensorflow](https://github.com/tensorflow/tensorflow) - Computation using data flow graphs for scalable machine learning.\n\n## API Gateway\n\n- [apisix](https://github.com/apache/apisix) - The Cloud-Native API Gateway.\n- [batch-processing-gateway](https://github.com/apple/batch-processing-gateway) - The gateway component to make Spark on K8s much easier for Spark users.\n- [emissary-gateway](https://github.com/emissary-ingress/emissary) - Open source Kubernetes-native API gateway for microservices built on the Envoy Proxy.\n- [express-gateway](https://github.com/ExpressGateway/express-gateway) - A microservices API Gateway built on top of ExpressJS.\n- [gateway](https://github.com/envoyproxy/gateway) - Manages Envoy Proxy as a standalone or Kubernetes-based application gateway.\n- [gloo](https://github.com/solo-io/gloo) - The Feature-rich, Kubernetes-native, Next-Generation API Gateway Built on Envoy.\n- [hango-gateway](https://github.com/hango-io/hango-gateway) - Hango API Gateway, build on Envoy & Istio.\n- [haproxy-ingress](https://github.com/jcmoraisjr/haproxy-ingress) - HaProxy Ingress.\n- [higress](https://github.com/alibaba/higress) - Next-generation Cloud Native Gateway.\n- [kong](https://github.com/Kong/kong) - The Microservice API Gateway.\n- [lura](https://github.com/luraproject/lura) - Ultra performant API Gateway with middlewares. A project hosted at The Linux Foundation.\n- [nginx-gateway-fabric](https://github.com/nginxinc/nginx-gateway-fabric) - NGINX Gateway Fabric provides an implementation for the Gateway API using NGINX as the data plane.\n- [orange](https://github.com/orlabs/orange) - OpenResty/Nginx Gateway for API Monitoring and Management.\n- [ocelot](https://github.com/ThreeMammals/Ocelot) - .NET core API Gateway.\n- [tyk](https://github.com/TykTechnologies/tyk) - Tyk Open Source API Gateway written in Go, supporting REST, GraphQL, TCP and gRPC protocols.\n\n## Application Delivery\n\n- [argo-cd](https://github.com/argoproj/argo-cd/) - Declarative continuous deployment for Kubernetes.\n- [argo](https://github.com/argoproj/argo) - Get stuff done with container-native workflows for Kubernetes.\n- [arkade](https://github.com/alexellis/arkade) - Kubernetes apps for developers.\n- [armada](https://github.com/att-comdev/armada) - A python orchestrator for a installing, upgrading, and managing a collection of helm charts, dependencies, and values overrides.\n- [autoapply](https://github.com/autoapply/autoapply) - Automatically apply changes from a git repository to Kubernetes.\n- [ballerina-lang](https://github.com/ballerina-platform/ballerina-lang) - Ballerina is a new programming language for integration built on a sequence diagram metaphor.\n- [beetle](https://github.com/Clivern/Beetle) - Kubernetes multi-cluster deployment automation service.\n- [binderhub](https://github.com/jupyterhub/binderhub) - Run your code in the cloud, with technology so advanced, it feels like magic!\n- [build](https://github.com/knative/build) - A Kubernetes-native Build resource.\n- [capact](https://github.com/capactio/capact) - A framework to manage applications and infrastructure in a unified way.\n- [carvel](https://github.com/carvel-dev/carvel) - Carvel provides a set of reliable, single-purpose, composable tools that aid in your application building, configuration, and deployment to Kubernetes. This repo contains information regarding the Carvel open-source community.\n- [cdk8s](https://github.com/awslabs/cdk8s) - Define Kubernetes native apps and abstractions using object-oriented programming.\n- [cds](https://github.com/ovh/cds) - Enterprise-Grade Continuous Delivery & DevOps Automation Open Source Platform.\n- [charitify](https://github.com/kubepack/chartify) - Generate Helm Charts from Kubernetes objects.\n- [circleci](https://github.com/circleci) - Continuous Integration and Deployment.\n- [cloudbase-framework](https://github.com/Tencent/cloudbase-framework) - 🚀 A front-end and back-end integrated deployment tool 🔥 One-click deploy to serverless architecture. 云原生一体化部署工具 CloudBase Framework.\n- [cnab-spec](https://github.com/cnabio/cnab-spec) - Cloud Native Application Bundle Specification.\n- [commandeer](https://github.com/commandeer/open) - Cloud management desktop app for macOS, Windows, and Linux.\n- [containerops](https://github.com/Huawei/containerops) - DevOps Orchestration Platform.\n- [couler](https://github.com/couler-proj/couler) - Unified Interface for Constructing and Managing Workflows\n- [crane](https://github.com/Dataman-Cloud/crane) - Yet another control plane based on docker built-in swarmkit.\n- [crossplane](https://github.com/crossplane/crossplane) - An Open Source Multicloud Control Plane.\n- [cross-cloud](https://github.com/crosscloudci/cross-cloud) - Cross Cloud Continuous Integration.\n- [cue](https://github.com/cuelang/cue) - Validate and define text-based and dynamic configuration.\n- [cyclone](https://github.com/caicloud/cyclone) - Powerful workflow engine and end-to-end pipeline solutions implemented with native Kubernetes resources.\n- [dagger](https://github.com/dagger/dagger) - A programmable CI/CD engine that runs your pipelines in containers.\n- [devstream](https://github.com/devstream-io/devstream) - DevStream: the open-source DevOps toolchain manager (DTM).\n- [devtron](https://github.com/devtron-labs/devtron) - Software Delivery Workflow For Kubernetes\n- [draft](https://github.com/azure/draft) - A tool for developers to create cloud-native applications on Kubernetes.\n- [drone](https://github.com/drone/drone) - Drone is a Continuous Delivery platform built on Docker, written in Go.\n- [fabric8](https://github.com/fabric8io/fabric8) - fabric8 is an open source microservices platform based on Docker, Kubernetes and Jenkins.\n- [flagger](https://github.com/weaveworks/flagger) - Progressive delivery Kubernetes operator (Canary, A/B Testing and Blue/Green deployments) .\n- [flux](https://github.com/fluxcd/flux) - A tool for turning container images into running Kubernetes services.\n- [gitkube](https://github.com/hasura/gitkube) - Gitkube: Build and deploy docker images to Kubernetes using git push.\n- [gockerize](https://github.com/redbooth/gockerize) - Package golang service into minimal docker containers.\n- [habitus](https://github.com/cloud66-oss/habitus) - A build flow tool for Docker.\n- [heighliner](https://github.com/h8r-dev/heighliner) - An app development platform using cloud native stacks.\n- [helm](https://github.com/helm/helm) - The Kubernetes Package Manager.\n- [helm-dashboard](https://github.com/komodorio/helm-dashboard) - The missing UI for Helm - visualize your releases.\n- [helmfile](https://github.com/roboll/helmfile) - Deploy Kubernetes Helm Charts.\n- [helmsman](https://github.com/Praqma/helmsman) - Helm Charts as Code.\n- [hiboot](https://github.com/hidevopsio/hiboot) - Hiboot is a high performance web and cli application framework with dependency injection support.\n- [hygieia](https://github.com/Hygieia/Hygieia) - CapitalOne DevOps Dashboard.\n- [hyscale](https://github.com/hyscale/hyscale) - All things HyScale.\n- [jenkins](https://github.com/jenkinsci/jenkins) - Jenkins automation server.\n- [jib](https://github.com/GoogleContainerTools/jib) - Build container images for your Java applications.\n- [jsonnet](https://github.com/google/jsonnet) - Jsonnet - The data templating language.\n- [jx](https://github.com/jenkins-x/jx) - A command line tool for installing and working with Jenkins X.\n- [kaniko](https://github.com/GoogleContainerTools/kaniko) - Build Container Images In Kubernetes.\n- [kapp](https://github.com/carvel-dev/kapp) - kapp is a simple deployment tool focused on the concept of \"Kubernetes application\" — a set of resources with the same label.\n- [kcl](https://github.com/kcl-lang/kcl) - KCL is a constraint-based record & functional language mainly used in configuration and policy scenarios. (CNCF Sandbox Project).\n- [kd](https://github.com/UKHomeOffice/kd) - Minimalistic kubernetes resources deployment tool with templating.\n- [kdo](https://github.com/stepro/kdo) - Deployless Development on Kubernetes.\n- [kedge](https://github.com/kedgeproject/kedge) - Kedge - Concise Application Definition for Kubernetes.\n- [kenyata](https://github.com/spinnaker/kayenta) - Automated Canary Service.\n- [keptn](https://github.com/keptn/keptn) - Keptn is a control-plane for continuous delivery and operations enable cloud-native applications to run autonomously.\n- [kismatic](https://github.com/apprenda/kismatic) - Kismatic Enterprise Toolkit: Fully-Automated, Production-Grade Kubernetes Operations.\n- [ko](https://github.com/ko-build/ko) - Build and deploy Go applications on Kubernetes.\n- [kompose](https://github.com/kubernetes/kompose) - Go from Docker Compose to Kubernetes.\n- [kpt](https://github.com/GoogleContainerTools/kpt) - Kpt is a toolkit to help you manage, manipulate, customize, and apply Kubernetes Resource configuration data files.\n- [kubeapps](https://github.com/kubeapps/kubeapps) - A web-based UI for deploying and managing applications in Kubernetes clusters.\n- [kubegen](https://github.com/errordeveloper/kubegen) - Kubegen – simple way to describe Kubernetes resources.\n- [kubernetes-deploy](https://github.com/Shopify/krane) - A command-line tool that helps you ship changes to a Kubernetes namespace and understand the result.\n- [kubevela](https://github.com/oam-dev/kubevela) - Make shipping applications more enjoyable.\n- [kusion](https://github.com/KusionStack/kusion) - A compile-to-cloud technology stack with tool chains and engine.\n- [kustomize](https://github.com/kubernetes-sigs/kustomize) - Customization of kubernetes YAML configurations.\n- [lastbackend](https://github.com/lastbackend/lastbackend) - Container orchestration with CI&CD, cli and amazing UI.\n- [mkit](https://github.com/darkbitio/mkit) - MKIT is a Managed Kubernetes Inspection Tool that validates several common security-related configuration settings of managed Kubernetes cluster objects and the workloads/resources running inside the cluster.\n- [move2kube](https://github.com/konveyor/move2kube) - A tool to help users migrate their apps from legacy platforms like Cloud Foundry to Kubernetes and Openshift. Analyses the application source code and generates Kubernetes YAMLs, Helm Charts, Tekton Pipelines, etc. The analysis and generation can be heavily customized to produce the exact output that you want.\n- [opencompose](https://github.com/redhat-developer/opencompose) - A higher level abstraction for Kubernetes Resource.\n- [opentofu](https://github.com/opentofu/opentofu) - OpenTofu lets you declaratively manage your cloud infrastructure.\n- [pipeline](https://github.com/banzaicloud/pipeline) - REST API to provision or reuse managed Kubernetes clusters in the cloud and deploy cloud native apps.\n- [pipeline](https://github.com/tektoncd/pipeline) - A cloud-native Pipeline resource.\n- [pipecd](https://github.com/pipe-cd/pipecd) - The One CD for All {applications, platforms, operations} - Complete and unified CD to deploy any application to any platform\n- [pulumi](https://github.com/pulumi/pulumi) - A multi-language, multi-cloud development platform -- your code, your cloud, your team.\n- [qbec](https://github.com/splunk/qbec) - Configure kubernetes objects on multiple clusters using jsonnet.\n- [sealer](https://github.com/alibaba/sealer) - Seal your applications all dependencies and kubernetes into CloudImage! Build Deliver and Run user-defined clusters in one command.\n- [skaffold](https://github.com/GoogleContainerTools/skaffold) - Easy and Repeatable Kubernetes Development.\n- [smith](https://github.com/oracle/Smith) - Smith: A microcontainer builder.\n- [source-to-image](https://github.com/openshift/source-to-image) - A tool for building/building artifacts from source and injecting into docker images.\n- [spec](https://github.com/oam-dev/spec) - The Open Application Model specification.\n- [spec](https://github.com/score-spec/spec) - The score specification file.\n- [spinnaker](https://github.com/spinnaker/spinnaker) - Spinnaker is an open source, multi-cloud continuous delivery platform for releasing software changes with high velocity and confidence.\n- [terraform](https://github.com/hashicorp/terraform) - Terraform is a tool for building, changing, and combining infrastructure safely and efficiently.\n- [tilt](https://github.com/tilt-dev/tilt) - A multi-service dev environment for teams on Kubernetes.\n- [waypoint](https://github.com/hashicorp/waypoint) - A tool to build, deploy, and release any application on any platform.\n- [wercker](https://github.com/wercker/wercker) - The Wercker CLI can be used to execute pipelines locally for both local development and easy introspection.\n- [werf](https://github.com/werf/werf) - The CLI tool gluing Git, Docker, Helm, and Kubernetes with any CI system to implement CI/CD and Giterminism.\n- [woodpecker](https://github.com/laszlocph/woodpecker) - Fork of drone.io v0.8 since drone is not fully opensource anymore.\n- [zadig](https://github.com/koderover/zadig) - Zadig is a cloud native, distributed, developer-oriented continuous delivery product.\n\n## Big Data\n\n- [fast-data-dev](https://github.com/lensesio/fast-data-dev) - Kafka Docker for development. Kafka, Zookeeper, Schema Registry, Kafka-Connect, Landoop Tools, 20+ connectors.\n- [pachyderm](https://github.com/pachyderm/pachyderm) - Reproducible Data Science at Scale!\n- [spark](https://github.com/apache-spark-on-k8s/spark) - Apache Spark enhanced with native Kubernetes scheduler back-end.\n- [spark-on-kubernetes-helm](https://github.com/jahstreet/spark-on-kubernetes-helm) - Spark on Kubernetes infrastructure Helm charts repo.\n- [wallaroo](https://github.com/WallarooLabs/wallaroo) - Ultrafast and elastic data processing.\n- [v6d](https://github.com/alibaba/v6d) - vineyard (v6d), an in-memory immutable data manager.\n\n## Database\n\n- [arangodb](https://github.com/arangodb/arangodb) - ArangoDB is a native multi-model database with flexible data models for documents, graphs, and key-values. Build high performance applications using a convenient SQL-like query language or JavaScript extensions.\n- [beringei](https://github.com/facebookarchive/beringei) - Beringei is a high performance, in-memory storage engine for time series data.\n- [cockroachdb](https://github.com/cockroachdb/cockroach/) - CockroachDB - the open source, cloud-native SQL database.\n- [couchdb](https://github.com/apache/couchdb) - Apache CouchDB is one of a new breed of database management systems.\n- [databend](https://github.com/datafuselabs/databend) - An elastic and reliable Serverless Data Warehouse, offers Blazing Fast Query and combines Elasticity, Simplicity, Low cost of the Cloud, built to make the Data Cloud easy.\n- [etcd](https://github.com/etcd-io/etcd) - Distributed reliable key-value store for the most critical data of a distributed system.\n- [influxdb](https://github.com/influxdata/influxdb) - Scalable datastore for metrics, events, and real-time analytics.\n- [kubeblocks](https://github.com/apecloud/kubeblocks) - KubeBlocks is an open source system software that runs and manages data infrastructure on K8s. It helps developers, SREs, and platform engineers deploy and maintain dedicated DBPaaS, and supports a variety of public clouds and on-premise environments.\n- [kvrocks](https://github.com/KvrocksLabs/kvrocks) - Kvrocks is a distributed key value NoSQL database based on RocksDB and compatible with Redis protocol.\n- [leveldb](https://github.com/google/leveldb) - LevelDB is a fast key-value storage library written at Google that provides an ordered mapping from string keys to string values.\n- [m3](https://github.com/m3db/m3) - M3 monorepo - Distributed TSDB, Aggregator and Query Engine, Prometheus Sidecar, Graphite Compatible, Metrics Platform.\n- [mehdb](https://github.com/mhausenblas/mehdb) - Educational Kubernetes-native NoSQL datastore using StatefulSet and persistent volumes.\n- [milvus](https://github.com/milvus-io/milvus) - Vector database for scalable similarity search and AI applications.\n- [mongodb](https://github.com/mongodb/mongo) - MongoDB is an open source database that uses a document-oriented data model.\n- [montydb](https://github.com/davidlatwe/montydb) - Monty, Mongo tinified. MongoDB implemented in Python.\n- [nebula](https://github.com/vesoft-inc/nebula) - A distributed, fast open-source graph database featuring horizontal scalability and high availability.\n- [nocodb](https://github.com/nocodb/nocodb) - The Open Source Airtable alternative.\n- [oceanbase](https://github.com/oceanbase/oceanbase) - A distributed, banking suitable, open-source related database featuring high scalability and high compatibility.\n- [opentsdb](https://github.com/OpenTSDB/opentsdb) - A scalable, distributed Time Series Database.\n- [polardb-for-postgresql](https://github.com/alibaba/PolarDB-for-PostgreSQL) - PolarDB for PostgreSQL (PolarDB for short) is an open source database system based on PostgreSQL.\n- [promscale](https://github.com/timescale/promscale) - Unified observability backend for metrics and traces powered by SQL and built on PostgreSQL and TimescaleDB.\n- [redis](https://github.com/redis/redis) - Redis is an in-memory database that persists on disk. The data model is key-value, but many different kind of values are supported: Strings, Lists, Sets, Sorted Sets, Hashes, HyperLogLogs, Bitmaps.\n- [rethinkdb](https://github.com/rethinkdb/rethinkdb) - The open-source database for the realtime web.\n- [sharding-sphere](https://github.com/apache/shardingsphere) - Distributed database middleware.\n- [spicedb](https://github.com/authzed/spicedb) - Inspired by Google's Zanzibar paper, SpiceDB is a database system for managing security-critical application permissions.\n- [stolon](https://github.com/sorintlab/stolon) - PostgreSQL cloud native High Availability and more.\n- [tidb](https://github.com/pingcap/tidb) - TiDB is a distributed NewSQL database compatible with MySQL protocol.\n- [tikv](https://github.com/tikv/tikv) - Distributed transactional key-value database, originally created to complement TiDB.\n- [timescaledb](https://github.com/timescale/timescaledb) - An open-source time-series SQL database optimized for fast ingest and complex queries. Packaged as a PostgreSQL extension.\n- [tinydb](https://github.com/msiemens/tinydb) - TinyDB is a lightweight document oriented database optimized for your happiness.\n- [xline](https://github.com/xline-kv/Xline) - A geo-distributed KV store for metadata management.\n\n## Edge Computing\n\n- [akri](https://github.com/project-akri/akri) - A Kubernetes Resource Interface for the Edge.\n- [baetyl](https://github.com/baetyl/baetyl) - Extend cloud computing, data and service seamlessly to edge devices.\n- [eliot](https://github.com/ernoaapa/eliot) - Open source system for managing containerized applications in IoT device.\n- [iotedge](https://github.com/Azure/iotedge) - The IoT Edge OSS project.\n- [k0s](https://github.com/k0sproject/k0s) - Zero Friction Kubernetes.\n- [k3s](https://github.com/k3s-io/k3s) - Lightweight Kubernetes.\n- [kairos](https://github.com/kairos-io/kairos) - The immutable Linux meta-distribution for edge Kubernetes.\n- [kubeedge](https://github.com/kubeedge/kubeedge) - Kubernetes Native Edge Computing Framework (project under CNCF).\n- [octopus](https://github.com/cnrancher/octopus) - Lightweight device management system for Kubernetes/k3s.\n- [openyurt](https://github.com/openyurtio/openyurt) - Extending your native Kubernetes to edge(project under CNCF).\n- [superedge](https://github.com/superedge/superedge) - An edge-native container management system for edge computing.\n\n## Kubernetes Operators\n\n- [banzaicloud/bank-vaults](https://github.com/banzaicloud/bank-vaults) - A Vault swiss-army knife: a K8s operator, Go client with automatic token renewal, automatic configuration, multiple unseal options and more. A CLI tool to init, unseal and configure Vault (auth methods, secret engines). Direct secret injection into Pods.\n- [eunomia](https://github.com/KohlsTechnology/eunomia) - A GitOps Operator for Kubernetes.\n- [fabedge](https://github.com/FabEdge/fabedge) - Secure Edge Networking Based On Kubernetes And KubeEdge.\n- [flagger](https://github.com/weaveworks/flagger) - Istio progressive delivery Kubernetes operator.\n- [keel](https://github.com/keel-hq/keel) - Kubernetes Operator to automate Helm, DaemonSet, StatefulSet & Deployment updates.\n- [kopf](https://github.com/zalando-incubator/kopf) - A Python framework to write Kubernetes operators in just few lines of code.\n- [kube-green](https://github.com/kube-green/kube-green) - A Kubernetes operator to reduce CO2 footprint of your clusters.\n- [kubegres](https://github.com/reactive-tech/kubegres) - Kubegres is a Kubernetes operator allowing to deploy one or many clusters of PostgreSql instances and manage databases replication, failover and backup.\n- [kubeoperator](https://github.com/KubeOperator/KubeOperator) - KubeOperator 是一个开源的轻量级 Kubernetes 发行版，专注于帮助企业规划、部署和运营生产级别的 K8s 集群.\n- [kudo](https://github.com/kudobuilder/kudo) - Kubernetes Universal Declarative Operator (KUDO).\n- [kubevirt](https://github.com/kubevirt/kubevirt) - Kubernetes Virtualization Operator with API and runtime in order to define and manage virtual machines.\n- [operator-lifecycle-manager](https://github.com/operator-framework/operator-lifecycle-manager) - A management framework for extending Kubernetes with Operators.\n- [operator-sdk](https://github.com/operator-framework/operator-sdk) - SDK for building Kubernetes applications. Provides high level APIs, useful abstractions, and project scaffolding.\n- [prometheus-operator](https://github.com/coreos/prometheus-operator) - Prometheus Operator creates/configures/manages Prometheus clusters atop Kubernetes.\n- [spark-on-k8s-operator](https://github.com/GoogleCloudPlatform/spark-on-k8s-operator) - Kubernetes operator for managing the lifecycle of Apache Spark applications on Kubernetes.\n- [strimzi-kafka-operator](https://github.com/strimzi/strimzi-kafka-operator) - Apache Kafka running on Kubernetes.\n- [tidb-operator](https://github.com/pingcap/tidb-operator) - TiDB operator creates and manages TiDB clusters running in Kubernetes.\n- [vault-secrets-operator](https://github.com/ricoberger/vault-secrets-operator) - Create Kubernetes secrets from Vault for a secure GitOps based workflow.\n- [xline-operator](https://github.com/xline-kv/xline-operator) - A powerful tool designed to automate the process of bootstrapping, monitoring, snapshotting, and recovering an xline cluster on Kubernetes.\n\n## Logging\n\n- [beats](https://github.com/elastic/beats) - Beats - Lightweight shippers for Elasticsearch & Logstash.\n- [collectbeat](https://github.com/eBay/collectbeat) - Beats with discovery capabilities for environments like Kubernetes.\n- [dagger](https://github.com/CloudmindsRobot/dagger) - Dagger 是一个基于 Loki 的日志查询和管理系统.\n- [egg](https://github.com/ducc/egg) - The simple error aggregator.\n- [elasticsearch](https://github.com/elastic/elasticsearch) - Open Source, Distributed, RESTful Search Engine.\n- [fluent-bit](https://github.com/fluent/fluent-bit) - Fast and Lightweight Log/Data Forwarder for Linux, BSD and macOS.\n- [fluentd-pilot](https://github.com/AliyunContainerService/log-pilot) - Collect logs in docker containers.\n- [fluentd](https://github.com/fluent/fluentd) - Fluentd: Unified Logging Layer (project under CNCF).\n- [flume](http://flume.apache.org/) - Flume is a distributed, reliable, and available service for efficiently collecting, aggregating, and moving large amounts of log data.\n- [heapster](https://github.com/kubernetes-retired/heapster) - Compute Resource Usage Analysis and Monitoring of Container Clusters.\n- [log-pilot](https://github.com/AliyunContainerService/log-pilot) - Collect logs in docker containers.\n- [loggie](https://github.com/loggie-io/loggie/) - A lightweight, cloud-native data transfer agent and aggregator.\n- [loki](https://github.com/grafana/loki) - Like Prometheus, but for logs.\n- [quickwit](https://github.com/quickwit-oss/quickwit) - Open-source & cloud-native log management & analytics.\n- [telegraf](https://github.com/influxdata/telegraf) - The plugin-driven server agent for collecting & reporting metrics.\n\n## Message Broker\n\n- [emqx](https://github.com/emqx/emqx) - EMQ X Broker - Scalable Distributed MQTT Message Broker for IoT in 5G Era.\n- [eventmesh](https://github.com/WeBankFinTech/EventMesh) - EventMesh is a dynamic cloud-native eventing infrastructure used to decouple the application and backend middleware layer, which supports a wide range of use cases that encompass complex multi-cloud, widely distributed topologies using diverse technology stacks.\n- [flume](https://github.com/apache/flume) - Apache Flume is a distributed, reliable, and available service for efficiently collecting, aggregating, and moving large amounts of log data.\n- [gnatsd](https://github.com/nats-io/nats-server) - High-Performance server for NATS, the cloud native messaging system.\n- [jocko](https://github.com/travisjeffery/jocko) - Kafka implemented in Golang with built-in coordination (No ZK dep, single binary install, Cloud Native).\n- [pulsar](https://github.com/apache/pulsar) - A distributed messaging and streaming platform.\n- [kafka](https://github.com/apache/kafka) - A distributed streaming platform.\n- [kubemq](https://github.com/kubemq-io/kubemq) - KubeMQ is Enterprise-grade message broker native for Docker and Kubernetes.\n- [nsq](https://github.com/nsqio/nsq) - A realtime distributed messaging platform.\n- [rabbitmq](https://github.com/rabbitmq) - RabbitMQ is the most widely deployed open source message broker.\n- [rocketmq](https://github.com/apache/rocketmq) - Apache RocketMQ is a distributed messaging and streaming platform with low latency, high performance and reliability, trillion-level capacity and flexible scalability.\n\n## Miscellaneous\n\n- [agones](https://github.com/googleforgames/agones) - Dedicated Game Server Hosting and Scaling for Multiplayer Games on Kubernetes.\n- [backstage](https://github.com/backstage/backstage) - Backstage is an open platform for building developer portals.\n- [claudie](https://github.com/berops/claudie) - Cloud-agnostic managed Kubernetes.\n- [cloudpods](https://github.com/yunionio/cloudpods) - A cloud-native open-source unified multi-cloud and hybrid-cloud platform.\n- [clusterpedia](https://github.com/clusterpedia-io/clusterpedia) - Clusterpedia is used for complex resource searches across multiple clusters, support simultaneous search of a single kind of resource or multiple kinds of resources existing in multiple clusters.\n- [lotus](https://github.com/uselotus/lotus) - Open Source Pricing & Packaging Infrastructure for SaaS.\n- [kubernetes-lts](https://github.com/klts-io/kubernetes-lts) - Kubernetes LTS(long term support).\n- [opensergo-specification](https://github.com/opensergo/opensergo-specification) - OpenSergo is an open, language-agnostic cloud-native service governance specification.\n- [resoto](https://github.com/someengineering/resoto) - Resoto creates an inventory of your cloud, provides deep visibility, and reacts to changes in your infrastructure.\n- [robusta](https://github.com/robusta-dev/robusta) - Open source Kubernetes troubleshooting and automation platform.\n- [wa](https://github.com/wa-lang/wa/) - The Wa Programming Language: Simple, maintainable, compiled language for developing WebAssembly software.\n\n## Network\n\n- [antrea](https://github.com/antrea-io/antrea) - Antrea is a Kubernetes networking based on Open vSwitch.\n- [bumblebee](https://github.com/solo-io/bumblebee) - Get eBPF programs running from the cloud to the kernel in 1 line of bash.\n- [calico](https://github.com/projectcalico) - A Pure Layer 3 Approach to Virtual Networking for Highly Scalable Data Centers.\n- [cilium](https://github.com/cilium/cilium) - API-aware Networking and Security using eBPF and XDP.\n- [cni](https://github.com/containernetworking/cni) - Container Network Interface - networking for Linux containers.\n- [cni-genie](https://github.com/cni-genie/CNI-Genie) - CNI-Genie for choosing pod network of your choice during deployment time. Supported pod networks - Calico, Flannel, Romana, Weave.\n- [contiv](https://github.com/contiv) - Container networking for various use cases.\n- [flannel](https://github.com/coreos/flannel) - Flannel is a network fabric for containers, designed for Kubernetes.\n- [hubble](https://github.com/cilium/hubble) - Hubble - Network, Service & Security Observability for Kubernetes.\n- [istio-cni](https://github.com/istio/cni) - Istio CNI to setup kubernetes pod namespaces to redirect traffic to sidecar proxy.\n- [knitter](https://github.com/ZTE/Knitter) - Kubernetes network solution.\n- [kube-router](https://github.com/cloudnativelabs/kube-router) - Kube-router, a turnkey solution for Kubernetes networking.\n- [kube-ovn](https://github.com/alauda/kube-ovn) - Kube-OVN, a Kubernetes network fabric for enterprises that is rich in functions and easy in operations.\n- [matchbox](https://github.com/poseidon/matchbox) - Network boot and provision Container Linux clusters (e.g. etcd3, Kubernetes, more).\n- [submariner](https://github.com/submariner-io/submariner) - Connect all your Kubernetes clusters, no matter where they are in the world.\n- [weave](https://github.com/weaveworks/weave) - Simple, resilient multi-host Docker networking and more.\n- [ziti](https://github.com/openziti/ziti) - The parent project for OpenZiti. Here you will find the executables for a fully zero trust, application embedded, programmable network.\n\n## Observability\n\n- [cadvisor](https://github.com/google/cadvisor) - Analyzes resource usage and performance characteristics of running containers.\n- [cortex](https://github.com/cortexproject/cortex) - A multitenant, horizontally scalable Prometheus as a Service.\n- [deepflow](https://github.com/deepflowys/deepflow) - A highly automated observability platform.\n- [elasticsearch-hq](https://github.com/ElasticHQ/elasticsearch-HQ) - Monitoring and Management Web Application for ElasticSearch instances and clusters.\n- [envoy-ui](https://github.com/Nitro/envoy-ui) - Dead simple server-side UI for Envoy proxy (like HAproxy stats).\n- [goldpinger](https://github.com/bloomberg/goldpinger) - Debugging tool for Kubernetes which tests and displays connectivity between nodes in the cluster.\n- [grafana](https://github.com/grafana/grafana) - The tool for beautiful monitoring and metric analytics & dashboards for Graphite, InfluxDB & Prometheus & More.\n- [hawkular-metrics](https://github.com/hawkular/hawkular-metrics) - Time Series Metrics Engine based on Cassandra.\n- [highlight](https://github.com/highlight/highlight) - The open source, full-stack monitoring platform. Error monitoring, session replay, logging and more.\n- [inspektor-gadget](https://github.com/inspektor-gadget/inspektor-gadget) - The eBPF tool and systems inspection framework for Kubernetes, containers and Linux hosts.\n- [istio-ui](https://github.com/jukylin/istio-ui) - Istio config management backend.\n- [kelemetry](https://github.com/kubewharf/kelemetry) - Global control plane tracing for Kubernetes.\n- [kepler](https://github.com/sustainable-computing-io/kepler) - Kepler (Kubernetes-based Efficient Power Level Exporter) uses eBPF to probe performance counters and other system stats, use ML models to estimate workload energy consumption based on these stats, and exports them as Prometheus metrics.\n- [kiali](https://github.com/kiali/kiali) - Kiali project to help istio service mesh observability.\n- [kibana](https://github.com/elastic/kibana) - Kibana analytics and search dashboard for Elasticsearch.\n- [kindling](https://github.com/Kindling-project/kindling) - eBPF-based CloudNative Monitor tool.\n- [konstellate](https://github.com/containership/konstellate) - Free and Open Source GUI to Visualize Kubernetes Applications.\n- [kube-ops-view](https://github.com/hjacobs/kube-ops-view) - Kubernetes Operational View - read-only system dashboard for multiple K8s clusters.\n- [kube-state-metrics](https://github.com/kubernetes/kube-state-metrics) - Add-on agent to generate and expose cluster-level metrics.\n- [kubenurse](https://github.com/postfinance/kubenurse) - Kubernetes network monitoring.\n- [kubernetes-zabbix](https://github.com/monitoringartist/kubernetes-zabbix) - Kubernetes Zabbix/Grafana cluster (bare metal, Google Computer Engine - GCE, Google Container Engine - GKE).\n- [kubeshark](https://github.com/kubeshark/kubeshark) - The API traffic viewer for Kubernetes providing deep visibility into all API traffic and payloads going in, out and across containers and pods inside a Kubernetes cluster. Think TCPDump and Wireshark re-invented for Kubernetes.\n- [lake](https://github.com/merico-dev/lake) - Data lake for dev.\n- [metaflow](https://github.com/metaflowys/metaflow) - MetaFlow is an automated observability platform for cloud-native developers.\n- [monosi](https://github.com/monosidev/monosi) - Open source data observability platform.\n- [naftis](https://github.com/XiaoMi/naftis) - An excellent dashboard for Istio built with love.\n- [nexclipper](https://github.com/NexClipper/NexClipper) - An open source software for monitoring Kubernetes and containers.\n- [octant](https://github.com/vmware-tanzu/octant) - Highly extensible platform for developers to better understand the complexity of Kubernetes clusters.\n- [open-falcon](https://github.com/XiaoMi/open-falcon) - Enterprise Internet monitoring system from Xiaomi.\n- [owl](https://github.com/TalkingData/owl) - Distributed monitoring system from TalkingData.\n- [parca](https://github.com/parca-dev/parca) - Continuous profiling for analysis of CPU and memory usage, down to the line number and throughout time. Saving infrastructure cost, improving performance, and increasing reliability.\n- [perses](https://github.com/perses/perses) - The CNCF candidate for observability visualisation.\n- [pixie](https://github.com/pixie-io/pixie) - Instant Kubernetes-Native Application Observability.\n- [prometheus](https://github.com/prometheus/prometheus) - The Prometheus monitoring system and time series database.\n- [scope](https://github.com/weaveworks/scope) - Monitoring, visualisation & management for Docker & Kubernetes.\n- [sofa-lookout](https://github.com/sofastack/sofa-lookout) - Lookout can help you to measure and monitor the status of the target system with its multi-dimensional metrics.\n- [starship](https://github.com/tricorder-observability/Starship) - Next-generation Observability platform built with eBPF+WASM.\n- [statsd](https://github.com/statsd/statsd) - Daemon for easy but powerful stats aggregation.\n- [tetragon](https://github.com/cilium/tetragon) - eBPF-based Security Observability and Runtime Enforcement.\n- [tobs](https://github.com/timescale/tobs) - tobs - The Observability Stack for Kubernetes. Easy install of a full observability stack into a k8s cluster with a CLI tool or Helm charts.\n- [victoriametrics](https://github.com/VictoriaMetrics/VictoriaMetrics) - VictoriaMetrics: fast, cost-effective monitoring solution and time series database.\n- [vistio](https://github.com/nmnellis/vistio) - Visualize your Istio mesh using Netflix's Vizceral.\n- [vizceral](https://github.com/Netflix/vizceral) - WebGL visualization for displaying animated traffic graphs.\n\n## Orchestration and Scheduler\n\n- [alameda](https://github.com/containers-ai/alameda) - Intelligent Resources Orchestrator for Kubernetes by using machine learning.\n- [blox](https://github.com/blox/blox) - Open source tools for building custom schedulers on Amazon ECS.\n- [clusterset](https://github.com/clusternet/clusternet) - Managing your Kubernetes clusters (including public, private, edge, etc) as easily as visiting the Internet.\n- [compose](https://github.com/docker/compose) - Define and run multi-container applications with Docker.\n- [conductor](https://github.com/Netflix/conductor) - Conductor is a microservices orchestration engine.\n- [dc/os](https://github.com/dcos) - Datacenter Operating System.\n- [deis](https://github.com/deis/deis) - Deis v1, the CoreOS and Docker PaaS: Your PaaS. Your Rules.\n- [descheduler](https://github.com/kubernetes-sigs/descheduler) - Descheduler for Kubernetes.\n- [eks-distro](https://github.com/aws/eks-distro) - Amazon EKS Distro (EKS-D) is a Kubernetes distribution based on and used by Amazon Elastic Kubernetes Service (EKS) to create reliable and secure Kubernetes clusters.\n- [fleet](https://github.com/coreos/fleet) - Fleet ties together systemd and etcd into a distributed init system.\n- [karmada](https://github.com/karmada-io/karmada) - Open, Multi-Cloud, Multi-Cluster Kubernetes Orchestration.\n- [koordinator](https://github.com/koordinator-sh/koordinator) - QoS based scheduling system for hybrid orchestration workloads on Kubernetes, bringing workloads the best layout and status.\n- [kruise](https://github.com/openkruise/kruise) - Automate application workloads management on Kubernetes.\n- [kubernetes](https://github.com/kubernetes/kubernetes) - Production-Grade Container Scheduling and Management.\n- [kubeadmiral](https://github.com/kubewharf/kubeadmiral) - Multi-cluster Kubernetes Orchestration.\n- [kueue](https://github.com/kubernetes-sigs/kueue) - Kubernetes-native Job Queueing.\n- [marathon](https://github.com/mesosphere/marathon) - Deploy and manage containers (including Docker) on top of Apache Mesos at scale.\n- [mesos](https://github.com/apache/mesos) - Apache Mesos abstracts CPU, memory, storage, and other compute resources away from machines (physical or virtual), enabling fault-tolerant and elastic distributed systems to easily be built and run effectively.\n- [ocm](https://github.com/open-cluster-management-io/OCM) - The open-cluster-management.io project is focused on enabling end-to-end visibility and control across your Kubernetes clusters.\n- [serf](https://github.com/hashicorp/serf) - Service orchestration and management tool by hashicorp.\n- [service-fabric](https://github.com/Microsoft/service-fabric) - Service Fabric is a distributed systems platform for packaging, deploying, and managing stateless and stateful distributed applications and containers at large scale.\n- [supergiant](https://github.com/supergiant/control) - Automatically scale hardware and easily run stateful applications using Kubernetes.\n- [swan](https://github.com/Dataman-Cloud/swan) - A Distributed, Highly Available Mesos Scheduler, Inspired by the design of Google Borg.\n- [swarm](https://github.com/docker/classicswarm) - Swarm: a Docker-native clustering system.\n- [vamp](https://github.com/magneticio/vamp) - Vamp - canary releasing and autoscaling for microservice systems.\n- [volcano](https://github.com/volcano-sh/volcano) - A Kubernetes Native Batch System (Project under CNCF).\n\n## Proxy\n\n- [apisix-ingress-controller](https://github.com/apache/apisix-ingress-controller) - Ingress controller for K8s.\n- [caddy](https://github.com/caddyserver/caddy) - Fast, cross-platform HTTP/2 web server with automatic HTTPS.\n- [contour](https://github.com/projectcontour/contour) - Contour is a Kubernetes ingress controller for Lyft's Envoy proxy.\n- [envoy-docker-shim](https://github.com/Nitro/envoy-docker-shim) - Run Envoy in place of docker-proxy.\n- [envoy](https://github.com/envoyproxy/envoy) - C++ front/service proxy.\n- [func-e](https://github.com/tetratelabs/func-e) - func-e (pronounced funky) makes running Envoy easy.\n- [gimbal](https://github.com/projectcontour/gimbal) - Heptio Gimbal is an ingress load balancing platform capable of routing traffic to multiple Kubernetes and OpenStack clusters. Built by Heptio in partnership with Actapio.\n- [gobetween](https://github.com/yyyar/gobetween) - Modern & minimalistic load balancer for the Сloud era.\n- [haproxy](https://github.com/haproxy/haproxy) - HAProxy is a free, very fast and reliable solution offering high availability, load balancing, and proxying for TCP and HTTP-based applications.\n- [inlets-operator](https://github.com/inlets/inlets-operator) - Add public LoadBalancers to your local Kubernetes clusters.\n- [kedge](https://github.com/improbable-eng/kedge) - kEdge - Kubernetes Edge Proxy for gRPC and HTTP Microservices.\n- [katran](https://github.com/facebookincubator/katran) - A high performance layer 4 load balancer.\n- [kong-ingress](https://github.com/koli/kong-ingress) - A Kubernetes Ingress for Kong.\n- [kong/kubernetes-ingress-controller](https://github.com/Kong/kubernetes-ingress-controller) - Deploy Kong in a native Kubernetes Ingress Controller.\n- [metallb](https://github.com/metallb/metallb) - A network load-balancer implementation for Kubernetes using standard routing protocols.\n- [mosn](https://github.com/mosn/mosn) - MOSN is a cloud native proxy for edge or service mesh.\n- [nginx-kubernetes-ingress](https://github.com/nginxinc/kubernetes-ingress) - NGINX and NGINX Plus Ingress Controllers for Kubernetes.\n- [nginx](https://github.com/nginx/nginx) - Nginx is an HTTP and reverse proxy server, a mail proxy server, and a generic TCP/UDP proxy server, originally written by Igor Sysoev.\n- [reverse-proxy](https://github.com/microsoft/reverse-proxy) - A toolkit for developing high-performance HTTP reverse proxy applications.\n- [ribbon](https://github.com/Netflix/ribbon) - Ribbon is a Inter Process Communication (remote procedure calls) library with built in software load balancers. The primary usage model involves REST calls with various serialization scheme support.\n- [skipper](https://github.com/zalando/skipper) - An HTTP router and reverse proxy for service composition, including use cases like Kubernetes Ingress.\n- [traefik](https://github.com/containous/traefik) - Træfik, a modern reverse proxy.\n- [voyager](https://github.com/voyagermesh/voyager) - Secure Ingress Controller for Kubernetes.\n\n## RPC\n\n- [brpc](https://github.com/apache/incubator-brpc) - Most common RPC framework used throughout Baidu, with 600,000+ instances and 500+ kinds of services, called \"baidu-rpc\" inside Baidu.\n- [drpc](https://github.com/storj/drpc) - drpc is a lightweight, drop-in replacement for gRPC.\n- [finagle](https://github.com/twitter/finagle) - A fault tolerant, protocol-agnostic RPC system.\n- [grpc](https://github.com/grpc) - A high performance, open source, general-purpose RPC framework.\n- [kitex](https://github.com/cloudwego/kitex) - A high-performance and strong-extensibility Golang RPC framework that helps developers build microservices.\n- [proxygen](https://github.com/facebook/proxygen) - A collection of C++ HTTP libraries including an easy to use HTTP server.\n- [rsocket](https://github.com/rsocket) - Streaming message protocol with Reactive Extension/Stream semantics.\n- [sofa-bolt](https://github.com/sofastack/sofa-bolt) - SOFABolt is a lightweight, easy to use and high performance remoting framework based on Netty.\n- [sofa-rpc](https://github.com/sofastack/sofa-rpc) - SOFARPC is a high-performance, high-extensibility, production-level Java RPC framework.\n- [tars](https://github.com/TarsCloud/Tars) - Tars is a high-performance RPC framework based on name service and Tars protocol, also integrated administration platform, and implemented hosting-service via flexible schedule.\n- [thrift](https://github.com/apache/thrift) - Apache thrift.\n\n## Runtime\n\n- [containerd](https://github.com/containerd/containerd) - An open and reliable container runtime.\n- [containerd-wasm-shims](https://github.com/deislabs/containerd-wasm-shims) - Containerd shims for running WebAssembly workloads in Kubernetes.\n- [crun](https://github.com/containers/crun) - A fast and lightweight fully featured OCI runtime and C library for running containers.\n- [cri-o](https://github.com/cri-o/cri-o) - Open Container Initiative-based implementation of Kubernetes Container Runtime Interface.\n- [firecracker-containerd](https://github.com/firecracker-microvm/firecracker-containerd) - firecracker-containerd enables containerd to manage containers as Firecracker microVMs.\n- [frakti](https://github.com/kubernetes/frakti) - The hypervisor-based container runtime for Kubernetes.\n- [gvisor](https://github.com/google/gvisor) - Sandboxed Container Runtime.\n- [hyperd](https://github.com/hyperhq/hyperd) - HyperContainer Daemon.\n- [img](https://github.com/genuinetools/img) - Standalone, daemon-less, unprivileged Dockerfile and OCI compatible container image builder.\n- [lima](https://github.com/AkihiroSuda/lima) - Linux virtual machines, on macOS (aka \"Linux-on-Mac\", \"macOS subsystem for Linux\", \"containerd for Mac\", unofficially).\n- [katacontainers](https://katacontainers.io/) - Kata Containers is a new open source project building extremely lightweight virtual machines that seamlessly plug into the containers ecosystem.\n- [kuasar](https://github.com/kuasar-io/kuasar) - An efficient container runtime that provides cloud-native, all-scenario multiple sandbox container solutions.\n- [moby](https://github.com/moby/moby) - Moby Project - a collaborative project for the container ecosystem to assemble container-based systems.\n- [podman](https://github.com/containers/podman) - A tool for managing OCI containers and pods.\n- [pouch](https://github.com/alibaba/pouch) - Pouch is an open-source project created to promote the container technology movement.\n- [railcar](https://github.com/oracle/railcar) - RailCar: Rust implementation of the Open Containers Initiative oci-runtime.\n- [rkt](https://github.com/rkt/rkt) - Rkt is a pod-native container engine for Linux. It is composable, secure, and built on standards.\n- [runwasi](https://github.com/containerd/runwasi) - Facilitates running Wasm/WASI workloads managed by containerd.\n- [spin](https://github.com/fermyon/spin) - Spin is an open source framework for building and running fast, secure, and composable cloud microservices with WebAssembly.\n- [virtlet](https://github.com/Mirantis/virtlet) - Kubernetes CRI implementation for running VM workloads.\n- [wasm-micro-runtime](https://github.com/bytecodealliance/wasm-micro-runtime) - WebAssembly Micro Runtime (WAMR).\n- [wasmcloud](https://github.com/wasmCloud/wasmCloud) - wasmCloud is a universal host runtime for actors built with WebAssembly and capability providers.\n- [wazero](https://github.com/tetratelabs/wazero) - The zero dependency WebAssembly runtime for Go developers.\n\n## Security and Audit\n\n- [apparmor](https://gitlab.com/apparmor/apparmor/-/wikis/home) - AppArmor is an effective and easy-to-use Linux application security system.\n- [authenticator](https://github.com/kubernetes-sigs/aws-iam-authenticator) - A tool for using AWS IAM credentials to authenticate to a Kubernetes cluster.\n- [awacs](https://github.com/socketkit/awacs) - Next-gen behavior analysis server (think Mixpanel, Google Analytics) with built-in encryption.\n- [cedar](https://github.com/cedar-policy/cedar) - Core implementation of the Cedar language.\n- [cert-manager](https://github.com/jetstack/cert-manager) - Automatically provision and manage TLS certificates in Kubernetes.\n- [checkov](https://github.com/bridgecrewio/checkov/) - A static analysis tool for infrastructure as code - to prevent misconfigs at build time.\n- [clair](https://github.com/quay/clair) - Vulnerability Static Analysis for Containers.\n- [cost-model](https://github.com/kubecost/cost-model) - Cross-cloud cost allocation models for workloads running on Kubernetes.\n- [curiefense](https://github.com/curiefense/curiefense) - Adds a broad set of automated web security tools to Envoy.\n- [dex](https://github.com/dexidp/dex) - OpenID Connect Identity (OIDC) and OAuth 2.0 Provider with Pluggable Connectors.\n- [docker-bench-security](https://github.com/docker/docker-bench-security) - The Docker Bench for Security is a script that checks for dozens of common best-practices around deploying Docker containers in production.\n- [dockscan](https://github.com/kost/dockscan) - Dockscan is security vulnerability and audit scanner for Docker installations.\n- [drydock](https://github.com/zuBux/drydock) - Drydock provides a flexible way of assessing the security of your Docker daemon configuration and containers using editable audit templates.\n- [falco](https://github.com/falcosecurity/falco) - Behavioral Activity Monitoring With Container Support.\n- [galadriel](https://github.com/HewlettPackard/galadriel) - SPIFFE Federation the easy way.\n- [goldfish](https://github.com/Caiyeon/goldfish) - A HashiCorp Vault UI panel written with VueJS and Vault native Go API.\n- [grafeas](https://github.com/Grafeas/Grafeas) - Cloud artifact metadata CRUD API and resource specifications.\n- [grype](https://github.com/anchore/grype) - A vulnerability scanner for container images and filesystems.\n- [guard](https://github.com/appscode/guard) - Kubernetes Authentication WebHook Server.\n- [in-toto](https://github.com/in-toto/in-toto) - in-toto is a framework to protect supply chain integrity.\n- [infra](https://github.com/infrahq/infra) - Infra provides authentication and access management to servers and Kubernetes clusters.\n- [k8guard](https://github.com/k8guard) - An auditing system for Kubernetes.\n- [kamus](https://github.com/Soluto/kamus) - An open source, git-ops, zero-trust secret encryption and decryption solution for Kubernetes applications.\n- [keycloak](https://github.com/keycloak/keycloak) - Open Source Identity and Access Management For Modern Applications and Services.\n- [kratos](https://github.com/ory/kratos) - Next-gen identity server (think Auth0, Okta, Firebase) with Ory-hardened authentication, MFA, FIDO2, profile management, identity schemas, social sign in, registration, account recovery, service-to-service and IoT auth. Can work as an OAuth2 / OpenID Connect Provider. Golang, headless, API-only - without templating or theming headaches.\n- [kritis](https://github.com/grafeas/kritis) - Deploy-time Policy Enforcer for Kubernetes applications.\n- [kube-bench](https://github.com/aquasecurity/kube-bench) - The Kubernetes Bench for Security is a Go application that checks whether Kubernetes is deployed according to security best practices.\n- [kube-lego](https://github.com/jetstack/kube-lego) - Automatically request certificates for Kubernetes Ingress resources from Let's Encrypt.\n- [kube2iam](https://github.com/jtblin/kube2iam) - kube2iam provides different AWS IAM roles for pods running on Kubernetes.\n- [kubed](https://github.com/appscode/kubed) - A Kubernetes Cluster Operator Daemon.\n- [kubescape](https://github.com/armosec/kubescape) - Kubescape is the first tool for testing if Kubernetes is deployed securely as defined in Kubernetes Hardening Guidance by to NSA and CISA.\n- [kubesec](https://github.com/controlplaneio/kubesec) - Security risk analysis for Kubernetes resources.\n- [kyverno](https://github.com/kyverno/kyverno/) - Kubernetes Native Policy Management.\n- [neuvector](https://github.com/neuvector/neuvector) - Kubernetes-native container security platform.\n- [notary](https://github.com/theupdateframework/notary) - Notary is a Docker project that allows anyone to have trust over arbitrary collections of data.\n- [opa](https://github.com/open-policy-agent/opa) - An open source project to policy-enable your service.\n- [pomerium](https://github.com/pomerium/pomerium/) - Pomerium is a zero-trust context and identity aware access gateway inspired by BeyondCorp.\n- [rond](https://github.com/rond-authz/rond) - A lightweight container for distributed security policy evaluation.\n- [spiffe](https://github.com/spiffe/spiffe) - The SPIFFE Project.\n- [supertokens-core](https://github.com/supertokens/supertokens-core) - Open source alternative to Auth0 / Firebase Auth / AWS Cognito.\n- [syft](https://github.com/anchore/syft) - CLI tool and library for generating a Software Bill of Materials from container images and filesystems.\n- [topaz](https://github.com/aserto-dev/topaz) - Cloud-native authorization for modern applications and APIs.\n- [trivy-action](https://github.com/aquasecurity/trivy-action) - Runs Trivy as GitHub action to scan your Docker container image for vulnerabilities.\n- [trivy](https://github.com/aquasecurity/trivy) - Scanner for vulnerabilities in container images, file systems, and Git repositories, as well as for configuration issues and hard-coded secrets.\n- [trousseau](https://github.com/oleiade/trousseau) - File based encrypted key-value store.\n- [trust-manager](https://github.com/cert-manager/trust-manager) - trust-manager is an operator for distributing trust bundles across a Kubernetes cluster.\n- [vault](https://github.com/hashicorp/vault) - A tool for managing secrets.\n- [vilicus](https://github.com/edersonbrilhante/vilicus) - Vilicus is an open source tool that orchestrates security scans of container images(docker/oci) and centralizes all results into a database for further analysis and metrics.\n\n## Service Mesh\n\n- [aeraki](https://github.com/aeraki-framework/aeraki) - Manage any layer 7 traffic in an Istio service mesh.\n- [amalgam8](https://github.com/amalgam8/amalgam8) - Content and Version-based Routing Fabric for Polyglot Microservices.\n- [consul](https://github.com/hashicorp/consul) - Consul is a distributed, highly available, and data center aware solution to connect and configure applications across dynamic, distributed infrastructure.\n- [easemesh](https://github.com/megaease/easemesh) - A service mesh implementation for connecting, control, and observe services in spring-cloud.\n- [getmesh](https://github.com/tetratelabs/getmesh) - An integration, and lifecycle management CLI tool that ensures the use of supported and trusted versions of Istio.\n- [istio](https://github.com/istio/istio) - Connect, secure, control, and observe services.\n- [istio-security-analyzer](https://github.com/tetratelabs/istio-security-analyzer) - A tool to analyze Istio security.\n- [kuma](https://github.com/kumahq/kuma) - Universal Control Plane for your Service Mesh.\n- [slime](https://github.com/slime-io/slime) - Slime is a CRD controller for istio.\n- [linkerd](https://github.com/linkerd/linkerd) - Resilient service mesh for cloud native apps.\n- [linkerd2](https://github.com/linkerd/linkerd2) - Ultralight, security-first service mesh for Kubernetes. Main repo for Linkerd 2.x.\n- [maesh](https://github.com/containous/maesh) - Simpler Service Mesh.\n- [merbridge](https://github.com/merbridge/merbridge) - Use eBPF to speed up your Service Mesh like crossing an Einstein-Rosen Bridge.\n- [nginmesh](https://github.com/nginxinc/nginmesh) - Service Mesh using Nginx.\n- [nginx-unit](https://github.com/nginx/unit) - NGINX Unit is a new, lightweight, open source application server built to meet the demands of dynamic and distributed applications.\n- [osm](https://github.com/openservicemesh/osm) - Open Service Mesh (OSM) is a lightweight, extensible, cloud native service mesh that allows users to uniformly manage, secure, and get out-of-the-box observability features for highly dynamic microservice environments.\n- [secretscanner](https://github.com/deepfence/SecretScanner) - Find secrets and passwords in container images and file systems.\n- [servicecomb](https://github.com/ServiceComb) - ServiceComb is a microservice framework that provides an easy way to develop and deploy applications in the cloud.\n- [supergloo](https://github.com/solo-io/service-mesh-hub) - The Service Mesh Orchestration Platform.\n\n## Service Registry and Discovery\n\n- [admiral](https://github.com/istio-ecosystem/admiral) - Admiral provides automatic configuration generation, syncing and service discovery for multicluster Istio service mesh.\n- [apollo](https://github.com/ctripcorp/apollo) - Apollo（阿波罗）是携程框架部门研发的分布式配置中心，能够集中化管理应用不同环境、不同集群的配置，配置修改后能够实时推送到应用端，并且具备规范的权限、流程治理等特性，适用于微服务配置管理场景.\n- [confd](https://github.com/kelseyhightower/confd) - Manage local application configuration files using templates and data from etcd or consul.\n- [coredns](https://github.com/coredns/coredns) - CoreDNS is a DNS server that chains middleware.\n- [eureka](https://github.com/Netflix/eureka) - AWS Service registry for resilient mid-tier load balancing and failover.\n- [open-service-broker-sdk](https://github.com/openshift/open-service-broker-sdk) - A starting point for creating service brokers implementing the Open Service Broker API.\n- [polaris](https://github.com/polarismesh/polaris) - Service discovery and governance center for distributed and microservice architecture.\n- [registrator](https://github.com/gliderlabs/registrator) - Service registry bridge for Docker with pluggable adapters.\n- [rotor](https://github.com/turbinelabs/rotor) - Rotor is a fast, lightweight bridge between your service discovery and the configuration APIs of Envoy. Rotor supports Kubernetes, Consul, AWS (EC2 and ECS), DC/OS, flat files, and even other EDS/CDS implementations.\n- [service-broker](https://github.com/openservicebrokerapi/servicebroker) - Open Service Broker API Specification.\n- [service-catalog](https://github.com/kubernetes-sigs/service-catalog) - Consume services in Kubernetes using the Open Service Broker API.\n- [skydns](https://github.com/skynetservices/skydns1) - DNS for skynet or any other service discovery.\n- [steward](https://github.com/deis/steward) - The Kubernetes-native Service Broker.\n- [synapse](https://github.com/airbnb/synapse) - A transparent service discovery framework for connecting an SOA.\n- [vulcand](https://github.com/vulcand/vulcand) - Programmatic load balancer backed by Etcd.\n- [zookeeper](https://github.com/apache/zookeeper) - Apache ZooKeeper is an effort to develop and maintain an open-source server which enables highly reliable distributed coordination.\n\n## Serverless\n\n- [booster](https://github.com/boostercloud/booster) - Booster is a framework for building and deploying reliable and scalable event-driven serverless applications.\n- [dapr](https://github.com/dapr/dapr) - Dapr is a portable, event-driven, runtime for building distributed applications across cloud and edge.\n- [dispatch](https://github.com/vmware/dispatch) - Dispatch is a framework for deploying and managing serverless style applications.\n- [easyfaas](https://github.com/baidu/EasyFaaS) - EasyFaaS 是一个依赖轻、适配性强、资源占用少、无状态且高性能的函数计算服务引擎.\n- [eventing](https://github.com/knative/eventing) - Open source specification and implementation of Knative event binding and delivery.\n- [faas-netes](https://github.com/openfaas/faas-netes) - Enable Kubernetes as a backend for Functions as a Service (OpenFaaS).\n- [firecamp](https://github.com/cloudstax/firecamp) - Serverless Platform for the stateful services.\n- [firecracker](https://github.com/firecracker-microvm/firecracker) - Secure and fast microVMs for serverless computing.\n- [fission](https://github.com/fission/fission) - Fast Serverless Functions for Kubernetes.\n- [fn](https://github.com/fnproject/fn) - The container native, cloud agnostic serverless platform.\n- [funktion](https://github.com/funktionio/funktion/) - A CLI tool for working with funktion.\n- [fx](https://github.com/metrue/fx) - Poor man's serverless framework based on Docker, Function as a Service with painless.\n- [ironfunctions](https://github.com/iron-io/functions) - IronFunctions - the serverless microservices platform.\n- [keda](https://github.com/kedacore/keda) - KEDA is a Kubernetes-based Event Driven Autoscaling component. It provides event driven scale for any container running in Kubernetes.\n- [knative-lambda-runtime](https://github.com/triggermesh/knative-lambda-runtime) - Running AWS Lambda Functions on Knative/Kubernetes Clusters.\n- [knix](https://github.com/knix-microfunctions/knix) - KNIX MicroFunctions is a serverless computing platform that combines container-based resource isolation with a lightweight execution model using processes to significantly improve resource efficiency and decrease the function startup latency. KNIX MicroFunctions works in Knative as well as bare metal or virtual machine-based environments.\n- [kubeless](https://github.com/kubeless/kubeless) - Kubernetes Native Serverless Framework.\n- [laf](https://github.com/labring/laf) - Laf is a cloud development platform offering ready-to-use resources like cloud functions, databases, and storage. It empowers developers to quickly unleash their creativity.\n- [layotto](https://github.com/mosn/layotto) - A fast and efficient cloud native application runtime.\n- [nuclio](https://github.com/nuclio/nuclio) - High-Performance Serverless event and data processing platform.\n- [openfaas](https://github.com/openfaas/faas) - OpenFaaS - Serverless Functions Made Simple for Docker & Kubernetes.\n- [openfunction](https://github.com/OpenFunction/OpenFunction) - Cloud Native Function-as-a-Service Platform.\n- [openwhisk](http://openwhisk.apache.org/) - Apache OpenWhisk (Incubating) is a serverless, open source cloud platform that executes functions in response to events at any scale.\n- [osiris](https://github.com/deislabs/osiris) - A general purpose, scale-to-zero component for Kubernetes.\n- [riff](https://github.com/projectriff/riff) - Riff is for functions.\n- [serverless](https://github.com/serverless/serverless) - Serverless Framework – Build web, mobile and IoT applications with serverless architectures using AWS Lambda, Azure Functions, Google CloudFunctions & more!\n- [serverless-devs](https://github.com/Serverless-Devs/Serverless-Devs)  - Serverless Devs developer tool (Serverless Devs 开发者工具).\n- [serving](https://github.com/knative/serving) - Kubernetes-based, scale-to-zero, request-driven compute.\n- [spec](https://github.com/cloudevents/spec) - CloudEvents Specification.\n- [sqoop](https://github.com/solo-io/sqoop) - The GraphQL Engine powered by Gloo.\n- [thanos](https://github.com/thanos-io/thanos) - Highly available Prometheus setup with long term storage capabilities.\n\n## Stability\n\n- [chaosblade](https://github.com/chaosblade-io/chaosblade) - An easy to use and powerful chaos engineering experiment toolkit（阿里巴巴开源的一款简单易用、功能强大的混沌实验注入工具）.\n- [chaosmonkey](https://github.com/Netflix/chaosmonkey) - Chaos Monkey is a resiliency tool that helps applications tolerate random instance failures.\n- [chaos-mesh](https://github.com/chaos-mesh/chaos-mesh) - A Chaos Engineering Platform for Kubernetes.\n- [concurrency-limits](https://github.com/Netflix/concurrency-limits) - Java Library that implements and integrates concepts from TCP congestion control to auto-detect concurrency limits to achieve optimal throughput with optimal latency.\n- [hystrix](https://github.com/Netflix/Hystrix) - Hystrix is a latency and fault tolerance library designed to isolate points of access to remote systems, services and 3rd party libraries, stop cascading failure and enable resilience in complex distributed systems where failure is inevitable.\n- [kubediag](https://github.com/kubediag/kubediag) - Problem diagnosis and operation orchestration for Kubernetes.\n- [kubedoom](https://github.com/storax/kubedoom) - Kill Kubernetes pods by playing Id's DOOM!\n- [litmus](https://github.com/litmuschaos/litmus) - Litmus helps SREs and developers practice chaos engineering in a Cloud-native way.\n- [metersphere](https://github.com/metersphere/metersphere) - MeterSphere is an End-to-End open source continuous testing platform. MeterSphere 是一站式开源持续测试平台，涵盖测试跟踪、接口测试、性能测试、团队协作等功能，全面兼容 JMeter、Postman、Swagger 等开源、主流标准.\n- [ratelimit](https://github.com/envoyproxy/ratelimit) - Go/gRPC service designed to enable generic rate limit scenarios from different types of applications.\n- [rider](https://github.com/hango-io/rider) - SDK for Envoy Lua extensions.\n- [sentinel](https://github.com/alibaba/sentinel) - A powerful flow control component enabling reliability, resilience and monitoring for microservices. (面向云原生微服务的高可用流控防护组件)\n- [testkube](https://github.com/kubeshop/testkube) - Kubernetes-native framework for test definition and execution.\n- [toxiproxy](https://github.com/shopify/toxiproxy) - A TCP proxy to simulate network and system conditions for chaos and resiliency testing.\n\n## Storage\n\n- [ceph](https://github.com/ceph/ceph) - Ceph is a distributed object, block, and file storage platform.\n- [chubaofs](https://github.com/chubaofs/chubaofs) - A distributed storage system for cloud native applications.\n- [convoy](https://github.com/rancher/convoy) - A Docker volume plugin, managing persistent container volumes.\n- [curve](https://github.com/opencurve/curve) - Curve is a better-used cloud-native SDS storage system, featured with high performance, easy operation, cloud native. Curve is composed with CurveBS and CurveFS based on Raft.\n- [fastdfs](https://github.com/happyfish100/fastdfs) - FastDFS is an open source high performance distributed file system (DFS). It's major functions include: file storing, file syncing and file accessing, and design for high capacity and load balance.\n- [flocker](https://github.com/ClusterHQ/flocker) - Container data volume manager for your Dockerized application.\n- [glusterd2](https://github.com/gluster/glusterd2) - GlusterD-2.0 is the distributed management framework to be used for GlusterFS-4.0.\n- [glusterfs](https://github.com/gluster/glusterfs) - Gluster is a software defined distributed storage that can scale to several petabytes. It provides interfaces for object, block and file storage.\n- [harbor](https://github.com/goharbor/harbor) - An open source trusted cloud native registry project that stores, signs, and scans content.\n- [heketi](https://github.com/heketi/heketi) - RESTful based volume management framework for GlusterFS.\n- [hwameistor](https://github.com/hwameistor/hwameistor) - Hwameistor is an HA local storage system for cloud-native stateful workloads.\n- [infinit](https://github.com/infinit/infinit) - The Infinit policy-based software-defined storage platform.\n- [juicefs](https://github.com/juicedata/juicefs) - A distributed POSIX file system built on top of Redis and S3.\n- [k8ssandra](https://github.com/k8ssandra/k8ssandra) - K8ssandra is a collection of Helm charts for running Apache Cassandra on Kubernetes in production.\n- [kubefs](https://github.com/configurator/kubefs) - Mount kubernetes metadata storage as a filesystem.\n- [leofs](https://leo-project.net/leofs/) - The LeoFS Storage System.\n- [longhorn](https://github.com/longhorn/longhorn) - We put storage on cows and move them around from rancher.\n- [minio](https://github.com/minio/minio) - Minio is an open source object storage server compatible with Amazon S3 APIs.\n- [openebs](https://github.com/openebs/openebs) - OpenEBS is containerized block storage written in Go for cloud native and other environments w/ per container (or pod) QoS SLAs, tiering and replica policies across AZs and environments, and predictable and scalable performance.\n- [oras](https://github.com/oras-project/oras) - OCI registry client, managing content like artifacts, images, packages.\n- [rook](https://github.com/rook/rook) - File, Block, and Object Storage Services for your Cloud-Native Environment.\n- [storageos](https://storageos.com/) - Enterprise persistent storage for containers and the cloud.\n- [torus](https://github.com/coreos/torus) - Torus Distributed Storage.\n- [vitess](https://github.com/vitessio/vitess) - Vitess is a database clustering system for horizontal scaling of MySQL.\n- [zenko](https://github.com/scality/Zenko) - Because everyone should be in control of their data.\n- [zot](https://github.com/project-zot/zot) - A production-ready vendor-neutral OCI-native container image registry (purely based on OCI Distribution Specification).\n\n## Tools\n- [aglio](https://github.com/danielgtaylor/aglio) - An API Blueprint renderer with theme support that outputs static HTML.\n- [ansible](https://github.com/ansible/ansible) - Ansible is a radically simple IT automation platform that makes your applications and systems easier to deploy. Avoid writing scripts or custom code to deploy and update your applications — automate in a language that approaches plain English, using SSH, with no agents to install on remote systems.\n- [ark](https://github.com/vmware-tanzu/velero) - Heptio Ark is a utility for managing disaster recovery, specifically for your Kubernetes cluster resources and persistent volumes. Brought to you by Heptio.\n- [buildx](https://github.com/docker/buildx) - Docker CLI plugin for extended build capabilities with BuildKit.\n- [chaostoolkit](https://github.com/chaostoolkit/chaostoolkit/) - An Open API to Chaos Engineering.\n- [che](https://github.com/eclipse/che) - Eclipse Che: Next-generation Eclipse IDE. Open source workspace server and cloud IDE.\n- [client-go](https://github.com/kubernetes/client-go) - Go client for Kubernetes.\n- [cloud-native-sandbox](https://github.com/rootsongjc/cloud-native-sandbox) - Cloud Native Sandbox can help you setup a standalone Kubernetes and Istio environment with Docker on you own laptop.\n- [cloudtty](https://github.com/cloudtty/cloudtty) - A Friendly Kubernetes CloudShell (Web Terminal) !\n- [cluster-lifecycle-manager](https://github.com/zalando-incubator/cluster-lifecycle-manager) - Cluster Lifecycle Manager (CLM) to provision and update multiple Kubernetes clusters.\n- [clusternet](https://github.com/clusternet/clusternet) - Managing your Kubernetes clusters (including public, private, edge, etc) as easily as visiting the Internet.\n- [compass](https://github.com/winfordlin/Compass) - A Debugging Tool for your Kubernetes Deployments.\n- [container-structure-test](https://github.com/GoogleContainerTools/container-structure-test) - Validate the structure of your container images.\n- [container-transform](https://github.com/micahhausler/container-transform) - Transforms docker-compose, ECS, and Marathon configurations.\n- [cost-model](https://github.com/kubecost/cost-model) - Cross-cloud cost allocation models for workloads running on Kubernetes.\n- [crashcart](https://github.com/oracle/crashcart) - CrashCart: sideload binaries into a running container.\n- [cri-tools](https://github.com/kubernetes-sigs/cri-tools) - CLI and validation tools for Kubelet Container Runtime Interface (CRI).\n- [datree](https://github.com/datreeio/datree) - CLI tool that automatically scans Kubernetes manifests and Helm charts to ensure they follow best practices as well as your organization’s policies.\n- [devspace](https://github.com/devspace-cloud/devspace) - Cloud Native Software Development with Kubernetes and Docker - simply run \"devspace up\" in any of your projects and start coding directly on top of Kubernetes (works with minikube, self-hosted and cloud-based clusters).\n- [docker-elk](https://github.com/deviantony/docker-elk) - The ELK stack powered by Docker and Compose.\n- [docker-pushrm](https://github.com/christian-korneck/docker-pushrm) - A Docker CLI plugin that that lets you push the README.md file from the current directory to Docker Hub. Also supports Quay and Harbor.\n- [docker-wine](https://github.com/scottyhardy/docker-wine) - Docker image that includes Wine and Winetricks for running Windows applications on Linux and macOS.\n- [dockerized](https://github.com/datastack-net/dockerized) - Run popular commandline tools within docker.\n- [dockersh](https://github.com/Yelp/dockersh) - A shell which places users into individual docker containers.\n- [dotmesh](https://github.com/dotmesh-io/dotmesh) - Dotmesh (dm) is like git for your data volumes (databases, files etc) in Docker and Kubernetes.\n- [dragonfly2](https://github.com/dragonflyoss/Dragonfly2) - Dragonfly is an intelligent P2P based file distribution system.\n- [drakov](https://github.com/Aconex/drakov) - Mock Server that implements the API Blueprint specification.\n- [eksctl](https://github.com/weaveworks/eksctl) - A CLI for Amazon EKS.\n- [erda](https://github.com/erda-project/erda) - An enterprise-grade application building, deploying, monitoring platform (An iPaaS).\n- [escalator](https://github.com/atlassian/escalator) - Escalator is a batch or job optimized horizontal autoscaler for Kubernetes.\n- [firezone](https://github.com/firezone/firezone) - VPN server and Linux firewall built on WireGuard®. Supports SSO, MFA, and user-scoped access rules.\n- [fleet](https://github.com/rancher/fleet) - Manage large fleets of Kubernetes clusters.\n- [freshpod](https://github.com/googlecloudplatform/freshpod) - Restart Pods on Minikube automatically on image rebuilds.\n- [fubectl](https://github.com/kubermatic/fubectl) - Reduces repetitive interactions with kubectl.\n- [garden](https://github.com/garden-io/garden) - Development orchestrator for Kubernetes, containers and serverless functions.\n- [gardener](https://github.com/gardener/gardener) - Kubernetes API server extension and controller manager providing conformant Kubernetes clusters (a.k.a. (off)shoot clusters) as a service (with day-2 ops) on Alibaba, AWS, Azure, GCP, and OpenStack.\n- [go-kubectx](https://github.com/aca/go-kubectx) - 5x-10x faster alternative to kubectx. Uses client-go.\n- [istio-pod-network-controller](https://github.com/sabre1041/istio-pod-network-controller) - Controller to manage Istio Pod Network.\n- [k](https://github.com/yggheim/k) - Exec into kubernetes pod easy (via kubectl).\n- [k8s-mirror](https://github.com/darkbitio/k8s-mirror) - Creates a local mirror of a Kubernetes cluster in a docker container to support offline reviewing.\n- [k8s-snapshots](https://github.com/miracle2k/k8s-snapshots) - Automatic Volume Snapshots on Kubernetes.\n- [kail](https://github.com/boz/kail) - Kubernetes log viewer.\n- [karpenter](https://github.com/aws/karpenter) - Kubernetes Node Autoscaling: built for flexibility, performance, and scalability.\n- [kcg](https://github.com/bit-cloner/kcg) - Kubernetes config generator.\n- [kconmon](https://github.com/Stono/kconmon) - A Kubernetes node connectivity monitoring tool.\n- [kpack](https://github.com/pivotal/kpack) - Kubernetes Native Container Build Service.\n- [kind](https://github.com/kubernetes-sigs/kind) - Kubernetes IN Docker - local clusters for testing Kubernetes.\n- [kip](https://github.com/elotl/kip) - Virtual-kubelet provider running pods in cloud instances.\n- [klotho](https://github.com/klothoplatform/klotho) - Write AWS applications at lightning speed.\n- [kops](https://github.com/kubernetes/kops) - Kubernetes Operations (kops) - Production Grade K8s Installation, Upgrades, and Management.\n- [krane](https://github.com/Shopify/krane) - A command-line tool that helps you ship changes to a Kubernetes namespace and understand the result.\n- [ksctl](https://github.com/kubesimplify/ksctl) - A Generic Kubernetes Management CLI tool for multi-cloud Kubernetes clusters.\n- [kstone](https://github.com/tkestack/kstone) - Kstone is an etcd management platform, providing cluster management, monitoring, backup, inspection, data migration, visual viewing of etcd data, and intelligent diagnosis.\n- [krustlet](https://github.com/deislabs/krustlet) - Kubernetes Rust Kubelet.\n- [ksniff](https://github.com/eldadru/ksniff) - Kubectl plugin to ease sniffing on Kubernetes pods using tcpdump and Wireshark.\n- [ksonnet-lib](https://github.com/ksonnet/ksonnet-lib) - (technical preview) Simplify working with Kubernetes.\n- [ksonnet](https://github.com/ksonnet/ksonnet) - A CLI-supported framework that streamlines writing and deployment of Kubernetes configurations to multiple clusters.\n- [ksync](https://github.com/ksync/ksync) - Sync files between your local system and a kubernetes cluster.\n- [kt-connect](https://github.com/alibaba/kt-connect) - Manage and Integration with your Kubernetes dev environment more efficient.\n- [ktmpl](https://github.com/InQuicker/ktmpl) - Parameterized templates for Kubernetes manifests.\n- [kube-capacity](https://github.com/robscott/kube-capacity) - A simple CLI that provides an overview of the resource requests, limits, and utilization in a Kubernetes cluster.\n- [kube-downscaler](https://github.com/hjacobs/kube-downscaler) - Scale down Kubernetes deployments after work hours.\n- [kube-fledged](https://github.com/senthilrch/kube-fledged) - A kubernetes add-on for creating and managing a cache of container images in a kubernetes cluster.\n- [kube-lineage](https://github.com/tohjustin/kube-lineage) - A CLI tool to display all dependencies or dependents of an object in a Kubernetes cluster.\n- [kube-linter](https://github.com/stackrox/kube-linter) - KubeLinter is a static analysis tool that checks Kubernetes YAML files and Helm charts to ensure the applications represented in them adhere to best practices.\n- [kube-ps1](https://github.com/jonmosco/kube-ps1) - Kubernetes prompt info for bash and zsh.\n- [kube-shell](https://github.com/cloudnativelabs/kube-shell) - Kubernetes shell: An integrated shell for working with the Kubernetes CLI.\n- [kube-version-converter](https://github.com/fleeto/kube-version-converter) - Convert API Object file into specified version.\n- [kubean](https://github.com/kubean-io/kubean) - Kubernetes lifecycle management operator based on kubespray.\n- [kubeasz](https://github.com/easzlab/kubeasz) - 使用Ansible脚本安装K8S集群，介绍组件交互原理，方便直接，不受国内网络环境影响.\n- [kubeadm-offline-installer](https://github.com/fleeto/kubeadm-offline-installer) - Setup a cluster with kubeadm, without internet connections.\n- [kubeadm](https://github.com/kubernetes/kubeadm) - Aggregator for issues filed against kubeadm.\n- [kubebox](https://github.com/astefanutti/kubebox) - Terminal console for Kubernetes clusters.\n- [kubebuilder](https://github.com/kubernetes-sigs/kubebuilder) - Kubebuilder - SDK for building Kubernetes APIs using CRDs.\n- [kubecarrier](https://github.com/kubermatic/kubecarrier) - KubeCarrier - Service Management at Scale.\n- [kubecdn](https://github.com/ilhaan/kubeCDN) - Self-hosted CDN based on Kubernetes.\n- [kubecfg](https://github.com/bitnami/kubecfg) - A tool for managing complex enterprise Kubernetes environments as code.\n- [kubectl-doctor](https://github.com/emirozer/kubectl-doctor) - Kubectl cluster triage plugin for Kubernetes (brew doctor equivalent).\n- [kubectl-trace](https://github.com/iovisor/kubectl-trace) - Schedule bpftrace programs on your kubernetes cluster using the kubectl.\n- [kubectl-tree](https://github.com/ahmetb/kubectl-tree) - kubectl plugin to browse Kubernetes object hierarchies as a tree 🎄 (using? star the repo!)\n- [kubedb](https://github.com/k8sdb/cli) - KubeDB CLI to manage kubernetes ready production-grade Databases.\n- [kubedirector](https://github.com/bluek8s/kubedirector) - Kubernetes Director (aka KubeDirector) for deploying and managing stateful applications on Kubernetes.\n- [kubefirst](https://github.com/kubefirst/kubefirst) - The Kubefirst Open Source Platform.\n- [kubefwd](https://github.com/txn2/kubefwd) - Bulk port forwarding Kubernetes services for local development.\n- [kubehandler](https://github.com/gojektech/kubehandler) - A framework for writing Kubernetes controllers.\n- [kubeiql](https://github.com/yipeeio/kubeiql) - A GraphQL interface for Kubernetes.\n- [kubeletctl](https://github.com/cyberark/kubeletctl) - A client for kubelet.\n- [kubelibrary](https://github.com/devopsspiral/KubeLibrary) - Kubernetes library for Robot Framework.\n- [kubeload](https://github.com/Efrat19/kubeload) - Jobs managing K8S operator for IAC-oriented load tests.\n- [kubeonoff](https://github.com/GambitResearch/kubeonoff) - A simple web UI for managing Kubernetes deployments.\n- [kuberlr](https://github.com/flavio/kuberlr) - A tool that simplifies the management of multiple versions of kubectl.\n- [kubernetes-client](https://github.com/fabric8io/kubernetes-client) - Java client for Kubernetes & OpenShift 3.\n- [kubernetes-vagrant-centos-cluster](https://github.com/rootsongjc/kubernetes-vagrant-centos-cluster) - Setting up a distributed Kubernetes cluster along with Istio service mesh locally with Vagrant and VirtualBox.\n- [kubespray](https://github.com/kubernetes-sigs/kubespray) - Setup a kubernetes cluster also mentioned as kargo.\n- [kubespy](https://github.com/pulumi/kubespy) - Tools for observing Kubernetes resources in real time, powered by Pulumi.\n- [kubesql](https://github.com/xuxinkun/kubesql) - A tool using sql to query the resources of kubernetes, such as pod, node and so on.\n- [kubetap](https://github.com/soluble-ai/kubetap) - Kubectl plugin to interactively proxy Kubernetes Services with ease.\n- [kubeup](https://github.com/kubeup/archon) - Cluster operation the Kubernetes way.\n- [kubeutr](https://github.com/mr-karan/kubekutr) - Cookie cutter templating tool for scaffolding K8s manifests.\n- [kubie](https://github.com/sbstp/kubie) - A more powerful alternative to kubectx and kubens.\n- [KubiScan](https://github.com/cyberark/KubiScan) - A tool to scan Kubernetes cluster for risky permissions.\n- [kuui](https://github.com/viveksinghggits/kuui) - UI that can be used to edit configmaps/secrets of your kubernetes cluster.\n- [kvdi](https://github.com/tinyzimmer/kvdi) - A Kubernetes-native Virtual Desktop Infrastructure.\n- [kwok](https://github.com/kubernetes-sigs/kwok) - Kubernetes WithOut Kubelet - Simulates thousands of Nodes and Clusters.\n- [microconfig](https://github.com/microconfig/microconfig) - Modern and simple way of microservice configuration management.\n- [microk8s](https://github.com/ubuntu/microk8s) - A kubernetes cluster in a snap.\n- [mindaro](https://github.com/microsoft/mindaro) - Bridge to Kubernetes - for Visual Studio and Visual Studio Code\n- [minikube](https://github.com/kubernetes/minikube) - Run Kubernetes locally.\n- [monday](https://github.com/eko/monday) - A dev tool for microservice developers that run local applications and/or forward some others from Kubernetes or over SSH.\n- [nocalhost](https://github.com/nocalhost/nocalhost) - Nocalhost is Cloud Native Dev Environment.\n- [okteto](https://github.com/okteto/okteto) - Local development experience for Kubernetes apps.\n- [packer](https://github.com/hashicorp/packer) - Packer is a tool for creating identical machine images for multiple platforms from a single source configuration.\n- [pangolin](https://github.com/dpeckett/pangolin) - An enhanced Horizontal Pod Autoscaler for Kubernetes.\n- [pluto](https://github.com/FairwindsOps/pluto) - A cli tool to help discover deprecated apiVersions in Kubernetes.\n- [podtnl](https://github.com/narendranathreddythota/podtnl) - A Powerful CLI that makes your pod available to online without exposing a Kubernetes service.\n- [portainer](https://github.com/portainer/portainer) - Simple management UI for Docker.\n- [powerfulseal](https://github.com/powerfulseal/powerfulseal)- A powerful testing tool for Kubernetes clusters.\n- [rafter](https://github.com/kyma-project/rafter) - Kubernetes-native S3-like files/assets store based on CRDs and powered by MinIO.\n- [rback](https://github.com/team-soteria/rback) - RBAC in Kubernetes visualizer.\n- [reloader](https://github.com/stakater/Reloader) - A Kubernetes controller to watch changes in ConfigMap and Secrets and do rolling upgrades on Pods with their associated Deployment, StatefulSet, DaemonSet and DeploymentConfig.\n- [searchlight](https://github.com/searchlight/searchlight) - Alerts for Kubernetes.\n- [seaworthy](https://github.com/cakehappens/seaworthy) - A CLI to verify Kubernetes resource health.\n- [sealos](https://github.com/labring/sealos) - Sealos is a Kubernetes distribution offering comprehensive solutions for both public and private clouds.\n- [skopeo](https://github.com/containers/skopeo) - Work with remote images registries - retrieving information, images, signing content.\n- [sloop](https://github.com/salesforce/sloop) - Kubernetes History Visualization.\n- [sonobuoy](https://github.com/vmware-tanzu/sonobuoy) - Heptio Sonobuoy is a diagnostic tool that makes it easier to understand the state of a Kubernetes cluster by running a set of Kubernetes conformance tests in an accessible and non-destructive manner.\n- [squash](https://github.com/solo-io/squash) - The debugger for microservices.\n- [stash](https://github.com/stashed/stash) - Backup your Kubernetes Volumes.\n- [statusbay](https://github.com/similarweb/statusbay) - Kubernetes deployment visibility like a pro.\n- [stern](https://github.com/wercker/stern) - Multi pod and container log tailing for Kubernetes.\n- [swagger](https://github.com/swagger-api/swagger-ui) - Swagger UI is a collection of HTML, JavaScript, and CSS assets that dynamically generate beautiful documentation from a Swagger-compliant API.\n- [talos](https://github.com/talos-systems/talos) - A modern OS for Kubernetes.\n- [tectonic-installer](https://github.com/coreos/tectonic-installer) - Install a Kubernetes cluster the CoreOS Tectonic Way: HA, self-hosted, RBAC, etcd Operator, and more.\n- [teleport](https://github.com/gravitational/teleport) - Certificate authority and access plane for SSH, Kubernetes, web apps, databases and desktops.\n- [telepresence](https://github.com/telepresenceio/telepresence) - Local development against a remote Kubernetes or OpenShift cluster.\n- [terminus](https://github.com/godaddy/terminus) - Graceful shutdown and Kubernetes readiness / liveness checks for any Node.js HTTP applications.\n- [test-infra](https://github.com/kubernetes/test-infra) - Test infrastructure for the Kubernetes project.\n- [tensile-kube](https://github.com/virtual-kubelet/tensile-kube) - A Kubernetes Provider.\n- [tini](https://github.com/krallin/tini) - A tiny but valid `init` for containers.\n- [tor-controller](https://github.com/kragniz/tor-controller) - Run Tor onion services on Kubernetes.\n- [usernetes](https://github.com/rootless-containers/usernetes) - Kubernetes installable under $HOME, without the root privileges.\n- [vagrant](https://github.com/hashicorp/vagrant) - Vagrant is a tool for building and distributing development environments.\n- [watchtower](https://github.com/containrrr/watchtower) - Automatically update running Docker containers.\n- [wksctl](https://github.com/weaveworks/wksctl) - Open Source Weaveworks Kubernetes System.\n- [xlskubectl](https://github.com/learnk8s/xlskubectl) - A spreadsheet to control your Kubernetes cluster.\n\n## Tracing\n\n- [appdash](https://github.com/sourcegraph/appdash) - Application tracing system for Go, based on Google's Dapper.\n- [jaeger](https://github.com/jaegertracing/jaeger) - Jaeger, a Distributed Tracing System.\n- [opencensus](https://github.com/census-instrumentation) - A single distribution of libraries that automatically collect traces and metrics from your app, display them locally, and send them to any backend.\n- [opentelemetry](https://github.com/open-telemetry/opentelemetry-specification) - An observability framework for cloud-native software.\n- [opentracing](https://github.com/opentracing) - Consistent, expressive, vendor-neutral APIs for distributed tracing and context propagation.\n- [pinpoint](https://github.com/naver/pinpoint) - Pinpoint is an open source APM (Application Performance Management) tool for large-scale distributed systems written in Java.\n- [sentry](https://github.com/getsentry/sentry) - Sentry is a cross-platform crash reporting and aggregation platform.\n- [skywalking](https://github.com/apache/skywalking) - An APM system for tracing, monitoring, diagnosing distributed systems, especially based on microservices, cloud native and container.\n- [sofa-tracker](https://github.com/sofastack/sofa-tracer) - SOFATracer is a component for the distributed system call trace. And through a unified traceId logging the logs of various network calls in the invoking link . These logs can be used for quick discovery of faults, service governance, etc.\n- [zipkin](https://github.com/openzipkin/zipkin) - Zipkin is a distributed tracing system.\n\n## Tutorials\n- [aws-eks-best-practices](https://github.com/aws/aws-eks-best-practices/) - A best practices guide for day 2 operations, including operational excellence, security, reliability, performance efficiency, and cost optimization.\n- [aws-workshop-for-kubernetes](https://github.com/aws-samples/aws-workshop-for-kubernetes) - AWS Workshop for Kubernetes.\n- [cloud-native-library](https://github.com/rootsongjc/cloud-native-library) - 云原生资料库 Cloud Native Library.\n- [developer-roadmap](https://github.com/kamranahmedse/developer-roadmap) - Interactive roadmaps, guides and other educational content to help developers grow in their careers.\n- [envoy-steps](https://github.com/datawire/envoy-steps) - Envoy Step by Step.\n- [envoy-tutorial](https://github.com/rootsongjc/envoy-tutorial) - Envoy mesh in kubernetes tutorial.\n- [falco-analyze-audit-log-from-k3s-cluster](https://github.com/developer-guy/falco-analyze-audit-log-from-k3s-cluster) - Detect intrusions that happened in your Kubernetes cluster through audit logs using Falco.\n- [istio-index-conf2018](https://github.com/todkap/istio-index-conf2018) - Istio is not just for Microservices: Secure your Kubernetes services using Istio Service Mesh.\n- [istio-ingress-tutorial](https://github.com/kelseyhightower/istio-ingress-tutorial) - How to run the Istio Ingress Controller on Kubernetes.\n- [istio-service-mesh-workshop](https://github.com/layer5io/istio-service-mesh-workshop) - Using Istio Workshop.\n- [istio-tutorial](https://github.com/redhat-developer-demos/istio-tutorial) - Istio Tutorial for Java Microservices.\n- [istio101](https://github.com/IBM/istio101) - Istio 101 workshop from IBM.\n- [ks](https://github.com/red-gate/ks) - A series of Kubernetes walk-throughs.\n- [kube-ladder](https://github.com/caicloud/kube-ladder) - Learning Kubernetes, The Chinese Taoist Way.\n- [kubeadm-workshop](https://github.com/luxas/kubeadm-workshop) - Showcasing a bare-metal multi-platform kubeadm setup with persistent storage and monitoring.\n- [kubernetes-handbook](https://github.com/rootsongjc/kubernetes-handbook) - Kubernetes中文指南/云原生应用架构实践手册.\n- [kubernetes-java-simple](https://github.com/arun-gupta/kubernetes-java-sample) - Kubernetes Hands-on Workshop for Java Developers.\n- [kubernetes-on-aws](https://github.com/zalando-incubator/kubernetes-on-aws) - Deploying Kubernetes on AWS with CloudFormation and Ubuntu.\n- [kubernetes-security-best-practice](https://github.com/freach/kubernetes-security-best-practice) - Kubernetes Security - Best Practice Guide.\n- [kubernetes-the-hard-way](https://github.com/kelseyhightower/kubernetes-the-hard-way) - Bootstrap Kubernetes the hard way on Google Cloud Platform. No scripts.\n- [kubicorn](https://github.com/kris-nova/kubicorn-fork) - Create, manage, snapshot, and scale Kubernetes infrastructure in the public cloud.\n- [mosn-tutorial](https://github.com/mosn/mosn-tutorial) - Tutorial for MOSN and Istio Service Mesh.\n\n## UI\n\n- [breeze](https://github.com/wise2c-devops/breeze) - Wise2C ansible playbook for Kubernetes cluster installation.\n- [choerodon](https://github.com/choerodon/choerodon) - The open source PaaS for Kubernetes.\n- [cloudfoundry](https://github.com/cloudfoundry) - Cloud Foundry is an open source, multi cloud application platform as a service (PaaS) governed by the Cloud Foundry Foundation.\n- [conjure-up](https://github.com/conjure-up/conjure-up) - Deploying complex solutions, magically.\n- [dashboard](https://github.com/kubernetes/dashboard) - General-purpose web UI for Kubernetes clusters.\n- [kdash](https://github.com/kdash-rs/kdash) - A simple and fast dashboard for Kubernetes.\n- [kqeen](https://github.com/Mirantis/kqueen) - Kubernetes queen - cluster manager.\n- [kubermatic](https://github.com/kubermatic/kubermatic) - The Central Kubernetes Management Platform For Any Infrastructure.\n- [kubernator](https://github.com/smpio/kubernator) - Alternative Kubernetes UI.\n- [kubesphere](https://github.com/kubesphere/kubesphere) - Enterprise Container Managent Platform.\n- [kubevious](https://github.com/kubevious/kubevious) - Kubevious - application centric Kubernetes UI and continuous assurance provider.\n- [oneinfra](https://github.com/oneinfra/oneinfra) - Kubernetes as a Service.\n- [opendcp](https://github.com/weibocom/opendcp) - Docker platform developed by weibo.\n- [openshift](https://github.com/openshift/origin) - Enterprise Kubernetes for Developers.\n- [rainbond](https://github.com/goodrain/rainbond) - Serverless PaaS , A new generation of easy-to-use cloud management platforms based on kubernetes.\n- [rancher](https://github.com/rancher/rancher) - Complete container management platform.\n- [wayne](https://github.com/Qihoo360/wayne) - Web UI for Kubernetes multi-clusters.\n\n## Community\n\n- [Cloud Native Community (China)](https://cloudnative.to)\n- [Cloud Native Computing Foundation](https://www.cncf.io/)\n\n## Contribute\n\nThis website is hosted on GitHub Pages within [rootsongjc/awesome-cloud-native](https://github.com/rootsongjc/awesome-cloud-native) repository.\n\nPlease take a quick gander at the **[contribution guidelines](https://github.com/rootsongjc/awesome-cloud-native/blob/master/CONTRIBUTING.md)** first. Thanks to all **[contributors](https://github.com/rootsongjc/awesome-cloud-native/graphs/contributors)**, you rock 🤟!k\n"
}